{"tstorg":0,"examplecorp001":1,"003":2,"lack":3,"authorization":4,"controls":5,"storage":6,"api":7,"011":8,"finding":9,"weak":10,"administrative":11,"credentials":12,"012":13,"plaintext":14,"passwords":15,"written":16,"logs":17,"001":18,"sensitive":19,"production":20,"data":21,"used":22,"staging":23,"002":24,"use":25,"shared":26,"administrator":27,"004":28,"firmware":29,"bootloader":30,"downgrades":31,"prevented":32,"005":33,"ineffective":34,"integrity":35,"validation":36,"007":37,"unencrypted":38,"communication":39,"channel":40,"camera":41,"web":42,"services":43,"008":44,"horizontal":45,"bypass":46,"010":47,"application":48,"uses":49,"hash":50,"store":51,"013":52,"insecure":53,"random":54,"number":55,"generation":56,"006":57,"revenue":58,"generating":59,"advertisement":60,"delivery":61,"can":62,"bypassed":63,"009":64,"password":65,"complexity":66,"requirements":67,"sr":68,"109":69,"iam":70,"roles":71,"assigned":72,"excessive":73,"permissions":74,"overly":75,"permissive":76,"network":77,"configuration":78,"unauthorised":79,"access":80,"s3":81,"buckets":82,"user":83,"without":84,"mfa":85,"enabled":86,"policy":87,"automated":88,"backups":89,"rds":90,"instances":91,"single":92,"availability":93,"zone":94,"instance":95,"multi":96,"unused":97,"security":98,"groups":99,"subnets":100,"using":101,"default":102,"acls":103,"cloudformation":104,"stack":105,"termination":106,"protection":107,"128":108,"ssh":109,"private":110,"key":111,"bucket":112,"github":113,"repository":114,"good":115,"practice":116,"observed":117,"oauth":118,"misconfiguration":119,"jenkins":120,"broken":121,"control":122,"outdated":123,"software":124,"csrf":125,"disabled":126,"clear":127,"text":128,"root":129,"account":130,"recently":131,"ebs":132,"volumes":133,"encryption":134,"allowing":135,"communications":136,"allows":137,"assumerole":138,"action":139,"any":140,"resource":141,"medium":142,"risk":143,"rating":144,"passing":145,"role":146,"group":147,"hardening":148,"implemented":149,"10":150,"kubernetes":151,"pod":152,"unrestricted":153,"cluster":154,"103":155,"missing":156,"oracle":157,"patches":158,"tns":159,"listener":160,"poisoning":161,"attack":162,"remote":163,"login":164,"file":165,"profile":166,"settings":167,"configured":168,"case":169,"insensitive":170,"hashes":171,"users":172,"create":173,"procedure":174,"privilege":175,"database":176,"over":177,"sql":178,"server":179,"running":180,"local":181,"system":182,"c2":183,"audit":184,"xp_cmdshell":185,"014":186,"sa":187,"015":188,"enforce":189,"expiration":190,"set":191,"016":192,"mixed":193,"mode":194,"authentication":195,"017":196,"public":197,"xp_instance_regread":198,"xp_regread":199,"stored":200,"procedures":201,"018":202,"via":203,"rpc":204,"019":205,"auditing":206,"failed":207,"logins":208,"only":209,"020":210,"error":211,"too":212,"low":213,"104":214,"device":215,"vulnerabilities":216,"widely":217,"scoped":218,"legacy":219,"protocol":220,"rule":221,"permits":222,"telnet":223,"test":224,"temporary":225,"rules":226,"present":227,"allow":228,"icmp":229,"message":230,"type":231,"status":232,"open":233,"proxy":234,"address":235,"resolution":236,"arp":237,"redirect":238,"messages":239,"were":240,"time":241,"source":242,"authenticated":243,"interfaces":244,"pre":245,"logon":246,"banner":247,"based":248,"duplicate":249,"overlapping":250,"comment":251,"annotation":252,"testorg":253,"1604_moss_phpmyadmin":254,"csv":255,"export":256,"arbitrary":257,"command":258,"execution":259,"logout":260,"actions":261,"vulnerable":262,"ability":263,"unset":264,"global":265,"variables":266,"session":267,"fixation":268,"vulnerability":269,"url":270,"get":271,"query":272,"parameters":273,"phpmyadmin":274,"content":275,"traversal":276,"reporting":277,"self":278,"xss":279,"table_row_action":280,"php":281,"multiple":282,"http":283,"links":284,"testorgphp":285,"unsupported":286,"third":287,"party":288,"certificate":289,"poor":290,"development":291,"lifecycle":292,"hard":293,"coded":294,"trivial":295,"subscope":296,"variable":297,"overshadows":298,"outer":299,"scope":300,"todo":301,"comments":302,"indicate":303,"incomplete":304,"code":305,"static":306,"secrets":307,"incorrect":308,"creation":309,"object":310,"all":311,"exceptions":312,"caught":313,"processing":314,"md5":315,"sha1":316,"inconsistent":317,"injection":318,"prevention":319,"nested":320,"statements":321,"curly":322,"braces":323,"calls":324,"side":325,"effects":326,"unreachable":327,"itself":328,"parameter":329,"before":330,"urls":331,"cloud":332,"names":333,"basic":334,"pt":335,"rcms":336,"title":337,"image":338,"upload":339,"alt":340,"refinery":341,"cms":342,"add":343,"new":344,"page":345,"samplewapt":346,"dologin":347,"become":348,"other":349,"manipulated":350,"jwt":351,"takeover":352,"sms":353,"reset":354,"change":355,"updatepassword":356,"read":357,"example":358,"files":359,"design":360,"pattern":361,"creates":362,"request":363,"forgery":364,"ssrf":365,"returns":366,"json":367,"responses":368,"misconfigured":369,"passrole":370,"permission":371,"potential":372,"verbose":373,"disclose":374,"information":375,"backdoor":376,"complex":377,"methods":378,"101":379,"uploaded":380,"types":381,"restricted":382,"reflected":383,"cross":384,"site":385,"scripting":386,"interface":387,"exposed":388,"asp":389,"net":390,"header":391,"disclosure":392,"discloses":393,"internal":394,"ip":395,"wsld":396,"descriptions":397,"could":398,"obtained":399,"unauthenticated":400,"invalid":401,"ssl":402,"hosts":403,"respond":404,"directory":405,"listings":406,"support":407,"tls":408,"versions":409,"above":410,"beast":411,"weaknesses":412,"wmf1214":413,"external":414,"reference":415,"svg":416,"class":417,"11":418,"13":419,"entity":420,"expansion":421,"xmp":422,"metadata":423,"upper":424,"limit":425,"length":426,"dos":427,"15":428,"pdf":429,"14":430,"custom":431,"javascript":432,"may":433,"yield":434,"escalation":435,"registry":436,"lock":437,"domain":438,"inspect":439,"each":440,"personal":441,"check":442,"lacks":443,"12":444,"rc4":445,"cipher":446,"102":447,"username":448,"enumeration":449,"function":450,"operating":451,"signed":452,"closed":453,"udp":454,"ports":455,"discovered":456,"checking":457,"jailbreak":458,"detection":459,"renegotiation":460,"backgrounding":461,"screenshot":462,"manual":463,"screenshots":464,"":465}