{
  "NCC-ExampleCorp001-003": "Finding Lack of Authorization Controls for Storage API\nRisk High Impact: High, Exploitability: High\nIdentifier NCC-ExampleCorp001-003\nCategory Access Controls\nComponent Camera Repository\nLocation Device Association Mapper\nImpact A successful exploit would result in the compromise of A1 (user camera images), and lead to\na loss of user trust in the Secure Camera brand.\nDescription During interviews, NCC Group was notified that the Camera Repository and Storage API use\nthe device ID sent in the request to fetch the images that belong to the specified camera. As\na result of those interviews, NCC Group believes that no validation is performed to ensure the\nspecified device ID is associated with the logged in user’s account or session ID. It appears\nthat a malicious authorized external user could modify the device ID sent in their camera’s\nrequest to the Storage API, and potentially view images from the Camera Repository that they\nare not authorized to view.\nExploitation of this issue would result in severe privacy violations for ExampleCorp’s users.\nIf it is true that any user could modify their device ID in order to read images from other\nusers’ cameras, it would result in significant harms to those users (whose cameras have likely\nrecorded many sensitive images) and to ExampleCorp’s reputation.\nRecommendation NCC Group recommends this attack vector be thoroughly assessed during the upcoming\nmanual penetration testing effort. The Device Association Mapper component should confirm\nwith the Device Ownership Manager component that the device ID sent in the request belongs\nto the authenticated user whose session ID was presented in the original request.\n12 | Sample Architecture Review - © NCC Group 2020 NCC Group Confidential\nSAMPLE\n",
  "NCC-ExampleCorp001-011": "Finding Weak Administrative Credentials\nRisk High Impact: High, Exploitability: Medium\nIdentifier NCC-ExampleCorp001-011\nCategory Configuration\nComponent Administration API\nImpact If a malicious user is able to guess or brute force the administrator password, they would get\nunauthorized access to all data in the Secure Camera system (A1, A2, A6, A7, A8, A9, A10, A11,\nA12 and A13) from the assets identified inThreat Model on page 7.\nDescription Administrative accounts and internal infrastructure must take extra care to ensure attackers\ncannot gain access. If the interface allows access using credentials (for example, using a\nusername and password), those credentials should be randomly generated and unguessable.\nCredentials that are simple, widely known, or not changed from the default values represent\na single point of compromise for the application.\nThe application has an administrative interface that is protected with weak or default cre-\ndentials. An attacker with access to this interface may be able to gain access by guessing or\nbrute-forcing those credentials, resulting in full compromise of the application.\nRecommendation Change the password to a strong, random value. Do not store the password in source code;\nensure that only a small number of trusted users have access to the primary admin password.\nDo not use this account for day-to-day access. Instead, set up individual accounts for each\nuser with tightly-scoped permissions, and only use the high-privileged account in exceptional\nscenarios. When employees leave the company, all accounts they have access to should rotate\ncredentials.\n13 | Sample Architecture Review - © NCC Group 2020 NCC Group Confidential\nSAMPLE\n",
  "NCC-ExampleCorp001-012": "Finding Plaintext Passwords Written to Logs\nRisk High Impact: High, Exploitability: Medium\nIdentifier NCC-ExampleCorp001-012\nCategory Auditing and Logging\nComponent User Management\nImpact An attacker who obtains access to the application’s log files would be able to view sensitive\ninformation such as user credentials.\nDescription Applications make use of logging functions to ease development, monitor application activity,\nor audit actions after the fact. Access controls on the log files are often more lax than those\non the application itself. For example, if information that is normally stored in an encrypted\nform is written to a log, an attacker could access it without obtaining the decryption key.\nAdditionally, an organization may permit internal access to log files with less strict controls\nthan to the application’s database. When creating log entries, therefore, care should be taken\nto ensure that no sensitive information is written, since this could provide attackers an easier\npath to obtaining that data.\nWhile reviewing the application’s design documentation, NCC Group identified a code snippet\nthat appears to log sensitive information. The code snippet is listed below:\nlogger.log(\"User entered username \" + username + \" and password \" + password);\nListing 1:authentication_proof_of_concept.java line 55\nRecommendation Either remove the noted log entries entirely, or carefully sanitize them to remove any sensitive\ninformation. Once that is done, clear or sanitize the existing logs to remove sensitive data\nstored within.\n14 | Sample Architecture Review - © NCC Group 2020 NCC Group Confidential\nSAMPLE\n",
  "NCC-ExampleCorp001-001": "Finding Sensitive Production Data Used in Staging\nRisk Medium Impact: High, Exploitability: Medium\nIdentifier NCC-ExampleCorp001-001\nCategory Data Exposure\nComponent Processes/Procedures\nImpact Cloning sensitive data into the staging environment reveals several critical assets of the Secure\nCamera system to Unauthorized Secure Camera Employees (TA8), and could lead to a loss of\nuser trust in the Secure Camera brand.\nDescription During interviews, NCC Group was informed that developers routinely clone data from the\nproduction databases for testing purposes into the staging environment. Generally, a staging\nenvironment is a non-production environment and should not be considered secure. NCC\nGroup’s experience has shown that non-production environments often have more lax secu-\nrity controls, including:\n• Less-strict access control policies for administration\n• High-privileged accounts accessible to testing staff\n• Shared accounts and credentials, which prevent traceability and increase the risk of pass-\nword leakage\n• Deployment processes allowing for lower-privileged users to deploy code and enable untested,\nvulnerable code to be deployed\nRecommendation Non-production environments should not be considered secure and there should be minimal\ncross-over between a non-production environment and production data and systems.\nDevelopers should not have access to sensitive customer information stored in the produc-\ntion environment, including user camera images (A1), user authentication tokens (A2), user\ncredentials (A9), customer PII (A12), or the OAuth signing key (A13). If data is needed in the\nstaging environment databases for testing purposes, NCC Group recommends ExampleCorp\ndevelop fake or masked test data for developers to use. This data should contain no customer\nidentifiable information, or reveal any sensitive user data.\n15 | Sample Architecture Review - © NCC Group 2020 NCC Group Confidential\nSAMPLE\n",
  "NCC-ExampleCorp001-002": "Finding Use of Shared Administrator Credentials\nRisk Medium Impact: High, Exploitability: Medium\nIdentifier NCC-ExampleCorp001-002\nCategory Authentication\nComponent Administration API\nImpact The use of shared credentials removes the ability for ExampleCorp to track user activity once\nthey are logged into the system. If a malicious insider misuses their access on the system, it\nwill be difficult (or impossible) to determine who was responsible for the malicious act.\nDescription During interviews, NCC Group was informed that ExampleCorp employees share the same\nusername and password to login to the Secure Camera administration web application. Fur-\nthermore, NCC Group was informed that these shared credentials have never been changed.\nRecommendation Set a strong, complex and unique password for each user who has access to the administrative\ncomponent. If possible, use public key authentication, with keys protected by a passphrase for\nauthentication into the components. Ensure that the host is configured to log both successful\nand failed login attempts, as well as record activity performed on the hosts after a successful\nlogin.\n16 | Sample Architecture Review - © NCC Group 2020 NCC Group Confidential\nSAMPLE\n",
  "NCC-ExampleCorp001-004": "Finding Firmware or Bootloader Downgrades Not Prevented\nRisk Medium Impact: Medium, Exploitability: High\nIdentifier NCC-ExampleCorp001-004\nCategory Patching\nComponent Camera\nImpact An attacker can revert to older images in order to exploit vulnerabilities that had since been\nfixed. Because of the lack of secure boot, it is not possible to implement effective downgrade\nprevention for this device at the hardware level.\nDescription The bootloader does not implement a means to prevent software downgrades. It is common\nfor attackers to downgrade the firmware or software to a version that is known to contain\nexploitable vulnerabilities. In fact, the release of a security patch can trigger attackers to take\nnotice and develop an exploit for older versions.\nRecommendation Implement an effective downgrade prevention mechanism at each stage of the boot process.\nThis could be in the form of a blacklist of “bad” software versions. The blacklist must be\nsigned to prevent tampering and must itself be protected from downgrades. Many processors\ncontain general-purpose fuses that can be used to implement such protection.\n17 | Sample Architecture Review - © NCC Group 2020 NCC Group Confidential\nSAMPLE\n",
  "NCC-ExampleCorp001-005": "Finding Ineffective Firmware Integrity Validation\nRisk Medium Impact: Medium, Exploitability: Medium\nIdentifier NCC-ExampleCorp001-005\nCategory Data Validation\nComponent Camera\nImpact A malicious user can install modified device firmware images on the camera, which could be\nused to bypass business logic or gain unauthorized access to sensitive information.\nDescription During interviews, NCC Group was informed that the firmware download package includes\na SHA256 hash of the firmware image, which is used by the camera to ensure the firmware\nimage has not been tampered with by a malicious user. This is not a sufficient security control,\nas a malicious user who has the ability to modify the firmware image can simply recompute the\nSHA256 hash of the modified image, and replace the hash included in the firmware package.\nRecommendation The firmware package should be protected using a digital signature as apposed to a simple\nhash. The firmware package should be signed using a private key maintained by Exam-\npleCorp, and the signature validated on the camera prior to firmware installation.\n18 | Sample Architecture Review - © NCC Group 2020 NCC Group Confidential\nSAMPLE\n",
  "NCC-ExampleCorp001-007": "Finding Unencrypted Communication Channel (Camera Web Services)\nRisk Medium Impact: Medium, Exploitability: Medium\nIdentifier NCC-ExampleCorp001-007\nCategory Data Exposure\nComponent Camera\nImpact Attackers on the user’s local network can intercept and modify traffic, capturing user creden-\ntials, tokens, and data or modifying traffic flowing between the mobile and web applications\nand the camera.\nDescription The mobile and web applications communicate with the camera using unencrypted HTTP. An\nattacker with access to the user’s local network could easily intercept and monitor or modify\nthe application’s communication.\nThe unencrypted data includes the following types of data, which could be captured or mod-\nified by an attacker:\n• Credentials, including plaintext WiFi passwords and authentication tokens\n• Personally identifiable information (PII)\n• Video footage and audio recordings\nRecommendation Where possible, unencrypted protocols should be replaced with encrypted alternatives.\nHTTP connections should be replaced with HTTPS using TLS 1.2. In a local-network scenario, it\nis generally more difficult to deploy and manage TLS certificates to enable TLS communication.\nNCC Group recommends generating and deploying a device-specific TLS certificate to each\ncamera during the manufacturing or registration process. Assuming the serial number of\nthe camera is “SN12345”, then ExampleCorp’s backend could request a TLS certificate from a\nglobally-trusted CA for “sn12345.examplecorpwificameras.com”.\nAlternatively, a self-signed certificate could be generated at registration time and pinned in\nthe mobile application. However, this would not protect any communications occurring from\nthe web application.\nIn addition to simply configuring HTTPS, the following changes are also needed to enable\nsecure communications:\n1. Ensure that unencrypted requests are redirected to HTTPS.\n2. Set the “Secure” attribute on all sensitive cookies. This will prevent the cookies from leaking\nover unencrypted channels.\n19 | Sample Architecture Review - © NCC Group 2020 NCC Group Confidential\nSAMPLE\n",
  "NCC-ExampleCorp001-008": "Finding Horizontal Authorization Bypass in Storage API\nRisk Medium Impact: High, Exploitability: Medium\nIdentifier NCC-ExampleCorp001-008\nCategory Access Controls\nComponent Camera Repository\nLocation Auth Controller\nImpact Employees or contractors of advertising partners are able to modify session identifiers to gain\naccess to end user image files in cloud storage.\nDescription Authorization controls refer to an application’s functionality for verifying user roles and per-\nmissions. Authorization controls ensure safe access to the application, the data within, the\nability to change the system, and more. Every functional piece of the application should have\na set of authorization controls that encompasses the use cases surrounding it and prevents\nunauthorized users from accessing the protected functionality.\nThe application has insufficient authorization controls for access to the Storage API. According\nto interviews with the development team, it was explained that end user and advertising\npartner authentication uses the same session identifier mechanism, with a specially-modified\nsession token used to differentiate end users from advertising partner sessions. As a result,\nin certain scenarios, advertising partner employees (Threat Agent 4, or TA4) may be able to\ncompute valid end user session identifiers to gain access to the Storage API as an authorized\nend user (TA1).\nAlthough Advertising Partners were considered out of scope for this engagement, NCC Group\ndocumented this finding for further verification due to the potential risks to end user data.\nRecommendation All application functionality should have authorization controls in place and validate those\ncontrols prior to performing an action, including both data retrieval and data modification.\nSpecifically, ExampleCorp should implement an authorization mechanism that ties user roles\nto session identifiers in a way that cannot be modified by end users to bypass role-based\nauthorization checks.\n20 | Sample Architecture Review - © NCC Group 2020 NCC Group Confidential\nSAMPLE\n",
  "NCC-ExampleCorp001-010": "Finding Application Uses Weak Hash to Store Passwords\nRisk Medium Impact: Medium, Exploitability: Medium\nIdentifier NCC-ExampleCorp001-010\nCategory Cryptography\nComponent User Management\nImpact An attacker who is able to compromise the application’s storage, such as through a database\nflaw or information disclosure, can more easily recover user passwords.\nDescription The application stores user passwords using unsalted SHA256.\nThis hash can be performed very quickly, thus hashed passwords are vulnerable to brute-\nforce cracking. An attacker with access to the hashed passwords is likely to be able to recover\nsignificant numbers of plaintext passwords using a tool such ashashcat.\nPasswords are hashed without being salted. A salt is a random per-password value which\nslows down cracking attempts by requiring attackers to perform a new brute-force attack on\neach password. For example, with a salt, two users with the password “123456” would have\ndifferent password hashes. Without a salt, an attacker can perform their brute-force attack\non all of the application’s passwords at once without any additional work, or make use of a\nrainbow table.\nRecommendation NCC Group recommends usingbcrypt, a widely-supported hash that handles salting automat-\nically. This hashing algorithm is designed to resist brute-forcing attempts. The only aspect of\nbcrypt that requires manual configuration is the “cost factor”, a value which determines how\nmany iterations to perform1 (thus determining the amount of processing time necessary to\nhash a single password). NCC Group recommends that most application use a cost factor\nof 12. On modern processors, this cost factor results in hashing taking approximately half a\nsecond for each password.2\nTo upgrade to a modern password hash, there are a number of possible strategies:\n• Discard all existing hashes and force users to set new passwords. This strategy may work\nwell for applications with a small number of users who can be reached directly, such as\ninternal company applications.\n• Upgrade users at their next login by comparing the existing hash, saving the new hash, and\nfinally discarding the existing hash. This strategy is effective for active users, but can have\nissues with users who do not log in for long periods of time: their old, weak password hash\nwill remain in the database until they log in.\n• Immediately upgrading all hashes by using the new hashing algorithm on the existing hashed\npasswords. When users log in, first hash their password with the legacy algorithm, then\nhash again with the modern algorithm. This strategy is safe in most cases (even for weak\nalgorithms like MD5), but requires the application to maintain the backwords-compatibility\nlogic indefinitely.\n1See https://security.stackexchange.com/a/3993 for a more in-depth explanation of work factors for password\nhashing.\n2See https://security.stackexchange.com/a/83382 for a benchmark of bcrypt on a recent Intel processor.\n21 | Sample Architecture Review - © NCC Group 2020 NCC Group Confidential\nSAMPLE\n",
  "NCC-ExampleCorp001-013": "Finding Insecure Random Number Generation\nRisk Medium Impact: Medium, Exploitability: Medium\nIdentifier NCC-ExampleCorp001-013\nCategory Cryptography\nComponent Device Ownership Manager\nImpact A malicious user who is able to predict device IDs of other cameras can take advantage\nof finding NCC-ExampleCorp001-003 on page 12to view the images taken by the camera\nidentified by the device ID.\nDescription The Secure Camera system makes use of an insecure random number generator (RNG) for\nthe camera device ID generation. When used in a context that requires the numbers to be\ntruly unpredictable, usage of an insecure random number generator can completely defeat\nthe security of the system. Using an insecure generator, or seeding a secure generator with\na predictable value, can allow an attacker to predict the generator’s output.\nThe following random number generators are known to be insecure, and should not be used:\n• Java Random\n• PHP rand, mt_rand\n• JavaScript Math.random\n• libc random()\n• Any other random number generator that does not advertise cryptographic randomness\nRecommendation Any functionality that relies on a random number generator to generate unpredictable values\nshould use a cryptographically-secure random number generator (CSPRNG). It is strongly\nencouraged to use a secure RNG unless the application’s functionality depends on the output\nbeing predictable.\nAny usage of an insecure RNG should be replaced by a CSPRNG. NCC Group recommends\nusing:\n• Unix getrandom() (falling back to/dev/urandom if not available)\n• Windows CryptGenRandom\n• Java SecureRandom (do not manually seed SecureRandom)\n• PHP random_bytes\n• JavaScript window.crypto.getRandomValues\n• Other: randombytes_buf from libsodium\n22 | Sample Architecture Review - © NCC Group 2020 NCC Group Confidential\nSAMPLE\n",
  "NCC-ExampleCorp001-006": "Finding Revenue Generating Advertisement Delivery Can Be Bypassed\nRisk Low Impact: Medium, Exploitability: Low\nIdentifier NCC-ExampleCorp001-006\nCategory Other\nComponent Mobile Application\nImpact Users who are able to disable the targeted advertisements will impact the Secure Camera\nbusiness model, which relies on advertisement delivery for revenue generation.\nDescription During design documentation review, NCC Group determined the mobile application peri-\nodically fetches advertisements from the advertising partner, which is the primary source of\nrevenue for the Secure Camera platform. It appears possible for a malicious user to disable\nadvertisements by blocking client communication to the advertisement partner, or using a\nmodified version of the client application. This would undermine ExampleCorp’s business\nmodel and could ultimately mean the service does not achieve profitability. However, the\noverall risk of the issue is low because it is very unlikely that the issue would be exploited\nat scale due to the technical expertise required for users to set up network blocking of the\nadvertising hosts.\nRecommendation Client-side controls are difficult to enforce as they are running in an untrusted environment,\nsuch as a user’s mobile device. Consider modifying the current architecture to deliver the\ntargeted advertisements through the Secure Camera API responses, which then must be\ncalled to meet the functional requirement of the mobile application.\n23 | Sample Architecture Review - © NCC Group 2020 NCC Group Confidential\nSAMPLE\n",
  "NCC-ExampleCorp001-009": "Finding Weak Password Complexity Requirements\nRisk Low Impact: Medium, Exploitability: Low\nIdentifier NCC-ExampleCorp001-009\nCategory Authentication\nComponent User Management\nImpact An attacker may guess insecure user passwords or brute-force weak user passwords in the\nevent of a password database breach.\nDescription The Secure Camera platform does not enforce any restrictions on user or administrator pass-\nwords. The only current password requirement is a length requirement of 4 characters.\nAs a result, it is possible for users to set their passwords to simple values such as “1234” or\n“abcd”. If a user does use a weak password, an attacker could guess their password and gain\naccess to their account. Alternatively, in the event of a password database breach, an attacker\nis more likely to recover a weak password from a brute-force attack.\nRecommendation When creating or changing user passwords, the application should perform checks for pass-\nword complexity and reuse of previous credentials. Complexity checks may be performed\nclient side in order to provide immediate user feedback, but must be enforced by the backend\nservice, since client-side controls should not be considered an effective security control. NCC\nGroup recommends setting a minimum password length of 12 or more characters.\nDo not require users to regularly update passwords, as this results in weaker passwords\noverall (seeNIST’s new password rules‒what you need to knowfrom Sophos).\nFinally, strongly consider providing users with the option to use multi-factor authentication\nfor all applications.\n24 | Sample Architecture Review - © NCC Group 2020 NCC Group Confidential\nSAMPLE\n"
}