{
  "SR-109-001": "SR-109-001 IAM Roles Assigned With Excessive Permissions\nRisk Rating High Status Open\nDescription:\nAn analysis of the configured roles that were then assigned to running EC2 instances indicated that some of them\nwould receive excessive permissions that could allow arbitrary commands to be launched across all the instances,\nread arbitrary S3 objects, etc.\nAs an example, the following role was present in the AWS configuration reviewed during this assessment:\n[role name]\nThe following is a screenshot for this role listing the inline policies:\nFigure 1: Sample role with inline policies attached\nThe “IAMFullAccess” inline policy was defined as follows:\n{\n\"Version\": \"2020-10-17\",\n\"Statement\": [\n{\n\"Effect\": \"Allow\",\n\"Action\": \"iam:*\",\n\"Resource\": \"*\"\n}\n]\n}\nThe above policy gave administrative permissions to perform all actions in IAM, including managing passwords, access\nkeys, MFA devices and user certificates.\nThis issue was rated as high risk in consideration of the security impact of unrestricted access to the IAM service.\nVersion 1.0- Page 8 of 23 Client Confidential\nRecommendation:\nCreate managed security policies following the least privileges security principle (i.e. including only the minimal set\nof API commands necessary for operations and listing the resources that would be affected by these commands) and\nattach these to the roles in use.1, 2, 3, 4\nAffects:\nAWS Account\n123456789012\n1AWS Identity and Access Management (IAM)https://aws.amazon.com/iam/\n2AWS Identity and Access Management Documentationhttps://aws.amazon.com/documentation/iam/\n3AWS Documentation‒IAM Best Practices: Use AWS Defined Policies to Assign Permissions Whenever Possiblehttps://docs.aws.amazon.com/\nIAM/latest/UserGuide/best-practices.html#bp-use-aws-defined-policies\n4AWS Documentation ‒IAM Best Practices: Grant Least Privilege https://docs.aws.amazon.com/IAM/latest/UserGuide/best-\npractices.html#grant-least-privilege\nVersion 1.0- Page 9 of 23 Client Confidential\n",
  "SR-109-002": "SR-109-002 Overly Permissive Network Configuration\nRisk Rating High Status Open\nDescription:\nExamination of the high level architecture diagram and configured firewall rules indicated that the network configuration was excessively permissive and a number of resources were publicly available.\nThe following high level figure illustrates the external addresses that were allowed a degree of access into the account:\nFigure 2: Global view of the AWS account\nThe following figure illustrates the high level database connectivity within the account:\nFigure 3: High level view of the database connectivity\nVersion 1.0- Page 10 of 23 Client Confidential\nThe following figure illustrates the high level configuration of Virtual Private Networks (VPCs) within the account:\nFigure 4: High level view of the VPC configuration\nAfter review of the above, the following observations can be made:\nu A large number of resources were publicly accessible. This presents an opportunity for abuse, especially in the case\nof sensitive or corporate resources.\nu A permissive network configuration was observed, which allowed connections between resources in different sub-\nlets and VPCs. This poses a significant risk in the event that a host is compromised, as it would potentially enable\nattackers to move laterally within the AWS account.\nu The AWS account held all of ClientName’s assets, including corporate and production environments. This is considered contrary to security best practice.\nRecommendation:\nUnless necessary for normal business operation, ensure that the network is only accessible from internal addresses,\nor if not possible, consider creating a whitelist of external addresses which can access the network. Doing so will limit\nthe resources that are accessible to an attacker. This could deny the individual access to information that may have\nbeen helpful in developing an attack, and it may deny a potential avenue into a achieving a foothold on the network.\nClientName should also limit the access privileges and general interconnectivity of the sublets, VPCs, and AWS account\nin line with the principle of least privilege. These privileges should be reduced to only what is necessary for normal\noperation of the business to as to limit an attacker’s options in the event of a compromise.\nAffects:\nAWS Account\n123456789012\nVersion 1.0- Page 11 of 23 Client Confidential\n",
  "SR-109-003": "SR-109-003 Unauthorised Access to S3 Buckets\nRisk Rating Medium Status Open\nDescription:\nAn S3 bucket was found to be configured with excessive permissions that could allow unauthorised access to the\nstored objects. This bucket included access to logs of the portal web application.\nThe following screenshot from the Management Console shows how full permissions to access the objects stored in\nthe BucketName bucket were granted to any authenticated AWS user:\nFigure 5: S3 bucket access\nThe “Any Authenticated AWS User” is a special group that will include any user having access to AWS and not only the\nusers associated with the ClientName account. To demonstrate this problem, the following command was executed\nusing API keys belonging to an NCC Group account:\n$ aws --profile nccgroup s3 ls --recursive s3://[BucketName]\n…\n2021-01-25 09:45:04 765520 logs-01-25-2021.log\n2021-01-26 11:22:01 801528 logs-01-26-2021.log\n…\nAccording to the permissions visible above, objects could have been downloaded and also deleted or otherwise edited.\nAdditionally, new objects could be uploaded.\nThe following table includes all the S3 buckets affected by this issue and the type of permissions allowed to anonymous\nand any other AWS user (i.e. including AWS users not belonging to ClientName):\nS3 Bucket User type List Upload/delete View Edit\nBucketName Any AWS user Yes Yes Yes Yes\nTechnical details about this issue were transmitted to ClientName during testing and some actions were performed to\nmitigate the risk associated with this issue.\nVersion 1.0- Page 12 of 23 Client Confidential\nRecommendation:\nEdit the permissions associated to the affected S3 buckets ensuring that no permissions are granted to the anonymous\nor “Any Authenticated AWS User” group.5, 6, 7\nAffects:\nAWS Account\n123456789012\n5Amazon S3https://aws.amazon.com/s3/\n6Amazon Simple Storage Service Documentationhttps://aws.amazon.com/documentation/s3/\n7AWS Documentation‒Managing Access Permissions to Your Amazon S3 Resourceshttps://docs.aws.amazon.com/AmazonS3/latest/dev/s3-\naccess-control.html\nVersion 1.0- Page 13 of 23 Client Confidential\n",
  "SR-109-004": "SR-109-004 User Without MFA Enabled\nRisk Rating Medium Status Open\nDescription:\nMultiple accounts were identified which had password authentication enabled but did not have multi-factor authentication (MFA) enabled, contrary to security best practice. If MFA is not enabled, attackers could be able to access the\nAWS web console with just a username and password combination.\nThe following users had password-enabled access but were not configured to use multi-factor authentication:\n<<List of users without MFA enabled>>\nThe users listed above were identified by running the following command from the AWS CLI:\naws iam get-credential-report --query 'Content' --output text | base64 -d | cut -d, -f1,4,8\nThe following was returned during testing in response to the above command:\n[UserName], true, false\nIn this case, “true” after the username means that authentication via password was active. However, “false” returned\nin the third column means that MFA was not active.\nRecommendation:\nImplement MFA for the users with password authentication enabled.8, 9, 10, 11\nAffects:\nAWS Account\n123456789012\n8AWS Identity and Access Management (IAM)https://aws.amazon.com/iam/\n9AWS Identity and Access Management Documentationhttps://aws.amazon.com/documentation/iam/\n10AWS Documentation ‒Using Multi-Factor Authentication (MFA) in AWS https://docs.aws.amazon.com/IAM/latest/UserGuide/\nid_credentials_mfa.html\n11CIS Amazon Web Services Foundationshttps://d0.awsstatic.com/whitepapers/compliance/AWS_CIS_Foundations_Benchmark.pdf\nVersion 1.0- Page 14 of 23 Client Confidential\n",
  "SR-109-005": "SR-109-005 IAM Password Policy\nRisk Rating Medium Status Open\nDescription:\nNo password policy was enabled in the IAM settings. This could result in the creation of weak user passwords.\nThe following screenshot illustrates the password policy settings that were observed:\nFigure 6: Password policy not enforced\nVersion 1.0- Page 15 of 23 Client Confidential\nRecommendation:\nEnsure a strong password policy is in place. Specifically ensure that the following password policy is enforced:12, 13, 14, 15\nu Passwords should use mixed case\nu Passwords should include at least one number\nu Passwords should include at least one symbol\nu Passwords have a minimum length of 14 characters\nu Passwords cannot be reused\nAffects:\nAWS Account\n123456789012\n12AWS Identity and Access Management (IAM)https://aws.amazon.com/iam/\n13AWS Identity and Access Management Documentationhttps://aws.amazon.com/documentation/iam/\n14AWS Documentation‒Managing Passwordshttps://docs.aws.amazon.com/IAM/latest/UserGuide/Credentials-ManagingPasswords.html\n15CIS Amazon Web Services Foundationshttps://www.cisecurity.org/benchmark/amazon_web_services/\nVersion 1.0- Page 16 of 23 Client Confidential\n",
  "SR-109-006": "SR-109-006 Automated Backups Not Enabled for RDS Instances\nRisk Rating Low Status Open\nDescription:\nAutomated backups had not been enabled for a number of Relational Database Service (RDS) instances. This feature\nfacilitates the creation of periodic RDS instance snapshots, which in turn ensure that data restoration is possible in the\nevent of an incident affecting the source database.\nThe following screenshot from the Management Console shows that the production-data and development-db RDS\ninstances had automated backups disabled:\nFigure 7: RDS Instance with automated backups disabled\nRecommendation:\nEnsure that all RDS database instances that host sensitive data have automated backups enabled for point-in-time\nrecovery. 16, 17, 18\nAffects:\nAWS Account\n123456789012\n16Amazon Relational Database Service (RDS)https://aws.amazon.com/rds/\n17Amazon Relational Database Service Documentationhttps://aws.amazon.com/documentation/rds/\n18AWS Documentation ‒Backing Up and Restoring Amazon RDS DB Instanceshttps://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/\nCHAP_CommonTasks.BackupRestore.html\nVersion 1.0- Page 17 of 23 Client Confidential\n",
  "SR-109-007": "SR-109-007 Single Availability Zone RDS Instance\nRisk Rating Low Status Open\nDescription:\nA number of Relational Database Service (RDS) instances were configured without the Multi-Availability Zone (Multi-AZ)\nenabled. Without this, should an availability zone specific database failure occur, then Amazon RDS cannot automatically fail over to the standby availability zone so that database operations can resume quickly without administrative\nintervention.\nThe following database instances (based on the aurora engine) were configured with Multi-AZ disabled:\nu preproduction-data\nu test-data\nu development-db\nThe following screenshot shows that Multi-AZ was disabled for one of the instances listed above:\nFigure 8: RDS Availability Zone\nRecommendation:\nConsideration should be given to modifying the configuration of the database instances to enable Multi-AZ. This is\nespecially important if the applications using the databases require high availability.19, 20, 21\nAffects:\nAWS Account\n123456789012\n19Amazon Relational Database Service (RDS)https://aws.amazon.com/rds/\n20Amazon Relational Database Service Documentationhttps://aws.amazon.com/documentation/rds/\n21AWS Documentation‒High Availability (Multi-AZ)https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/Concepts.MultiAZ.html\nVersion 1.0- Page 18 of 23 Client Confidential\n",
  "SR-109-008": "SR-109-008 Unused Security Groups\nRisk Rating Low Status Open\nDescription:\nA number of security groups were defined which were unused and may not be required. This being the case, their\nexistence in the configuration increases the risk that they may be inappropriately assigned.\nThe following security groups were found to be unused:\nu SecurityGroupName1 (security group IDsg-123456789)\nu SecurityGroupName2 (security group IDsg-123456789)\nu SecurityGroupName3 (security group IDsg-123456789)\nRecommendation:\nThe unused security groups should be reviewed and removed if no longer required.22, 23, 24\nAffects:\nAWS Account\n123456789012\n22Amazon Virtual Private Cloudhttps://aws.amazon.com/vpc/\n23Amazon Virtual Private Cloud Documentationhttps://aws.amazon.com/documentation/vpc/\n24CIS Amazon Web Services Foundationshttps://d0.awsstatic.com/whitepapers/compliance/AWS_CIS_Foundations_Benchmark.pdf\nVersion 1.0- Page 19 of 23 Client Confidential\n",
  "SR-109-009": "SR-109-009 Subnets Using Default Network ACLs\nRisk Rating Low Status Open\nDescription:\nA number of subnets were identified to be using the default Network Access Control List (NACL), allowing all incoming\nand outgoing network traffic. In this configuration, the affected NACLs do not provide the secondary layer of security\ndefence that they are supposed to.\nThe following network ACLs were affected by this issue in the us-east-1 region:\nu «NACL name» (NACL IDacl-123456789)\nu «NACL name» (NACL IDacl-123456789)\nu «NACL name» (NACL IDacl-123456789)\nThe following screenshot was taken from the AWS Management Console and shows the inbound rules available for\nthe first of the NACLs listed above:\nFigure 9: Default network ACL in use\nThe outbound rules were similar, allowing all outgoing traffic.\nIt should be noted that default NACLs were also available across the remaining AWS regions/VPC.\nRecommendation:\nNetwork ACLs should be considered as the secondary layer of security defence against unwanted traffic. Consequently,\nconsideration should be given to implementing NACLs that only allow the necessary inbound and outbound traffic to\nthe associated VPC subnets.25, 26, 27, 28, 29\nAffects:\nAWS Account\n123456789012\n25Amazon Virtual Private Cloudhttps://aws.amazon.com/vpc/\n26Amazon Virtual Private Cloud Documentationhttps://aws.amazon.com/documentation/vpc/\n27AWS Documentation‒VPC Securityhttps://docs.aws.amazon.com/AmazonVPC/latest/UserGuide/VPC_Security.html\n28AWS Documentation‒Network ACLshttps://docs.aws.amazon.com/AmazonVPC/latest/UserGuide/VPC_ACLs.html7\n29AWS Documentation ‒Recommended Network ACL Rules for Your VPC https://docs.aws.amazon.com/AmazonVPC/latest/UserGuide/\nVPC_Appendix_NACLs.html\nVersion 1.0- Page 20 of 23 Client Confidential\n",
  "SR-109-010": "SR-109-010 CloudFormation Stack Without Termination Protection\nRisk Rating Low Status Open\nDescription:\nThe Termination Protection setting available for the CloudFormation service was not found to be enabled for one\nstack. When this feature is enabled for a stack, deletion attempts will fail and the stack (including its current status),\nwill remain unchanged. Security best practice for CloudFormation management recommends enabling this feature\nfor production environments.\nThe following command was run for theStackName stack:\n$ aws cloudformation describe-stacks --region eu-west-1 --stack-name [StackName] --\nquery 'Stacks[*].EnableTerminationProtection'\n[\nfalse\n]\nAs can be seen above, the describe-stacks command returned false, indicating that the Termination Protection\nsafety feature was not enabled for the selected stack.\nIt should be noted that CloudFormation stack policies may also be used to prevent stack resources from being un-\nintentionally updated or deleted during a stack update process. However, stack policies cannot protect stacks from\nbeing terminated, as IAM users who have the permission to delete a stack may still delete it.\nRecommendation:\nEnsure that Amazon CloudFormation stacks have Termination Protection enabled in order to protect them from being\naccidentally deleted.30, 31, 32\nAffects:\nAWS Account\n123456789012\n30AWS CloudFormationhttps://aws.amazon.com/cloudformation/\n31AWS CloudFormation Documentationhttps://aws.amazon.com/documentation/cloudformation/\n32AWS Documentation‒Protecting a Stack From Being Deletedhttps://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/using-cfn-\nprotect-stacks.html\nVersion 1.0- Page 21 of 23 Client Confidential\n5 "
}