{
  "SR-128-1-1": "SR-128-1-1 SSH Private Key in S3 Bucket   \nRisk Rating High  \nSSH Private Key in S3 Bucket \nDescription: \nOne SSL private key was identified in the private GitHub repository. Whilst the key was not immediately exposed \nto unauthorised access, storing keys such as this in an online location (and in an unencrypted format) places \nthem at risk of compromise if an attacker gains access to the GitHub account  or AWS S3 bucket. Information \ncould also be disclosed if a client device where the repositories had been cloned were lost or stolen.  \nRecommendation: \nEnsure that all SSL private keys which will be used in test, staging and production environments are store d \nsecurely and not exposed on public facing systems such as a GitHub repository or in AWS S3 buckets.  \nAffects: \nS3 Bucket Name \ns3://dev.client.com\nVersion 1.0 - Page 14 of 44 Client Confidential \n \n \nSR-128-1-2 Credentials in GitHub Repository   \nRisk Rating Medium  \nCredentials in GitHub Repository \nSome instances of what appeared to be AWS and JFrog passwords or credentials were noted in the private \nGitHub Project repository. Whilst it was not possible to establish from the repositories alone whether all of these \nwere in use in production, in general it is not recommended that credentials should be stored in source code \nrepositories in clear text. \nInstances of passwords stored in cloud formation template files: \nhttps://github/clientuk/project/develop/config \nhttps://github/clientuk/project/develop/deployment/fullstart.json \nAdditionally, a hard-coded password was noted in Python and shell scripts: \nhttps://github/clientuk/project/develop/scripts/s3_pull.py \nhttps://github/clientuk/project/develop/deployment/s3_pull_t.py \nIt was not possible to perform any successful privilege escalation with these credentials. The AWS credentials \nwere for roles or IAM users with S3 buckets who were accorded only limited permissions. \nA list of the files found to contain passwords is available in Supplemental Data, Section 3.1.  \nRecommendation: \nEnsure that credentials are not stored in clear text in GitHub repositories or in AWS S3 buckets. \nAffects: \nGitHub Repository \nProject\nVersion 1.0 - Page 15 of 44 Client Confidential \n \n \n \n",
  "SR-128-1-3": "SR-128-1-3 Good Practice Observed   \nRisk Rating Good  \nGood Practice Observed \nDescription: \nIt was apparent that security had been a consideration in the development and deployment of the pipeline and \nits environment. The risk from various security flaws had been effectively mitigated. A number of useful controls \nand processes were observed to be in place. \nThese included: \n◆ Enforced code reviews \n◆ Defined checks for committing \n◆ Separate teams were responsible for different systems \n◆ Developers could not bypass pipeline steps to introduce new code or change existing code  \n◆ The use of multi-factor authentication was enforced for all AWS and GitHub access \n \nRecommendation: \nEnsure that these practices are maintained by means of training programmes and supporting procedures which \ndefine secure and acceptable practices within the organisation.\nVersion 1.0 - Page 16 of 44 Client Confidential \n \n \n2.1.2 Phase 2 – Jenkins Review \n",
  "SR-128-2-1": "SR-128-2-1 GitHub OAuth Misconfiguration   \nRisk Rating High  \nGitHub OAuth Misconfiguration \nDescription: \nThe GitHub OAuth Plugin provided authentication and authorisation methods for the Jenkins server. The \nauthorisation settings granted read permissions to all Authenticated Users. This meant that any user \nregistered with and logged into GitHub could access Jenkins, even though the Participant in Organization \nsetting was originally set to prevent users from outside the organisation being able to access Jenkins.   \n \nFigure 1 –READ permissions granted to all Authenticated Users \nIt was possible to exploit this issue in combination with the  security weakness described in the Jenkins Broken \nAccess Control issue in order to gain access to the build output from all jobs. \n \nFigure 2 - Accessing Jenkins with a user who was not a member of the Organization\nVersion 1.0 - Page 17 of 44 Client Confidential \n \n \nRecommendation: \nRemove the read permissions to all Authenticated Users in the Global Security Settings.  \nAffects: \nDNS Name \nproject-app-jenkins.staging.clientuk \nReferences: \nGitHub OAuth Plugin \nhttps://wiki.jenkins.io/display/JENKINS/GitHub+OAuth+Plugin\nVersion 1.0 - Page 18 of 44 Client Confidential \n \n \n",
  "SR-128-2-2": "SR-128-2-2 Jenkins Broken Access Control   \nRisk Rating High  \nJenkins Broken Access Control \nDescription: \nJenkins extends its functionality with plugins that c an be developed by third party companies or by individuals. \nThe GitHub OAuth plugin was identified as  being responsible for authentication and authorisation. However, \nthis plugin contained a bug that ignored the permission relationships and allowed any users to access data , \neven when this should have been denied as a result of that user’s permissions. \n \nFigure 3 – Current user had no access to job details by default \n \nFigure 4 – Bypassing restriction using the available third party URL \nRecommendation: \nApply the workaround in the References or consider using a different  authorisation and authentication plugin \n(after testing has provided a suitable level of assurance). \nAffects: \nDNS Name \nproject-app-jenkins.staging.clientuk \nReferences: \nGitHub OAuth Plugin Bug \nhttps://issues.jenkins-ci.org/browse/JENKINS-54031\nVersion 1.0 - Page 19 of 44 Client Confidential \n \n \n",
  "SR-128-2-3": "SR-128-2-3 Outdated Jenkins Software   \nRisk Rating Medium  \nOutdated Jenkins Software \nDescription: \nThe installed version of Jenkins Server was outdated and affected by a number of security vulnerabilities. The \nobserved version of the Jenkins was 2. 231 while the latest version (at the time of writing) is 2. 259. Known \nsoftware vulnerabilities which were unpatched in the observed  version included CSRF and XSS weaknesses. \nKnown issues also included missing permissions checks and the potential disclosure of S MTP passwords. \nThese vulnerabilities could allow an attacker to steal the session of an administrator, gain access to sensitive \ninformation or create files and potentially execute code on the host system. This issue has been rated as a \nmedium risk to reflect these issues and their assigned CVSS scores. \nRecommendation: \nUpdate the version of the affected Jenkins server to the latest stable and secure version available. Perform any \ntesting necessary to ensure that this does not break or conflict with required functionality. \nReview the current policy for upgrading Jenkins servers and create a plan that ensures Jenkins can be \nmaintained at the latest stable version, while still ensuring adequate testing so as to minimise disruption. \nAffects: \nDNS Name \nproject-app-jenkins.staging.clientuk \nReferences: \nJenkins Security Advisory 2020-08-12 \nhttps://www.jenkins.io/security/advisory/2020-08-12/ \nJenkins Website: ChangeLog \nhttps://jenkins.io/changelog/ \nhttps://jenkins.io/changelog-stable/\nVersion 1.0 - Page 20 of 44 Client Confidential \n \n \n",
  "SR-128-2-4": "SR-128-2-4 CSRF Protection Disabled   \nRisk Rating Medium  \nCSRF Protection Disabled   \nDescription: \nThe built-in Jenkins CSRF token had not been enabled. This increases the risk of a successful CSRF attack \nwhich could allow an attacker to manipulate a user or an administrator into unwittingly performing actions within \nthe application (such as changing the account password, adding accounts to the system and changing settings) \non behalf of the attacker. \n \nFigure 5 – CRSF protection option not enabled \nFor a CSRF attack to succeed, the victim must click a malicious link or visit a malicious web page while logged \nin to the vulnerable application. This would cause the victim's browser to issue GET or POST requests to the \nvulnerable site by means of hidden images or embedded JavaScript code. As far as the application is \nconcerned, these forged requests would appear to be the result of genuine actions performed by real users \nclicking on elements within the application. This is because the application did not sufficiently validate requests \n(such as by means of random tokens) to allow it to make this distinction. \nRecommendation: \nEnable the CSRF token protection in Jenkins. \nOne time tokens are t he primary defence against CSRF . Tokens are validated  server-side to ensure that \nrequests can only be executed once. The token which is received must match the server -side information.  \nAffects: \nDNS Name \nproject-app-jenkins.staging.clientuk \nReferences: \nJenkins CSRF Protection \nhttps://wiki.jenkins.io/display/JENKINS/CSRF+Protection \nRemote Access API \nhttps://wiki.jenkins.io/display/JENKINS/Remote+access+API \nJenkins CSRF Protection Explained \nhttps://support.cloudbees.com/hc/en-us/articles/219257077-CSRF-Protection-Explained\nVersion 1.0 - Page 21 of 44 Client Confidential \n \n \n",
  "SR-128-2-5": "SR-128-2-5 Clear Text Credentials   \nRisk Rating Low  \nClear Text Credentials \nDescription: \nJenkins uses the workspace directory to build projects, to store the checkout source code and to store the files \ngenerated by the build itself. However, some files in the workspace directory w ere not automatically deleted . \nSome of these remaining files included credentials in clear text format, and had world readable permissions. \n \nFigure 6 – Example file containing API key in the workspace directory \n \nFigure 7 – Some files had world readable permissions in the workspace directory \nThis could allow an attacker with SSH or script console access to recover credentials to different systems.  \nRecommendation: \nUse the Workspace Cleanup plugin to remove files that contained credentials such as Docker configuration file s \nor shell scripts. \nAffects: \nDNS Name \nproject-app-jenkins.staging.clientuk\nVersion 1.0 - Page 22 of 44 Client Confidential \n \n \nReferences: \nWorkspace Cleanup Plugin \nhttps://wiki.jenkins.io/display/JENKINS/Workspace+Cleanup+Plugin \nHow to use Workspace Cleanup Plugin \nhttps://blog.clairvoyantsoft.com/jenkins-cleanup-workspace-reduce-disk-usage-18310097d3ef\nVersion 1.0 - Page 23 of 44 Client Confidential \n \n \n2.1.3 Phase 3 – AWS Configuration Review \n",
  "SR-128-3-1": "SR-128-3-1 Root Account Used Recently   \nRisk Rating Medium  \nRoot Account Used Recently \nDescription: \nIt was confirmed that the “root” account had been used recently as part of the security checks of the Amazon \nconsole. Amazon security best practice recommends that this account should only be used when strictly \nnecessary. Other accounts with more suitably restricted permissions should be used for daily administrative \nduties. \nThe following screenshot demonstrates that the root account was used recently on t he 2020-08-12: \n \nFigure 8 – Root account usage \nThe use of the root account was discussed with Client staff, who revealed that the use of the root account is \npart of a corporate account, and project staff had no direct control over the account. \nRecommendation: \nThe use of the root account should be minimised. Other accounts should be created following the principle of \nleast privilege and used for management. This will reduce the risk of accidental changes and unintended \ndisclosure of highly privileged credentials. \nThis would also better align the AWS account with Amazon recommended security best practice.  \nAffects: \nAWS Account \n123456789012:root \nReferences: \nAWS Identity and Access Management (IAM) \nhttps://aws.amazon.com/iam/ \nAWS Identity and Access Management Documentation \nhttps://aws.amazon.com/documentation/iam/ \nAWS Documentation – IAM Best Practices \nhttp://docs.aws.amazon.com/IAM/latest/UserGuide/IAMBestPractices.html \nCIS Amazon Web Services Foundations \nhttps://d0.awsstatic.com/whitepapers/compliance/AWS_CIS_Foundations_Benchmark.pdf\nVersion 1.0 - Page 24 of 44 Client Confidential \n \n \n",
  "SR-128-3-2": "SR-128-3-2 IAM Password Policy   \nRisk Rating Medium  \nIAM Password Policy \nDescription: \nWeaknesses were noted in the password policy enabled in the IAM settings. This could result in the creation of \nweak user passwords , more easily susceptible to recovery by an attacker . Furthermore, these settings could \nallow a weak password to be used for an extended period of time. \nThe following screenshot illustrates the password policy settings that were observed. Note that the check boxes \nfor the options Prevent password reuse, Require at least one non-alphanumeric character \nand Enable password expiration were not selected: \n \nFigure 9 – Password policy not enforced \nThe Prevent password reuse option will not allow a user to reuse a previous password value when setting \na new password (which otherwise might allow continued use of the same password). The number of previous \npasswords which are not allowed can be set between 1 and 24. \nPasswords can be set to expire after a period between 1 and 1095 days. It is worth noting that some more \nrecent password guidance suggests not setting passwords to expire, but that this advice is given in the \nexpectation that all passwords are of suitably strong and that other controls (such as MFA) are used where \nappropriate. \nRecommendation: \nEnsure a strong password policy is in place. Specifically, ensure that the following password policy is enforced: \n◆ Passwords should include at least one symbol \n◆ Passwords cannot be reused  \n◆ Passwords should be reused \n◆ Passwords should use mixed case \n◆ Passwords should include at least one number \n◆ Passwords require minimum length of 14 characters\nVersion 1.0 - Page 25 of 44 Client Confidential \n \n \nAffects: \nAWS Account \n123456789012 \nReferences: \nAWS Identity and Access Management (IAM) \nhttps://aws.amazon.com/iam/ \nAWS Identity and Access Management Documentation \nhttps://aws.amazon.com/documentation/iam/ \nAWS Documentation – Managing Passwords \nhttp://docs.aws.amazon.com/IAM/latest/UserGuide/Credentials-ManagingPasswords.html\nVersion 1.0 - Page 26 of 44 Client Confidential \n \n \n",
  "SR-128-3-3": "SR-128-3-3 EBS Volumes Without Encryption   \nRisk Rating Medium  \nEBS Volumes Without Encryption \nDescription: \nElastic Block Store (EBS) based full disk encryption (FDE) was not enabled on the EBS volumes. Due to the \nnature of a cloud -hosted environment, hosted data stored on virtual drives can be re -assigned to other hosts, \noften beyond the account that owns it. I f an administrator removes a virtual drive from a hosted machine, this \ndata can be re-assigned elsewhere and in some circumstances recovered. \nAmazon have stated that drives are wiped after deletion; however, FDE ensures that if a virtual drive is removed \nand re-assigned to a different host controlled by another AWS account then this data would be very difficult, if \nnot impossible, to recover. \nThe following figure highlights the volumes that did not have encryption enabled:  \n \nFigure 10 – EBS volumes lacking encryption \n114 volumes were flagged and are detailed in Supplemental Data, Section 3.3. \nRecommendation: \nEncrypt all hosted machine virtual drives that host intellectual property or sensitive data.  \nFurthermore, OS based encryption (such as LUKS or BitLocker) ca n be leveraged in order to mitigate the risk \nfrom this issue. \nAffects: \nSee Supplemental Data, Section 3.3. \n \nReferences: \nAmazon EC2  \nhttps://aws.amazon.com/ec2/  \nAmazon Elastic Compute Cloud Documentation  \nhttps://aws.amazon.com/documentation/ec2/  \nAWS Security Whitepaper – Elastic Block Storage Security (page 24) \nhttps://d0.awsstatic.com/whitepapers/aws-security-whitepaper.pdf \nAWS Documentation – Amazon Elastic Block Store (Amazon EBS) \nhttps://docs.aws.amazon.com/AWSEC2/latest/UserGuide/AmazonEBS.html\nVersion 1.0 - Page 27 of 44 Client Confidential \n \n \nSR-128-3-4 Automated Backups Not Enabled for RDS Instances   \nRisk Rating Medium  \nAutomated Backups Not Enabled for RDS Instances \nAutomated backups had not been enabled for a number of Relational Database Service (RDS) instances. This \nfeature facilitates the creation of periodic RDS instance snapshots, which in turn ensure that data restoration is \npossible in the event of an incident affecting the source database. \nThe following screenshot from the AWS Trusted Advisor shows that the main-components-db-stage and \nregion-components-db-stage RDS instances had automated backups disabled: \n \nFigure 11 – RDS Instances with automated backups disabled \nRecommendation: \nEnsure that all RDS database instances that host sensitive data have automated backups enabled for point -in-\ntime recovery.  \nAffects: \nRDS Instance \nmain-components-db-stage \nregion-components-db-stage \nReferences: \nAmazon Relational Database Service (RDS) \nhttps://aws.amazon.com/rds/ \nAmazon Relational Database Service Documentation \nhttps://aws.amazon.com/documentation/rds/ \nAWS Documentation – Backing Up and Restoring Amazon RDS DB Instances \nhttps://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/CHAP_CommonTasks.BackupRestore.html\nVersion 1.0 - Page 28 of 44 Client Confidential \n \n \n",
  "SR-128-3-5": "SR-128-3-5 S3 Bucket Configuration Allowing Clear Text Communications   \nRisk Rating Medium  \nS3 Bucket Configuration Allowing Clear Text Communications \nDescription: \nThe observed configuration for several S3 buckets did not enforce the use of SSL/TLS connections, or prevent \nclients from connecting over clear text protocols. Communication between clients and S3 buckets could use \nunencrypted HTTP as well as HTTPS as the use of HTTPS was not enforced. As a result, sensitive information \ncould be transmitted in clear text over the network. \nThe following buckets were found not to enforce the use of encrypted communication:  \n◆ project-jenkins-stage \n◆ project-xa-jenkins-stage \n◆ project-xb-jenkins-stage \nThe following screenshot shows the policy for one of the buckets listed above: \n \nFigure 12 – Policy allowing clear text communications \nThis configuration presents an opportunity for an intercepting party to capture sensitive data. In general, any \ndata that is in any way sensitive should only be communicated over HTTPS.  \nRecommendation: \nThe use of clear text protocols should be prevented by enforcing TLS as a transport method.  \nAdding the following statement to  a bucket configuration will ensure objects can only be accessed over TLS \nconnections. \n{ \n    \"Statement\":[ \n        { \n            \"Action\": \"s3:*\", \n            \"Effect\":\"Deny\", \n            \"Principal\": \"*\", \n            \"Resource\":[\"arn:aws:s3:::<bucketname>\", \n                        \"arn:aws:s3:::<bucketname>/*\"], \n            \"Condition\":{ \n                \"Bool\": \n                { \"aws:SecureTransport\": false } \n            } \n        } \n    ] \n} \nAffects: \nS3 Buckets \nproject-jenkins-stage \nproject-xa-jenkins-stage \nproject-xb-jenkins-stage\nVersion 1.0 - Page 29 of 44 Client Confidential \n \n \nReferences: \nAmazon S3 \nhttps://aws.amazon.com/s3/ \nAmazon Simple Storage Service Documentation \nhttps://aws.amazon.com/documentation/s3/ \nAWS Documentation – AWS Global and IAM Condition Context Keys \nhttps://docs.aws.amazon.com/IAM/latest/UserGuide/reference_policies_condition-keys.html \nAWS Documentation – IAM JSON Policy Elements: Condition Operators \nhttps://docs.aws.amazon.com/IAM/latest/UserGuide/reference_policies_elements_condition_operators.html \nAWS Documentation – IAM Policy Elements: Variables \nhttps://docs.aws.amazon.com/IAM/latest/UserGuide/reference_policies_variables.html\nVersion 1.0 - Page 30 of 44 Client Confidential \n \n \n",
  "SR-128-3-6": "SR-128-3-6 S3 Bucket Without Default Encryption    \nRisk Rating Medium  \nS3 Bucket Without Default Encryption  \nDescription: \nAnalysis of the S3 configuration indicated that a number of buckets did not have default encryption enabled. S3 \ndefault encryption provides a way to set the default encryption behaviour for an S3 bucket. W hen enabled, all \nobjects will be encrypted when they are stored in the bucket. This will be done automatically, without having to \nconstruct a bucket policy that rejects objects that are not encrypted. \nThe following buckets were found not to have default encryption enabled: \n◆ project-jenkins-stage \n◆ project-xa-jenkins-stage \n◆ project-xc-jenkins-stage \n◆ project-y99-jenkins-stage \n◆ project-za-jenkins-stage \n◆ project-xab-jenkins-stage \n◆ project-zd-jenkins-stage \nThe following screenshot shows an S3 bucket with default encryption not enabled:  \n \nFigure 13 – Bucket without default encryption enabled \nIt was noted that default encryption was enabled on other S3 buckets configured on the system.  \nRecommendation: \nEnable default encryption on all S3 buckets.  \nAffects: \nS3 Buckets \nproject-jenkins-stage \nproject-xa-jenkins-stage \nproject-xc-jenkins-stage \nproject-y99-jenkins-stage \nproject-za-jenkins-stage \nproject-xab-jenkins-stage \nproject-zd-jenkins-stage \nReferences: \nAmazon S3 \nhttps://aws.amazon.com/s3/ \nAmazon Simple Storage Service Documentation \nhttps://aws.amazon.com/documentation/s3/ \nAWS Documentation – Using Encryption \nhttps://docs.aws.amazon.com/AmazonS3/latest/dev/UsingEncryption.html \nAWS Documentation – How Do I Create an S3 Bucket? \nhttps://docs.aws.amazon.com/AmazonS3/latest/user-guide/create-bucket.html\nVersion 1.0 - Page 31 of 44 Client Confidential \n \n \nAWS Documentation – Amazon S3 Default Encryption for S3 Buckets \nhttps://docs.aws.amazon.com/AmazonS3/latest/dev/bucket-encryption.html \nAWS News Blog - New Amazon S3 Encryption & Security Features \nhttps://aws.amazon.com/blogs/aws/new-amazon-s3-encryption-security-features/\nVersion 1.0 - Page 32 of 44 Client Confidential \n \n \n",
  "SR-128-3-7": "SR-128-3-7 Policy Allows “AssumeRole” Action For Any Resource   \nRisk Rating Medium  \nPolicy Allows “AssumeRole” Action For Any Resource \nDescription: \nOne of the IAM Inline security policies reviewed during the assessment included the AssumeRole action, \nwithout limiting it to a specific resource. The Security Token Service (STS) is a service that enables requesting \ntemporary, limited-privilege credentials for users. The AssumeRole action implemented by the STS returns a \nset of temporary credentials that can be used to access AWS resources. A user, group or role with access to \nthis action through the identified policies would be allowed to assume any role in any account that trusts the \nuser's account. This is contrary to the principle of least privilege, as suggested by AWS security best practice.  \nThe following security policy was affected by this issue: \n◆ arn:aws:iam::123456789012:policy/jenkins-policy \nThe following statement was included in this policy: \n{ \n  \"Action\": [ \n    \"sts:AssumeRole\" \n  ], \n  \"Effect\": \"Allow\", \n  \"Resource\": [ \n    \"*\" \n  ] \n} \nIf Resource is set to * as in the case above, then the user receiving this policy can assume any role in any \naccount that trusts the user's AWS account ( that is,  the role's trust policy specifies the user's account as \nPrincipal).  \nRecommendation: \nThe policies affected by this issue should be reviewed. \nOne potential mitigation is to specify the complete ARN of the role that the user should be allowed to assume. \nFor example, the following policy sets this restriction: \n{ \n  \"Version\": \"2012-10-17\", \n  \"Statement\": { \n    \"Effect\": \"Allow\", \n    \"Action\": \"sts:AssumeRole\", \n    \"Resource\": \"arn:aws:iam::<account-id>:role/[role to be assumed]\" \n  } \n}  \nThis helps prevent the user from assuming roles that have more permissions than the user has been granted - \nthat is, from being able to obtain elevated privileges. \nAffects: \nIAM Policy \njenkins-policy \nReferences: \nAWS Identity and Access Management (IAM) \nhttps://aws.amazon.com/iam/\nVersion 1.0 - Page 33 of 44 Client Confidential \n \n \nAWS Identity and Access Management Documentation \nhttps://aws.amazon.com/documentation/iam/ \nAWS Documentation – Granting a User Permissions to Switch Roles \nhttp://docs.aws.amazon.com/IAM/latest/UserGuide/id_roles_use_permissions-to-switch.html \nAWS Documentation – AssumeRole \nhttps://docs.aws.amazon.com/STS/latest/APIReference/API_AssumeRole.html\nVersion 1.0 - Page 34 of 44 Client Confidential \n \n \n",
  "SR-128-3-8": "SR-128-3-8 Policy Allows “PassRole” Action For Any Resource   \nRisk Rating Medium  \nPolicy Allows “PassRole” Action For Any Resource \nDescription: \nA number of the IAM Managed  and Inline security policies reviewed during the assessment included the \n“PassRole” action, without lim iting it to a specific resource. To pass a role (and its permissions) to an AWS \nservice, a user must have permissions to pass the role to the service. This helps administrators ensure that only \napproved users can configure a service with a role that grants  permissions. Creating a policy that includes the \n“PassRole” permission without restrictions could enable the entity to which this policy is attached to access \nresources to which it has not been granted explicit access. This is contrary to the principle of  least privilege, as \nsuggested by AWS security best practice. \nThe following security policies were affected by this issue: \n◆ arn:aws:iam::123456789012:role/jenkins-role \n◆ arn:aws:iam::123456789012:role/jenkins-role1 \nThe following “PassRole” permission was configured for the jenkins-role policy: \n{ \n  \"Action\": [ \n    \"iam:AddRoleToInstanceProfile\", \n    \"iam:AttachRolePolicy\", \n    \"iam:CreateInstanceProfile\", \n    \"iam:CreatePolicy\", \n    \"iam:CreateRole\", \n    \"iam:DeletePolicy\", \n    \"iam:DeleteRole\", \n    \"iam:DetachRolePolicy\", \n    \"iam:GetPolicy\", \n    \"iam:GetRole\", \n    \"iam:ListAttachedRolePolicies\", \n    \"iam:ListPolicies\", \n    \"iam:ListRoles\", \n    \"iam:PassRole\", \n    \"iam:PutRolePolicy\", \n    \"iam:UpdateAssumeRolePolicy\" \n  ], \n  \"Effect\": \"Allow\", \n  \"Resource\": [ \n    \"*\" \n  ] \n} , \nIf Resource is set to \"*\" as in the case above, then the user can pass any role. \nFor example, imagine that a user has permissions only to launch EC2 instances, but the roles that the user can \npass to an EC2 instance have permissions to work with IAM and Amazon S3. In this case, the user might be \nable to launch the instance, log into it, get temporary security credentials and then perform IAM or S3 actions \nfor which that the user is not authorised. \nRecommendation: \nThe policies affected by this issue should be reviewed. \nOne potential mitigation is to specify the complete ARN of the role that the user should be allowed to pass. For \nexample, the following policy sets this restriction:\nVersion 1.0 - Page 35 of 44 Client Confidential \n \n \n{ \n    \"Version\": \"2012-10-17\", \n    \"Statement\": [{ \n        \"Effect\": \"Allow\", \n        \"Action\": [ \n            \"iam:GetRole\", \n            \"iam:PassRole\" \n        ], \n        \"Resource\": \"arn:aws:iam::<account-id>:role/<role-name>\" \n    }] \n} \nThis helps prevent the user from running applications that have more permissions than the user has been \ngranted - that is, from being able to obtain elevated privileges. \nAffects: \nIAM Policy \njenkins-role \njenkins-role1 \nservicerolepolicy \nautoscalingclusterpolicy \nReferences: \nAWS Identity and Access Management (IAM) \nhttps://aws.amazon.com/iam/ \nAWS Identity and Access Management Documentation \nhttps://aws.amazon.com/documentation/iam/ \nAWS Documentation – Granting a User Permissions to Pass a Role to an AWS Service \nhttps://docs.aws.amazon.com/IAM/latest/UserGuide/id_roles_use_passrole.html \nAWS Documentation – Pass Role Permissions \nhttps://docs.aws.amazon.com/iot/latest/developerguide/pass-role.html \nAWS Documentation – Using an IAM Role to Grant Permissions to Applications Running on Amazon \nEC2 Instances \nhttps://docs.aws.amazon.com/IAM/latest/UserGuide/id_roles_use_switch-role-ec2.html \nAWS Security Blog – Granting Permission to Launch EC2 Instances with IAM Rol es (PassRole \nPermission)  \nhttps://aws.amazon.com/blogs/security/granting-permission-to-launch-ec2-instances-with-iam-roles-passrole-permission\nVersion 1.0 - Page 36 of 44 Client Confidential \n \n \n",
  "SR-128-3-9": "SR-128-3-9 Default Security Group Hardening Not Implemented   \nRisk Rating Medium  \nDefault Security Group Hardening Not Implemented \nDescription: \nA number of security groups were identified to be using the default rules, allowing all inbound traffic from \ninstances assigned to the same security group, as well as all outbound traffic. The default security group is \nassigned to new instances created within a VPC if no custom security groups are assigned to it during \nconfiguration. These rules may be overly permissive, for instance allowing an attacker who has compromised \none instance with the default security group assigned to use horizontal privilege escalation to compromise all \nother instances configured with the default security group. \nAs can be seen in the following screenshot from an NCC Group internal tool used during the assessment, the \ndefault security group had permissive rules defined: \n \nFigure 14 – Rules present in default security group \nThe following VPCs were found to have default security groups configured with the default rules:  \n◆ region 1: \n VPC 1 \n VPC 5 \n◆ region 2: \n VPC a \n VPC b \nIt is good security practice to harden the default security group by removing all rules. Any new instance created \nwithin a VPC will then be unable to communicate with other instances until custom security groups (conforming to security best practice) have been assigned.  \nRecommendation: \nIn order to improve system hardening, remove all rules from the default security group so that it restricts all traffic. Should an instance be created without custom security groups, it will inherit the default security group and be unable to communicate with other instances within the VPC until the required custom security groups \nare assigned. \nEach VPC should be configured with custom security groups that conform to the practice of ‘least privilege’. \nThese custom security groups should be assigned on a case-by-case basis to the instances that require them, \nallowing communication within instances and to the wider Internet under tightly controlled conditions.\nVersion 1.0 - Page 37 of 44 Client Confidential \n \n \nAffects: \nIP Address \nVPC 1 \nVPC 5 \nVPC a \nVPC b \nReferences: \nAmazon Virtual Private Cloud \nhttps://aws.amazon.com/vpc/ \nAmazon Virtual Private Cloud Documentation \nhttps://aws.amazon.com/documentation/vpc/ \nAWS Documentation – Security Groups for Your VPC \nhttps://docs.aws.amazon.com/AmazonVPC/latest/UserGuide/VPC_SecurityGroups.html \nCIS Amazon Web Services Foundations \nhttps://d0.awsstatic.com/whitepapers/compliance/AWS_CIS_Foundations_Benchmark.pdf\nVersion 1.0 - Page 38 of 44 Client Confidential \n \n \n",
  "SR-128-3-10": "SR-128-3-10 Single Availability Zone RDS Instance   \nRisk Rating Low  \nSingle Availability Zone RDS Instance \nDescription: \nOne Relational Database Service (RDS) instance was configured without the Multi Availability Zone option \nenabled. Without this, should an availability zone specific database failure occur, then Amazon RDS cannot \nautomatically fail over to the standby availability zone so that database operations can resume quickly without \nadministrative intervention. \nThe following database instance was configured with Multi-AZ disabled: \n◆ components-db-stage \nThe following screenshot shows that Multi-AZ was disabled for the instance listed above: \n \nFigure 15 – RDS Availability Zones \nRecommendation: \nConsideration should be given to modifying the configuration of the database instance to enable Multi-AZ. This \nis especially important if the applications using the database require high availability.  \nAffects: \nRDS Instance \ncomponents-db-stage \nReferences: \nAmazon Relational Database Service (RDS) \nhttps://aws.amazon.com/rds/ \nAmazon Relational Database Service Documentation \nhttps://aws.amazon.com/documentation/rds/ \nAWS Documentation – High Availability (Multi-AZ) \nhttps://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/Concepts.MultiAZ.html\nVersion 1.0 - Page 39 of 44 Client Confidential \n \n \n2.1.4 Phase 4 – Kubernetes Configuration \n",
  "SR-128-4-1": "SR-128-4-1 Kubernetes Pod Security Policy Overly Permissive   \nRisk Rating Medium  \nKubernetes Pod Security Policy Overly Permissive \nDescription: \nThe cluster did make use of the Kubernetes Pod Security Policy feature , but was configured to allow any user \nto create privileged containers. As a result, any user with the ability to create new pods on the cluster would be \nable to gain privileged access to the underlying cluster nodes and any secrets contained within them. \nKubernetes provides this feature to restrict the privileges which can be granted by users to newly created pods.  \nThis can be used to prevent mounting of host file systems and other rights, which could allow unauthorised \naccess to the underlying operating system running on the cluster nodes. The policies configured within the \nproject-staging cluster did not force pods to run as non-root users, and allowed privileged containers to be \ncreated and run. \nThe output below provides evidence of the affected configuration option:  \n<REDACTED> \nRecommendation: \nEnsure that a Pod Security Policy is defined for all namespaces in the cluster. This policy should provide minimal \nrights restricting the ability of pods to gain escalated privileges within the cluster.  \nAffects: \nCluster Name \nproject-staging \nReferences: \nCIS Kubernetes Benchmark – Check 1.1.24  \nhttps://www.cisecurity.org/benchmark/Kubernetes/ \nKubernetes Pod Security Policies \nhttps://kubernetes.io/docs/concepts/policy/pod-security-policy/ \nEffective implantation of Pod Security Policies \nhttps://octetz.com/posts/setting-up-psps\nVersion 1.0 - Page 40 of 44 Client Confidential \n \n \n",
  "SR-128-4-2": "SR-128-4-2 Kubernetes Unrestricted Cluster Network   \nRisk Rating Medium  \nKubernetes Unrestricted Cluster Network \nDescription: \nThere were no egress restrictions on traffic from pods in the cluster network. As a result, a compromised \ncontainer would be able to attack Kubernetes’ management interfaces.  \nBy default, Kubernetes clusters provide an unrestricted flat network for all pods running on them.  This can be \nrestricted in recent versions by using Kubernetes Net work Policies. These policies can be defined to restrict \ninbound and outbound access from the pods running on the cluster. \nAs this feature was not in place it was possible to contact services running in the cluster and the management \nservices running on the nodes. \nRecommendation: \nEnsure that Kubernetes Network Policies are in place for all services running on the cluster. These policies \nshould be constructed on a ‘least privilege’ basis to allow only required traffic. \nAffects: \nCluster Name \nproject-staging \nReferences: \nCIS Kubernetes Benchmark Check 1.6.2  \nhttps://www.cisecurity.org/benchmark/Kubernetes/ \nKubernetes Network Policy \nhttps://kubernetes.io/docs/concepts/services-networking/network-policies/\nVersion 1.0 - Page 41 of 44 Client Confidential \n \n \n",
  "SR-128-4-3": "SR-128-4-3 Outdated Kubernetes in Use   \nRisk Rating Medium  \nOutdated Kubernetes in Use \nDescription: \nThe Kubernetes service was found to be out of date, leaving the clusters and their respective containers \npotentially open to both security and functional issues that have been patched in later versions. \nDue to its very fast development rate, vulnerabilities that are found in Kubernetes often apply to numerous \nversions; however, patches are usually released soon after to remediate any current issues. Issues disclosed \nin previous versions have included privilege escalation and information disclosure issues, some of which could \npotentially allow a malicious user to take full control of a cluster.  \nAlthough no significant vulnerabilities were found in the observed versions of Kubernetes, it is strongly \nrecommended that all clusters are kept up to date, in line with security best practice.  \nThe code snippet below shows the current version of the Kubernetes clusters under review:  \nServer Version: version.Info{Major:\"1\", Minor:\"16\", GitVersion:\"v1.16.2\",  \nGitCommit:\" xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx\", GitTreeState:\"clean\", \nBuildDate:\"2019-10-20T09:56:31Z\", Compiler:\"gc\", Platform:\"linux/amd64\"} \n \nRecommendation: \nReview the current patching policy for Kubernetes and ensure that all clusters are updated to the latest stable \nversion regularly. It should also be noted that the current support life cycle length for versions of Kubernetes is \nnine months. \nAffects: \nCluster \nproject-staging\nVersion 1.0 - Page 42 of 44 Client Confidential \n \n \n"
}