{
  "SR-104-001": "SR-104-001 Device Software Vulnerabilities\nRisk Rating High Status Open\nDescription:\nThe firewall was running an outdated version of the FortiOS operating system software. This was identified as version 6.2.3, released in December 2019. At the time of writing, the latest stable and supported version in this branch was 6.2.8, released in April 2021. The installed version of the software contained an authentication flaw which could allow someone in possession of a valid set of user credentials to bypass the requirement for a second factor of authentication. In addition, there was an information disclosure vulnerability which could allow a remote attacker to recover information about the platform including version and model information. This issue was originally addressed in version 6.2.1 but was re-introduced in version 6.2.3. The software version from the device configuration was checked against the FortiOS release notes; this showed that it contained the vulnerabilities below:\n CVE Reference CVSSv2 Fixed in Version\n CVE-2018-13367 5.0 6.2.4, 6.4.0\n CVE-2020-12812 9.8 6.2.4, 6.4.0\n It is extremely important that software is regularly maintained with patches and upgrades in order to help mitigate the risk of an attacker exploiting a known software vulnerability. In addition to security features and fixes, software\nupdates will often include additional functionality, performance improvements and features.\nRecommendation:\nThe latest system software upgrades, updates or patches should be applied within a short time following their release by the vendor. Additionally, it is suggested that the current patching policy should be reviewed to ensure that future updates are applied in a timely manner.1\nIn addition the length of time this software has remained outdated suggests that this software is outside the software patching process. The reason for this should be identified and addressed.\nAffects:\nDevice Installed Latest\nFORTIFW01 6.2.3 6.2.8, 6.4.5\n1FortiOS Release Noteshttps://docs.fortinet.com/document/fortigate/6.2.8/fortios-release-notes/760203/introduction-and-supported-models\nVersion 3.0- Page 9 of 32 Client Confidential\n",
  "SR-104-002": "SR-104-002 Widely Scoped Access Controls\nRisk Rating Medium Status Open\nDescription:\nRules were observed that could be considered overly permissive and allow potentially inappropriate traffic flows.\nA weak configuration could contribute to a malicious user or an attacker gaining unauthorised access to network services. The primary purpose of a firewall is to be a security barrier, preventing unauthorised access to devices and services by filtering the network traffic. The network filtering can be configured to allow or deny access from specific network addresses to specific network addresses and specific services. Best practice dictates that access to services should only be configured for those hosts that require it and that this should be restricted on a need-only basis to the required services. The potential risk from this issue is that an attacker could leverage these widely scoped rules to communicate with hosts or network subnets which they should not be able to. In the event of a compromise of any server it is important that the firewall restricts the accessibility an attacker has. Full details of rules considered overly permissive are detailed inSupplemental Data - Test / Temporary Rules on page 29.\nRecommendation:\nIn general, network filtering rules should be as restrictive as possible while still maintaining business functionality.\nRules should be configured to restrict access to network addresses and services from only those hosts that require it.\nDevices provided for a specific service should allow access only to that service and should not use the ‘Any’ keyword.\nRules should be modified where feasible, to restrict the traffic to specific hosts and services as required. The following best practice guidelines should be followed:\nu rules do not allow access from any source\nu rules do not allow access to any port from a source network address\nu rules do not allow access to any destination\nu rules do not allow access to any port on a destination network address\nu rules do not allow access to any destination service\nu rules do not allow access to a range of destination services\nHowever, it is worth noting that it may not be possible to achieve this in all circumstances, such as with a public web\nserver where business requirements imply that any network address should be permitted to access the service.\nAffects:\nDevice\nFORTIFW01\nVersion 3.0- Page 10 of 32 Client Confidential\n",
  "SR-104-003": "SR-104-003 Rule Permits a Legacy Clear Text Protocol\nRisk Rating Medium Status Open\nDescription:\nA single firewall rule permitted access via the legacy clear text protocol, Telnet. Information that travels along a Telnet\nconnection is not encrypted, as such data including credentials are susceptible to interception.\nDue to the lack of encryption provided by the Telnet protocol, an attacker who is able to monitor a Telnet session would\nbe able to view all of the authentication credentials and data passed in the session. The attacker could then attempt\nto gain access to the device using the authentication credentials extracted from\nThe associated rule from the Production VDOM is presented below:\nRule Action Source Destination Service\n139 Allow PSZ_RDS_10.107.143.0/26 switch01.uk.acme.com_10.171.186.81\nswitch02.uk.acme.com_10.171.186.82\nTELNET\nFigure 1: SECUREZONE-LIVE-INF to ZONE1-LIVE\nRecommendation:\nWhere possible, the use of clear text protocols should be avoided. The network services associated with the identified\nrule should be decommissioned and replaced with cryptographically secure alternatives. Once completed, the ruleset\nshould be modified to reflect the changes.\nAffects:\nDevice\nFORTIFW01\nVersion 3.0- Page 11 of 32 Client Confidential\n",
  "SR-104-004": "SR-104-004 Test / Temporary Rules Present\nRisk Rating Low Status Open\nDescription:\nA large number of rules were configured with a name that indicated they were either temporary or used for testing\npurposes. Whilst these temporary/test rules present no direct threat to security, they should be reviewed as a matter\nof ‘good housekeeping’ to establish whether they are required. Any which are required should be made permanent.\nIt is understood that a significant proportion of these rules are present to provide connectivity during the migration,\nof servers and their associated services from the legacy network. Particular attention should be paid to the removal\nof these rules following completion of this work, as several rules provide access to privileged hosts and services.\nFull details of rules which appeared to be temporary or test related are detailed in theSupplemental Data - Test /\nTemporary Rules on page 29.\nRecommendation:\nThe rules should be reviewed and removed if no longer required.\nAffects:\nDevice\nFORTIFW01\nVersion 3.0- Page 12 of 32 Client Confidential\n",
  "SR-104-005": "SR-104-005 Rules Allow Any ICMP Message Type\nRisk Rating Low Status Open\nDescription:\nRules were configured that allowed any ICMP message type between network segments. ICMP can be used to identify\nconnected devices, and may be abused to exfiltrate data, where access controls ordinarily would restrict such action.\nICMP can be useful for network administrators who wish to determine if a network device is reachable or responding,\nbut it can also be abused by an attacker to enumerate potential targets and learn more about them.\nICMP can also be used to tunnel traffic out of a network using a tool such as ICMPSh. Using this tool it may be possible\nfor an attacker to exfiltrate data to an external host.\nRules which permitted all ICMP types are detailed below:\nRoot VDOM\nRule Action Source Destination Service\n17 Allow ZONE1_ADMINS_GROUP TSZ_RDS_MGT_10.106.214.0/27\nUSZ_RDS_MGT_10.106.74.0/27\nPSZ_RDS_MGT_10.106.183.0/26\nHTTPS\nRDP\nALL_ICMP\n36 Allow SolarWinds_10.193.145.80 UK_SITE1_FLBD01\nUK_SITE1_FLBD02\nUK_SITE1_FLBD_VIP\nALL_ICMP\nFigure 2: ZONE1-MGMT to SECUREZONE-MGMT-TOOL\nRule Action Source Destination Service\n129 Allow SolarWinds_10.193.145.80 MGMT_SZ_NET_ANY_10.106.193.64/26 SNMP\nALL_ICMP\nVersion 3.0- Page 13 of 32 Client Confidential\nFigure 3: ZONE1-MGMT to SECUREZONE-MGM\nRule Action Source Destination Service\n35 Allow UK_SITE1_FLBD_VIP\nUK_SITE1_FLBD01\nUK_SITE1_FLBD02\nSolarWinds_10.193.145.80 ALL_ICMP\nFigure 4: SECUREZONE-MGMT-TOOLS to ZONE1-MGM\nTest VDOM\nRule Action Source Destination Service\n54 Allow ZONE1154_ANY_10.116.194.0/24\nZONE1155_ANY_10.116.174.0/24\nADMIN1_10.145.37.205\nTSZ_CSV_BIZ_10.32.242.192/26 RDP\nALL_ICMP\nVersion 3.0- Page 14 of 32 Client Confidential\nFigure 5: ZONE1-TEST to SECUREZONE-TEST-IN\nRecommendation:\nRules should be configured to only allow ICMP messages between specific hosts or subnets, and in those instances\nspecific message types should be specified.2, 3\nAffects:\nDevice\nFORTIFW01\n2Common Exploits‒ICMP Shell Funhttps://www.commonexploits.com/?p=896\n3ICMP Tunnellinghttps://hackaday.com/2009/08/21/tunneling-ip-traffic-over-icmp/\nVersion 3.0- Page 15 of 32 Client Confidential\n",
  "SR-104-006": "SR-104-006 Proxy Address Resolution Protocol (ARP) was Enabled\nRisk Rating Low Status Open\nDescription:\nThe Proxy ARP feature, used to support ARP translation of IP addresses into MAC addresses across network segments\nand VLANs, was found to be supported. Permitting ARP packets to travel beyond the originating systems network\nsegment may undermine network segmentation.\nProxy ARP is a legacy setting designed for hosts that do not have a default gateway configured. There is usually no\ngood reason to have proxy ARP enabled in modern networks as it can allow attacks such as ARP spoofing.\nRecommendation:\nProxy ARP functionality should be disabled, unless there is a significant business need. This should be done for each\ninterface using the following command:\nset arpforward disable\nAffects:\nDevice\nFORTIFW01\nVersion 3.0- Page 16 of 32 Client Confidential\n",
  "SR-104-007": "SR-104-007 ICMP Redirect Messages Were Enabled\nRisk Rating Low Status Open\nDescription:\nInterfaces were configured to accept ICMP redirects. An attacker in a position to generate arbitrary ICMP packets may\nbe able to manipulate the routing table to launch a man-in-the-middle attack.\nICMP redirect messages could be sent to the router in order to indicate a specific route that the sending host would like\nthe network traffic to take. On a router that accepts ICMP redirect message the network traffic will be forwarded using\nthe specified route. Furthermore, some routers will cache the new routing information for use with future network\npackets.\nRecommendation:\nICMP redirect message sending can be disabled on network interfaces with the following command:\nset icmp-redirect disable\nAffects:\nDevice\nFORTIFW01\nVersion 3.0- Page 17 of 32 Client Confidential\n",
  "SR-104-008": "SR-104-008 Network Time Source Not Authenticated\nRisk Rating Low Status Open\nDescription:\nAlthough the firewall was configured to synchronise with a network time source, it did not utilise authentication. If an attacker was able to modify a device’s time with an inaccurate time update, then it would be more difficult during an examination to correlate the system logs. NTP (described in RFC 5905) is a complex time synchronisation protocol, with a number of different features and options such as time update authentication. Without authentication configured, an attacker could attempt to update the time by sending malicious time updates. An attacker could do this using open source code or by sending customised network packets, spoofing the source address. Furthermore, any systems that depend on accurate time, such as some authentication systems, could be disrupted and potentially cause a denial of service.\nRecommendation:\nAll networked devices should be synchronised by updating their clocks from an authenticated network time source,\nto preserve consistency between logs on different devices. FortiGate devices can be configured with the following commands:\nconfig system ntp\nset ntpsync {enable | disable}\nset source-ip <ipv4_addr>\nset syncinterval <interval_int>\nset type {fortiguard | custom}\nset server-mode {enable | disable}\nset interface <interface_list>\nconfig ntpserver\nedit <serverid_int>\nset authentication {enable | disable}\nset key <password_str>\nset key-id <int>\nset ntpv3 {enable | disable}\nset server {<ipv4_addr> | <hostname_str> | <ipv4_addr>/<hostname_str>}\nend\nend\nAffects:\nDevice\nFORTIFW01\nVersion 3.0- Page 18 of 32 Client Confidential\n",
  "SR-104-009": "SR-104-009 Unrestricted Administrative Interfaces\nRisk Rating Low Status Open\nDescription:\nAccess controls were not configured in order to restrict access to the firewalls management interfaces. As a result,\nan attacker would not be prevented from attempting to gain access to the device, or from exploiting any software\nvulnerabilities which were present. Without any management host restrictions in place, an attacker or malicious user would be able to connect to the\nadministrative services. If the service requires authentication and the attacker does not have any authentication\ncredentials, they could attempt to gain access using a brute-force attack.\nFurthermore, if a software vulnerability were present in the service then allowing anyone to connect to the service\ncould enable an attacker to exploit the vulnerability.\nRecommendation:\nAccess should be restricted to known management hosts. The following commands can be utilised to configure the\nfirewall via the CLI:\nconfig system admin\nedit admin\nset trusthost1 <ipv4_addr> <mask>\nend\nend\nAffects:\nDevice\nFORTIFW01\nVersion 3.0- Page 19 of 32 Client Confidential\n",
  "SR-104-010": "SR-104-010 No Pre-Logon Banner Message\nRisk Rating Low Status Open\nDescription:\nA login banner warning the user about any unauthorised access or referring to the Computer Misuse Act was not in\nuse. It is recommended that a pre-logon banner is used to inform users of their rights prior to accessing a device.\nFurthermore if legal proceedings were executed against an attacker it would be easier to prove intent on behalf of the\nattacker, if they were first warned against unauthorised access.\nRecommendation:\nA disclaimer should be configured, thereby ensuring users are aware of their legal and procedural responsibilities.\nGeneral guidelines suggest that warning messages include at least the name of the organisation that owns the system,\nthe fact that the system is subject to monitoring and that the use of the system implies consent to such monitoring.\nThe following command will enable the pre-login banner:\nconfig system global\nset pre-login-banner enable\nend\nWith the banner being configured as follows:\nconfig system replacemsg admin \"pre_admin-disclaimer-text\"\n<warning>\nend\nAffects:\nDevice\nFORTIFW01\nVersion 3.0- Page 20 of 32 Client Confidential\n",
  "SR-104-011": "SR-104-011 Local Based Authentication\nRisk Rating Low Status Open\nDescription:\nThe firewall was not configured to utilise a remote AAA solution such as Radius or TACACS+ for authentication, instead\npreferring the use of local users. Maintaining access and a secure password for a Group of administrators across a\nlarge number multiple network devices is not practical, administrators tend to compensate by using easy to remember\npasswords, or password reuse.\nRecommendation:\nAlthough it is recognised that the device is generally managed via FortiManager, it is consider best practice to utilise\nan authentication service for local access.\nConfigure the device to utilise RADIUS or TACACS+. The following commands can be used to add a TACACS+ server:\nconfig system admin tacacs\nedit <name>\nset authen-type <auth_prot_type>\nset authorization {enable | disable}\nset key <password_string>\nset port <integer>\nset secondary-key <password_string>\nset secondary-server <string>\nset server <string>\nset tertiary-key <password_string>\nset tertiary-server <string>\nend\nAffects:\nDevice\nFORTIFW01\nVersion 3.0- Page 21 of 32 Client Confidential\n",
  "SR-104-012": "SR-104-012 Duplicate / Overlapping Rules\nRisk Rating Low Status Open\nDescription:\nRules that duplicated or overlapped one another were identified. Although not a direct threat to security, these rules\ncould lead to confusion when administering the firewall. The clarity of a ruleset is important as confusion could lead\nto a configuration where access to services is overly permissive.\nThe following rules were identified:\nVDOM UAT\nRule Action Source Destination Service\n8 Allow UATUK_SITE1_FDCS01_10.83.193.80\nUATUK_SITE1_FDCS02_10.83.193.81\nUSZ_CSV_EXCH_10.83.193.128/26 AD_PORT_TCP/UDP\n9 Allow UATUK_SITE1_FDCS01_10.83.193.80\nUATUK_SITE1_FDCS02_10.83.193.81\nUSZ_CSV_EXCH_10.83.193.128/26 AD_PORT_TCP/UDP\nFigure 6: SECUREZONE-UAT-INF to SECUREZONE-UAT-IN\nRule Action Source Destination Service\n41 Allow USZ_RDS_MGT_10.106.74.0/27 UATUK_SITE1_FDCS01_10.83.193.80\nUATUK_SITE1_FDCS02_10.83.193.81\nAD_PORT_TCP/UDP\n21 Allow USZ_RDS_MGT_10.106.74.0/27 UATUK_SITE1_FDCS01_10.83.193.80\nUATUK_SITE1_FDCS02_10.83.193.81\nAD_PORT_TCP/UDP\nVersion 3.0- Page 22 of 32 Client Confidential\nFigure 7: UAT-MGT to SECUREZONE-UAT-IN\nRule Action Source Destination Service\n42 Allow UATUK_SITE1_FDCS01_10.83.193.80\nUATUK_SITE1_FDCS02_10.83.193.81\nUSZ_RDS_MGT_10.106.74.0/27 AD_PORT_TCP/UDP\n22 Allow UATUK_SITE1_FDCS01_10.83.193.80\nUATUK_SITE1_FDCS02_10.83.193.81\nUSZ_RDS_MGT_10.106.74.0/27 AD_PORT_TCP/UDP\nFigure 8: SECUREZONE-UAT-INF to UAT-MG\nIn addition, a number of rules within the Root VDOM were seen to utilise two service Groups which were nearly identical\nin their composure: AD_CLIENT_PORT_TCP/UDP & AD_PORT_TCP/UDP. The rules noted to be utilising these Groups\nwere numbers 40, 89, 111, 112, 41, 33, 35, 46, 48, 76.\nRecommendation:\nWhere possible, all rules should not duplicate or overlap others.\nVersion 3.0- Page 23 of 32 Client Confidential\nAffects:\nDevice\nFORTIFW01\nVersion 3.0- Page 24 of 32 Client Confidential\n",
  "SR-104-013": "SR-104-013 Disabled Rules Present\nRisk Rating Informational Status Open\nDescription:\nA number of inactive rules were identified. Although not a direct threat to security, disabled rules can make network\nadministration more difficult.\nThe ability to disable rules is useful for administrators who simply want to disable access to a service temporarily, for\ndiagnostic purposes or to disable a rule which is planned to be re-activated again in the immediate future.\nDespite this, disabled rules should not remain indefinitely and can make the policy configuration unclear to network\nadministrators. This could lead to rules being configured that duplicate disabled rules and could potentially lead to\nmistakes with the policy configuration.\nRules which were identified as being inactive are detailed below:\nRoot VDOM\nRule Action Source Destination Service\n190 Allow UK_CTR_RDS01_10.193.145.230 PSZ_RDS_MGT_10.106.183.0/26\nTSZ_RDS_MGT_10.106.214.0/27\nUSZ_RDS_MGT_10.106.74.0/27\nDCE-RPC\nTCP/UDP_RPC_49152-50151\nFigure 9: ZONE1-MGMT to SECUREZONE-MGMT-TOOL\nRule Action Source Destination Service\n189 Allow PSZ_RDS_MGT_10.106.183.0/26\nTSZ_RDS_MGT_10.106.214.0/27\nUSZ_RDS_MGT_10.106.74.0/27\nUK_CTR_RDS01_10.193.145.230 DCE-RPC\nTCP/UDP_RPC_49152-50151\nTCP_5985_WinRM\nVersion 3.0- Page 25 of 32 Client Confidential\nFigure 10: SECUREZONE-MGMT-TOOLS to ZONE1-MGM\nProduction VDOM\nRule Action Source Destination Service\n84 Allow PSZ_RDS_10.107.143.0/26 UK_SITE1_VL1_LINUXSVR_10.145.105.0/24\nUK_SITE1_VL1_OTHSVR_10.145.200.0/24\nHTTPS\nSMB\nSSH\nTCP_8080\nTCP_RMI_50500\nFigure 11: SECUREZONE-LIVE-INF to ZONE1-LIV\nRecommendation:\nDelete all disabled rules that are no longer required as a matter of ‘good housekeeping’.\nAffects:\nDevice\nFORTIFW01\nVersion 3.0- Page 26 of 32 Client Confidential\n",
  "SR-104-014": "SR-104-014 Rules without Comment Text or Annotation\nRisk Rating Informational Status Open\nDescription:\nThe majority of rules did not have a comment or annotation associated with them. Although not a threat to security,\nwithout comment text, the purpose of rules can be unclear making the administration of policies more difficult. This\ncan lead to a situation where rules that are no longer required remain configured, giving an attacker additional access.\nIt is common for rules to initially be configured to allow access to a limited number of services and hosts and gradually\ngrow over time as the business evolves and access to additional services or hosts are required. When access to a\nservice is no longer required that related rule should be modified or removed. Without adequate tracking or change\ncontrol, it may not be clear as to which rule applies to which service so the rule is not modified. In order to aid the\nclarity of rules, comment text can be included. This comment text is helpful in indicating why the rule exists.\nRecommendation:\nAll rules should include a comment indicating its purpose.\nAffects:\nDevice\nFORTIFW01\nVersion 3.0- Page 27 of 32 Client Confidential\n"
}