{
"finding_dict": {
"SR-104-001" : {
  "identifier": "SR-104-001",
  "title": "Device Software Vulnerabilities",
  "risk": "High",
  "status": "Open",
  "description": null,
  "recommendation": null,
  "affects": null
},
"SR-104-002" : {
  "identifier": "SR-104-002",
  "title": "Widely Scoped Access Controls",
  "risk": "Medium",
  "status": "Open",
  "description": "Rules were observed that could be considered overly permissive and allow potentially inappropriate traffic flows. A weak configuration could contribute to a malicious user or an attacker gaining unauthorised access to network services. The primary purpose of a firewall is to be a security barrier, preventing unauthorised access to devices and services by filtering the network traffic...",
  "recommendation": "In general, network filtering rules should be as restrictive as possible while still maintaining business functionality. Rules should be configured to restrict access to network addresses and services from only those hosts that require it.",
  "affects": "Device"
},
"SR-104-003" : {
  "identifier": "SR-104-003",
  "title": "Rule Permits a Legacy Clear Text Protocol",
  "risk": "Medium",
  "status": "Open",
  "description": "A single firewall rule permitted access via the legacy clear text protocol, Telnet. Information that travels along a Telnet connection is not encrypted, as such data including credentials are susceptible to interception. Due to the lack of encryption provided by the Telnet protocol, an attacker who is able to monitor a Telnet session would be able to view all of the authentication credentials and data passed in the session. The attacker could then attempt to gain access to the device using the authentication credentials extracted from",
  "recommendation": "Where possible, the use of clear text protocols should be avoided. The network services associated with the identified rule should be decommissioned and replaced with cryptographically secure alternatives. Once completed, the ruleset should be modified to reflect the changes.",
  "affects": "Device"
},
"SR-104-004" : {
  "identifier": "SR-104-004 Test / Temporary Rules Present",
  "title": "Test / Temporary Rules Present",
  "risk": "Low",
  "status": "Open",
  "description": "A large number of rules were configured with a name that indicated they were either temporary or used for testing purposes.  Whilst these temporary/test rules present no direct threat to security, they should be reviewed as a matter of good housekeeping to establish whether they are required. Any which are required should be made permanent. It is understood that a significant proportion of these rules are present to provide connectivity during the migration, of servers and their associated services from the legacy network. Particular attention should be paid to the removal of these rules following completion of this work, as several rules provide access to privileged hosts and services. Full details of rules which appeared to be temporary or test related are detailed in theSupplemental Data - Test / Temporary Rules on page 29.",
  "recommendation": "The rules should be reviewed and removed if no longer required.",
  "affects": "Device FORTIFW01"
},
"SR-104-005" : {
  "identifier": "SR-104-005",
  "title": "Rules Allow Any ICMP Message Type",
  "risk": "Low",
  "status": "Open",
  "description": "Rules were configured that allowed any ICMP message type between network segments. ICMP can be used to identify connected devices, and may be abused to exfiltrate data, where access controls ordinarily would restrict such action.",
  "recommendation": "Rules should be configured to only allow ICMP messages between specific hosts or subnets, and in those instances specific message types should be specified.",
  "affects": "Device"
},
"SR-104-006" : {
  "identifier": "SR-104-006",
  "title": "Proxy Address Resolution Protocol (ARP) was Enabled",
  "risk": "Low",
  "status": "Open",
  "description": "The Proxy ARP feature, used to support ARP translation of IP addresses into MAC addresses across network segments and VLANs, was found to be supported. Permitting ARP packets to travel beyond the originating systems network segment may undermine network segmentation. Proxy ARP is a legacy setting designed for hosts that do not have a default gateway configured. There is usually no good reason to have proxy ARP enabled in modern networks as it can allow attacks such as ARP spoofing.",
  "recommendation": "Proxy ARP functionality should be disabled, unless there is a significant business need. This should be done for each interface using the following command: set arpforward disable",
  "affects": "Device FORTIFW01"
},
"SR-104-007" : {
  "identifier": "SR-104-007",
  "title": "ICMP Redirect Messages Were Enabled",
  "risk": "Low",
  "status": "Open",
  "description": "Interfaces were configured to accept ICMP redirects. An attacker in a position to generate arbitrary ICMP packets may be able to manipulate the routing table to launch a man-in-the-middle attack.",
  "recommendation": "ICMP redirect message sending can be disabled on network interfaces with the following command: set icmp-redirect disable",
  "affects": "Device FORTIFW01"
},
"SR-104-008" : {
  "identifier": "SR-104-008 Network Time Source Not Authenticated",
  "title": "Network Time Source Not Authenticated",
  "risk": "Low",
  "status": "Open",
  "description": "Although the firewall was configured to synchronise with a network time source, it did not utilise authentication. If an attacker was able to modify a devices time with an inaccurate time update, then it would be more difficult during an examination to correlate the system logs. NTP (described in RFC 5905) is a complex time synchronisation protocol, with a number of different features and options such as time update authentication. Without authentication configured, an attacker could attempt to update the time by sending malicious time updates. An attacker could do this using open source code or by sending customised network packets, spoofing the source address. Furthermore, any systems that depend on accurate time, such as some authentication systems, could be disrupted and potentially cause a denial of service.",
  "recommendation": "All networked devices should be synchronised by updating their clocks from an authenticated network time source, to preserve consistency between logs on different devices. FortiGate devices can be configured with the following commands: config system ntp general {enable| disable} source-ip <ipv4_addr> syncinterval <interval_int> type {fortiguard | custom} server-mode {enable| disable} interface <interface_list> config ntpserver edit <serverid_int> authentication {enable| disable} key <password_str> key-id <int> tpv3 {enable| disable} server {<ipv4_addr> | <hostname_str> | <ipv4_addr>/<hostname_str>} end disable end",
  "affects": "Device"
},
"SR-104-009" : {
  "identifier": "SR-104-009 Unrestricted Administrative Interfaces",
  "title": "Unrestricted Administrative Interfaces",
  "risk": "Low",
  "status": "Open",
  "description": "Access controls were not configured in order to restrict access to the firewalls management interfaces. As a result, an attacker would not be prevented from attempting to gain access to the device, or from exploiting any software vulnerabilities which were present. Without any management host restrictions in place, an attacker or malicious user would be able to connect to the administrative services. If the service requires authentication and the attacker does not have any authentication credentials, they could attempt to gain access using a brute-force attack. Furthermore, if a software vulnerability were present in the service then allowing anyone to connect to the service could enable an attacker to exploit the vulnerability.",
  "recommendation": "Access should be restricted to known management hosts. The following commands can be utilised to configure the firewall via the CLI: config system admin edit admin set trusthost1 <ipv4_addr> <mask> end end",
  "affects": "Device FORTIFW01 Version 3.0- Page 19 of 32 Client Confidential"
},
"SR-104-010" : {
  "identifier": "SR-104-010 No Pre-Logon Banner Message",
  "title": "No Pre-Logon Banner Message",
  "risk": "Low",
  "status": "Open",
  "description": "A login banner warning the user about any unauthorised access or referring to the Computer Misuse Act was not in use. It is recommended that a pre-logon banner is used to inform users of their rights prior to accessing a device. Furthermore if legal proceedings were executed against an attacker it would be easier to prove intent on behalf of the attacker, if they were first warned against unauthorised access.",
  "recommendation": "A disclaimer should be configured, thereby ensuring users are aware of their legal and procedural responsibilities. General guidelines suggest that warning messages include at least the name of the organisation that owns the system, the fact that the system is subject to monitoring and that the use of the system implies consent to such monitoring.",
  "affects": "Device FORTIFW01"
},
"SR-104-011" : {
  "identifier": "SR-104-011 Local Based Authentication",
  "title": "Local Based Authentication",
  "risk": "Low",
  "status": "Open",
  "description": "The firewall was not configured to utilise a remote AAA solution such as Radius or TACACS+ for authentication, instead preferring the use of local users. Maintaining access and a secure password for a Group of administrators across a large number multiple network devices is not practical, administrators tend to compensate by using easy to remember passwords, or password reuse.",
  "recommendation": "Although it is recognised that the device is generally managed via FortiManager, it is consider best practice to utilise an authentication service for local access. Configure the device to utilize RADIUS or TACACS+. The following commands can be used to add a TACACS+ server: config system admin tacacs edit <name> set authen-type <auth_prot_type> set authorization {enable | disable} set key <password_string> set port <integer> set secondary-key <password_string> set secondary-server <string> set server <string> set tertiary-key <password_string> set tertiary-server <string> end",
  "affects": "Device FORTIFW01"
},
"SR-104-012" : {
  "identifier": "SR-104-012 Duplicate / Overlapping Rules",
  "title": "Duplicate/Overlapping Rules",
  "risk": "Low",
  "status": "Open",
  "description": "Rules that duplicated or overlapped one another were identified. Although not a direct threat to security, these rules could lead to confusion when administering the firewall. The clarity of a ruleset is important as confusion could lead to a configuration where access to services is overly permissive.",
  "recommendation": "Where possible, all rules should not duplicate or overlap others.",
  "affects": "Device FORTIFW01"
},
"SR-104-013" : {
  "identifier": "SR-104-013 Disabled Rules Present",
  "title": "Disabled Rules Present",
  "risk": "Informational",
  "status": "Open",
  "description": "A number of inactive rules were identified. Although not a direct threat to security, disabled rules can make network administration more difficult.",
  "recommendation": "Delete all disabled rules that are no longer required as a matter of good housekeeping.",
  "affects": "Device FORTIFW01"
},
"SR-104-014" : {
  "identifier": "SR-104-014",
  "title": "Rules without Comment Text or Annotation",
  "risk": "Informational",
  "status": "Open",
  "description": "The majority of rules did not have a comment or annotation associated with them. Although not a threat to security, without comment text, the purpose of rules can be unclear making the administration of policies more difficult. This can lead to a situation where rules that are no longer required remain configured, giving an attacker additional access. It is common for rules to initially be configured to allow access to a limited number of services and hosts and gradually grow over time as the business evolves and access to additional services or hosts are required. When access to a service is no longer required that related rule should be modified or removed. Without adequate tracking or change control, it may not be clear as to which rule applies to which service so the rule is not modified. In order to aid the clarity of rules, comment text can be included. This comment text is helpful in indicating why the rule exists.",
  "recommendation": "All rules should include a comment indicating its purpose.",
  "affects": "Device FORTIFW01"
}}
}
