{
  "NCC-SampleWAPT-001": "Finding Pre-authentication SQL Injection in DoLogin\nRisk Critical Impact: High, Exploitability: High\nIdentifier NCC-SampleWAPT-001\nStatus Reported\nCategory Data Validation\nComponent Web Application\nLocation The DoLogin function inAcmeOrders-git/v2/ExampleCorp.Orders.OrderUtils/Users/\nUserRepo.cs.\nImpact An attacker can compromise all data in the database, and can often compromise the underlying operating system.\nDescription SQL Injection is a class of attacks related to web application input and output validation. The\nflaw is found in situations where an end user can submit data to the application residing on\nthe server, which then uses this data to dynamically generate and execute SQL queries to a database (most commonly, via string concatenation). If the application fails to adequately limit the input a user can present to the application, it is possible for an attacker to take\nadvantage of this to execute arbitrary SQL statements. This will generally result in complete\ncompromise of the data in the database, and can often result in compromise of the underlying operating system.\nGenerally, the AcmeOrders backend API was architected to use stored procedures with parameter binding. This is a safe method of query construction that is not vulnerable to SQL injection. However, in this instance, the application is generating a dynamic SQL query by interpolating String values into the SQL query.\nAt line 835 ofDoLogin, theuserName parameter is interpolated into a SQL statement, which is then executed. This is a string value that is entirely controlled by the user. By using specially\nchosen characters, an attacker can modify the query that is ultimately performed against the\ndatabase in order to read or modify critical application data, bypass application logic, escalate\nprivileges within the database, or use the database to access the filesystem or operating\nsystem functionality.\nNote: Similar instances of this issue are present in theModifyCreds and StoreCreds functions.\nReproduction Steps 1. Send the followingPOST HTTP request to https://acmeorders.[examplecorpurl].com/Ho\nme/ValidateMe:\nPOST Home/ValidateMeHTTP/1.1\nHost: acmeorders.[examplecorpurl].com\nUser-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10.14; rv:68.0) Gecko/2010\n0101 Firefox/68.0\nAccept: application/json, text/javascript, */*; q=0.01\nAccept-Language: en-US,en;q=0.5\nAccept-Encoding: gzip, deflate\nReferer: https://acmeorders.[examplecorpurl].com/Home/Start\nContent-Type: application/x-www-form-urlencoded; charset=UTF-8\nX-Requested-With: XMLHttpRequest\nContent-Length: 91\n8 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\nDNT: 1\nConnection: close\nCookie: ASP.NET_SessionId=<sessionId>\nusername=invalid@nccgroup.com' OR 1=1--&password=foo\n2. Note that the user is now authenticated as the default “Orders” role.\nRecommendation SQL injection is best prevented by the use of parameterized queries (also called prepared\nstatements), which define a SQL query string and data elements separately. This prevents the\nuser from entering data that could escape the original SQL query to modify its functionality.\nAs an additional benefit, execution of parameterized queries is often faster than that of dynamic SQL queries. Prepared statements should be used for all non-static queries, even\nthose that do not directly take user input; dynamic data must not be interpolated into queries\nusing string concatenation.\nThe following code shows a safely constructed query:\njava.sql.PreparedStatement safeStatement = connection.preparedStatement(\n\"SELECT * FROM products WHERE prodName = ? AND serialNumber = ?\" );\nsafeStatement.setString(1, productName);\nsafeStatement.setInt(2, serialNumber);\nsafeStatement.executeQuery();\nFor more advice on fixing SQL injection, we recommend consulting theOWASP SQL Injection\nPrevention Cheat Sheet.\n9 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\n",
  "NCC-SampleWAPT-002": "Finding Users Can Become Other Users via Manipulated JWT\nRisk Critical Impact: High, Exploitability: High\nIdentifier NCC-SampleWAPT-002\nStatus Reported\nCategory Data Validation\nComponent Web Application\nLocation https://acmeorders.[examplecorp].com/api/token\nImpact An attacker can create a valid JWT for any other user by sending a JWT containing a modified\nusername to thehttps://acmeorders.[examplecorp].com/api/token endpoint.\nDescription The https://acmeorders.[examplecorp].com/api/token endpoint provides multiple code\npaths whereby users can exchange their access token for a new access token based on the\nperm_type parameter sent in the request. Thevalidate, validate_token, andreload_-\ntoken grant types call theValidateToken, ValidateTokenObj, andReloadToken functions respectively. Each of these functions call theLoadToken function on the JWT access token provided by the user. TheLoadToken function does not validate the signature of theJwtToken object returned by the function. As such, an attacker can set arbitrary values within the JWT that are then trusted by the application. Using this ability, the attacker can change the username of the JWT to receive a new, signed JWT from the application that would allow the attacker to act as the user.\nReproduction Steps 1. Send the followingPOST request body tohttps://acmeorders.[examplecorp].com/\napi/token:\nclient_id=AO&client_secret=AO%314159&access_token=eyJhbGciOiJIUzI1NiIsInR5cCI\n6IkpXVCJ9Cg.eyJzdWIiOiJ0ZXN0dXNlcjNAbmNjZ3JvdXAuY29tIiwidGVuYW50IjoiQWNtZS\nIsInRlbmFudElkIjoiMSIsInNhbGVzRm9ybWF0IjoiMSIsImFsbFRlbXBsYXRlcyI6IjEiLCJh\nbGxBZ2VudHMiOiIxIiwiIjowOTAwODg4NSwiZXhwIjoxNTY5OTk5OTk5LCJpc3MiOiJBY21lQ2\n9ycCIs.&grant_type=validate_token.\n2. Note: Observe that theaccess_token parameter has an empty signature field.\n3. Send the above request and observe that a valid access_token and refresh_token are returned for testuser3@nccgroup.com.\n4. Modify the contents of the above access_token to include any user within the sub field of the access_token.\n5. Resend the request and observe that a new access_token and refresh_token are returned for the new user.\nRecommendation Use the LoadAndVerifyToken function, instead of theLoadToken to validate the access token using the certificate that the access token was signed with. Additionally, validate the alg and any other pre-validation field match the expected algorithm or value of the received access token. Finally, the OAuth Working Group has developed a draft document outlining the JSON Web Token Best Current Practices1 that ExampleCorp can use to better ensure their design conforms with the industry accepted best practices.\n1https://tools.ietf.org/html/draft-ietf-oauth-jwt-bcp-06\n10 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\n",
  "NCC-SampleWAPT-014": "Finding Account Takeover via SMS Password Reset\nRisk Critical Impact: High, Exploitability: High\nIdentifier NCC-SampleWAPT-014\nStatus New\nCategory Authentication\nComponent API\nLocation https://acmeorders.[examplecorp].com/api/reset-pw-sms\nImpact Attackers can takeover a user account by sending a forged password reset request. Once an\nattacker takes over an account, they can post new content, delete content, modify account settings, manage orders, and more. Private information, such as private order information,\nphone numbers, location, and gender can be obtained by an attacker.\nDescription The endpoint athttps://acmeorders.[examplecorp].com/api/reset-pw-sms does not verify if\nthe _uid parameter is tied with the phone number and four-digit password reset code when\na POST request is sent to it.\nAn attacker can request a SMS password reset of their own account and have a four-digit code sent to their phone. After getting the code, they can submit the code to thereset-pw-sms endpoint and replace the_uid value with any_uid of their choice. This will allow the attacker\nto change the password for another users account. The_uid value of a specific user can be found by visiting the target user’s profile and using a browser proxy to view the request sent\nto /profile/username/[_uid] (where [_uid] looks like a long string of random letters and\nnumbers) to get the user’s_uid.\nReproduction Steps 1. Create a test account onhttps://acmeorders.[examplecorp].com.\n2. Add a phone number to the test account by going to the Profile page of the account.\n3. Save the phone number and logout.\n4. At the Login page, go to “Request password reset.”\n5. Enter the phone number from step 2 to receive a four-digit reset code by SMS.\n6. After receiving the code, use a web proxy such as BurpSuite to intercept web requests\nfrom a browser.\n7. Enter the code onhttps://acmeorders.[examplecorp].com and intercept the request to\nhttps://acmeorders.[examplecorp].com/api/reset-pw-sms, which contains the four-digit\ncode.\n8. Change the_uid parameter to the_uid of the victim account. The_uid value can be\nfound by visiting a target user’s profile and viewing, using a web proxy, a request to “/\nprofile/username/[_uid]” (where [_uid] looks like a long string of random letters and\nnumbers) to get a user’s_uid.\n9. Send the request and change the password for the target/victim account.\nRecommendation Ensure that thereset-pw-sms endpoint is properly handling requests, including:\n• Perform basic validity checking, including checking any posted_uid parameter, phone\nnumber, and four-digit code are currently valid.\n• Generate random (low predictability), unique codes to authorize password reset.\n• Make sure four-digit codes expire after some reasonable length of time, and do not re-use\ncodes.\n• Verify that the phone number in the request is associated with the proper_uid and that\n11 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\nthe supplied code was sent to that phone number.\n12 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\n",
  "NCC-SampleWAPT-003": "Finding Users Can Change Arbitrary User’s Password via UpdatePassword\nRisk High Impact: High, Exploitability: High\nIdentifier NCC-SampleWAPT-003\nStatus New\nCategory Access Controls\nComponent Web Application\nLocation https://acmeorders.[examplecorpurl].com/api/User/UpdatePassword\nImpact Any AcmeOrders user can change the password of any other user.\nDescription The User/UpdatePassword API allows users to specify an arbitraryusername and force-\nNewPassword parameter for the request. These values are passed to theUpdatePassword\nfunction in theUserRepo class. The UpdatePassword function interpolates the values into\na database query and stores them into the database. This allows an attacker to update or\ndeny access to any user’s account by directly invoking this endpoint.\nReproduction Steps 1. Authenticate to the AcmeOrders application and retrieve the access token returned to the\nuser.\n2. Send the following request tohttps://acmeorders.[examplecorpurl].com, filling in the “vic-\ntim username” parameter with the name of a user you have credentials for and intend to\nreset the password of:\nPOST /api/v2/UpdatePassword HTTP/1.1\nHost: acmeorders.[examploecorpurl].com\nUser-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10.14; rv:68.0) Gecko/2010\n0101 Firefox/68.0\nAccept: application/json\nAccept-Language: en-US,en;q=0.5\nAccept-Encoding: gzip, deflate\nContent-Type: application/json\nAuthorization: Bearer <ACCESS TOKEN HERE>\nConnection: close\nReferer: https://acmeorders.[examplecoropurl].com/Dash\nCookie: LB.acmeorders.[examplecorpurl].com_Pool=<value>\n{\"username\":\"<victim username>\", \"forceNewPassword\":\"NCCgrp@1234\"}\n3. Observe that it is now no longer possible to authenticate with the victim username and\ncredentials.\n4. Additionally, by viewing the database directly, observe that the password for the victim\nuser is nowNCCgrp@1234.\nRecommendation Do not allow the user to submit ausername parameter as part of a password change request;\ninstead, retrieve the user’susername from their JWT OAuth token. Additionally, create sep-\narate endpoints for performing a password reset for a user with a forgotten password and\nfor users updating their password using theirprevPassword. This will allow the endpoint to\nvalidate the user’s existing password to prevent attackers with access to a vulnerability, for\nexample server-side request forgery, which allows the attacker to invoke this endpoint.\n13 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\n",
  "NCC-SampleWAPT-004": "Finding Arbitrary File Read inExampleFilesObject\nRisk High Impact: High, Exploitability: High\nIdentifier NCC-SampleWAPT-004\nStatus Reported\nCategory Access Controls\nComponent Web Application\nLocation The ‘ExampleFilesObjectcontroller method located at AcmeOrders-git/v7/ExampleCorp.Orders.BusinessLogic/\nFiles/ExampleFile.cs:452‘\nImpact An attacker can read files from the server, including application source code and sensitive operating system files. This could enable the attacker to steal infrastructure credentials, perform denial-of-service attacks, dump user information, or find additional vulnerabilities in the application.\nDescription When accessing the filesystem, it is extremely important that an application performs security\nchecking to ensure valid access. If a user-controlled filename is provided to the system, it opens a risk of file access that is not limited to the intended files.\nThe application does not perform validation when returning files to the user from theExampleFilesObject controller. As a result, an attacker can read arbitrary files on the application\nserver, including application source code and configuration files. Inserting path characters (/ or ../) into the vulnerable parameter allows the attacker to traverse outside of the default directory to access sensitive files stored in system or application directories. For most methods in this controller, files are retrieved from a separate backend service.\nThose backend services may be vulnerable to file access issues as well, but were not in scope for the engagement and so were not tested. However, at least one method in the ExampleFilesObject controller reads files from the local filesystem, as shown here:\n[HttpGet]\npublic ActionResult DownloadSavedFile(string fileName)\n{\nvar ms = default(byte[]);\nvar tmpPath = Path.GetTempPath();\nvar fileBytes = System.IO.File.ReadAllBytes(tmpPath + fileName);\nreturn File(fileBytes, MediaTypeNames.Application.Zip, fileName);\n...\nThe fileName parameter is provided by the user.\nReproduction Steps Submit the following request to the application, substituting valid cookies:\nGET /v2/ExampleFiles/SaveFile?fileIds=1,2 HTTP/1.1\nHost: apppreview.[examplecorpurl].com\nConnection: close\nAccept: application/json, text/javascript, */*; q=0.01\nX-Requested-With: XMLHttpRequest\nUser-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_6) AppleWebKit/537.36 (\nKHTML, like Gecko) Chrome/77.0.3865.0 Safari/537.36\n14 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\nSec-Fetch-Mode: cors\nContent-Type: application/json; charset=utf-8\nSec-Fetch-Site: same-origin\nReferer: https://apppreview.[examplecorpurl].com/ExampleFinder/Index\nAccept-Encoding: gzip, deflate\nAccept-Language: en-US,en;q=0.9\nCookie: BIGipServer~[www.examplecorpurl].com_Pool=5551212; ASP.NET_SessionId=blo\nbxvy5778RGqf2; shortDateFormat=M/DD; longDateFormat=MM/DD/YYYY; _ga=5551212;\n_gid=5551212; lzt=Zulu; .ASPXAUTH=A45666888BF7899etc\nAfter successfully submitting that request, submit the following request with valid cookies:\nGET /v2/ExampleFiles/DownloadSavedFile?filename=..\\..\\..\\..\\..\\..\\..\\..\\WINDOWS\\\nSystem32\\drivers\\etc\\hosts HTTP/1.1\nHost: apppreview.[examplecorpurl].com\nConnection: close\nAccept: application/json, text/javascript, */*; q=0.01\nX-Requested-With: XMLHttpRequest\nUser-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_6) AppleWebKit/537.36 (\nKHTML, like Gecko) Chrome/77.0.3865.0 Safari/537.36\nSec-Fetch-Mode: cors\nContent-Type: application/json; charset=utf-8\nSec-Fetch-Site: same-origin\nReferer: https://apppreview.[examplecorpurl].com/ExampleFinder/Index\nAccept-Encoding: gzip, deflate\nAccept-Language: en-US,en;q=0.9\nCookie: BIGipServer~[www.examplecorpurl].com_Pool=5551212; ASP.NET_SessionId=exa\nmbleBAFy5778RGqf2; shortDateFormat=M/DD; longDateFormat=MM/DD/YYYY; _ga=5551\n212; _gid=5551212; lzt=Zulu; .ASPXAUTH=example788943rrttu\nObserve that the server responds with the contents of theWINDOWS\\System32\\drivers\\e\ntc\\hosts file:\nHTTP/1.1 200 OK\nCache-Control: private\nContent-Type: application/zip\nServer: Microsoft-IIS/8.5\nX-AspNetMvc-Version: 5.2\nContent-Disposition: attachment; filename=\"..\\\\..\\\\..\\\\..\\\\..\\\\..\\\\..\\\\..\\\\WINDO\nWS\\\\System32\\\\drivers\\\\etc\\\\hosts\"\n# localhost name resolution is handled within DNS itself.\n# 127.0.0.1 localhost\n# ::1 localhost\n# ClientFileServer Host Entries\n172.48.4.11 EXAMPLECORP01 EXAMPLECORP01.{EXAMPLEDNSNAME}.COM\n...\nRecommendation If the multiple file zip download logic is not currently used in the application, then this can\nsimply be removed from the application. From the web UI, it did not appear to be possible\nto exercise this logic, indicating that it is not currently used.\nOtherwise, apply file access controls to prevent an attacker from performing attacks such as\npath traversal. Access controls can encompass a number of different strategies:\n15 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\n• Whitelisting of allowed files for writing and reading\n• Input sanitization to strip filenames of dangerous characters\n• Ignoring user-controlled filenames and storing files using a randomly generated filename\nin a safe directory\nThese strategies must be applied in addition to normal application protections, such as au-\nthorization checking for file access, preventing access to restricted files, and storing uploaded\nfiles outside of the application’s root.\n16 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\n",
  "NCC-SampleWAPT-007": "Finding Design Pattern Creates Risk of Server-Side Request Forgery (SSRF)\nRisk High Impact: High, Exploitability: Undetermined\nIdentifier NCC-SampleWAPT-007\nStatus Reported\nCategory Data Exposure\nComponent Web Application\nImpact The design patterns used in the AcmeOrders web application’s source code create a significant risk of SSRF vulnerabilities. Using an SSRF vulnerability, an attacker could port scan\nand fetch web content from the application’s internal network and from services listening locally on the application server. It could also be possible to exfiltrate sensitive information\nor exploit insecure services that are only exposed internally.\nDescription In a Server-Side Request Forgery (SSRF) attack, the attacker abuses functionality on the server\nto read or modify resources internal to the application’s network infrastructure. The attacker\ncan supply or modify a URL that the code running on the server will fetch or submit data to.2\nAcmeOrder’s architecture and source code design patterns create a significant risk of SSRF\nvulnerabilities. Specifically, the AcmeOrders web application creates HTTP requests to other services on ExampleCorp’s network using user-supplied parameters. If the user-supplied\ndata can be used to change the intended destination of the request, SSRF attacks could result.\nThe AcmeOrders web application performs a backend HTTP request for almost every non-\nstatic user request. These requests primarily go to the internal AcmeOrders API. For example,\nwhen retrieving details on a specified order, the following method ofExampleController.cs\nis called:\n[HttpGet]\npublic ActionResult ExampleOverview(int exampleId)\n{\nvar client = new ApiClientHandler(Session[\"accessToken\"].ToString());\nvar apiUrl = $\"{ConfigurationManager.AppSettings[\" API_URLBase\"]}/Examples/{e\nxampleId}\";\nvar examples = client.GetAsyncWithAutoTokenRefresh<Example>(this, apiUrl);\n...\nThis method concatenates the user-suppliedexampleId parameter into a URLapiUrl, which\nis then requested via the methodGetAsyncWithAutoTokenRefresh. This is a pattern that\nhas a significant risk for SSRF vulnerabilities. In this case, becauseexampleId is parsed as an\ninteger, there is little risk. But in other methods, if a string parameter is provided, an attacker\ncould potentially control the URL of the request to change the destination host or to change\nthe specific route on the host.\nThere are other locations where this pattern occurs using user-supplied string parameters,\nsuch as theregistration parameter in the following method ofExampleReportControll\ner.cs:\n2Wallarm’s SSRF bible(PDF) provides a thorough introduction to SSRF vulnerabilities and exploitation.\n17 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\npublic ActionResult ExportData(DateTime beginDate, DateTime endDate, string regi\nstration,\nstring examplenumber, string customerCode, string exampledepStn,\n[DataSourceRequest] DataSourceRequest request)\n{\nif (Session[\"accessToken\"] == null)\nreturn Redirect(\"~/Home/Authorization\");\nvar client = new ApiClientHandler(Session[\"accessToken\"].ToString());\nvar getAllUrlString = $ \"{ConfigurationManager.AppSettings[\" API_URLBase\"]}/\"\n+\n$\"ExampleReport?beginDate={beginDate}&endDate={endDate}&\" +\n$\"registration={registration}&examplenumber={examplenumber}&\" +\n$\"customerCode={customerCode}&exampledepStn={exampledepStn}\";\nNCC Group did not attempt to identify all locations where this pattern occurs, as the pattern\nis systemic across the AcmeOrders web application. There are a number of possible ways to\nexploit the issue:\n• Changing the destination host from the expected host (e.g. the internal AcmeOrders API)\nto another backend system\n• Changing the requested route (e.g./ExampleReport) to a different route on the same host, such as/User/ChangePassword\n• Adding or modifying request parameters that are not otherwise user-controlled\nThe actual exploitability of the issue has not been explored, as an exploit would depend on a\nnumber of complex factors: the context of the vulnerability itself, the code logic that handles\nURL parsing,3 and the logic and routing of the targeted system.\nRecommendation First, all user-supplied parameters should undergo URL encoding before being included in\nURL strings. This appears to be the primary issue within the AcmeOrders codebase. By\nforcing URL encoding on user-supplied parameters, those parameters will not be able to\nbreak the application’s URL parsing logic or add additional parameters. .NET provides the\nHttpUtility.UrlEncode method for this purpose. Additional information can be found on\nWikipedia.\nThere are a number of additional strategies that could help to mitigate this design flaw. Net-\nwork traffic controls could be used to whitelist routes from the AcmeOrders web application\nto the internal API and prevent outbound HTTP requests to other servers; however, the web\napplication talks to other hosts as well, and all whitelisted hosts would still be vulnerable to\nattacks.\nAnother strategy would be to perform parameter validation on all user-supplied parameters\nin the user-facing web application. The validation of ID types (must be an integer) provides\nan example of this. If there are known formats for other fields (in particular, all string fields\nthat are supplied by users), those could be validated to ensure they match a safe character\nset. For most purposes in AcmeOrders, NCC Group believes that whitelisting the character\nset [a-zA-Z0-9_\\-] (letters, digits, underscores, and hyphens) would prevent exploitation\nof most vulnerabilities without overly restricting input. However, this character set may not\nsuffice for all purposes (such as email addresses), and so it would not necessarily be possible\nto apply it universally.\n3See Orange Tsai’s talkA New Era of SSRF: Exploiting URL Parser in Trending Programming Languages(PDF)\n18 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\n",
  "NCC-SampleWAPT-011": "Finding Application Returns Incorrect Content-Type for JSON Responses\nRisk High Impact: High, Exploitability: High\nIdentifier NCC-SampleWAPT-011\nStatus New\nCategory Data Validation\nComponent Web Application\nLocation The JSON responses for XMLHttpRequest requests performed by AcmeOrders, such as:\n• https://[acmeorder_uri]/dir1/get_orders\n• https://[acmeorder_uri]/dir1/get_invoices\n• https://[acmeorder_uri]/dir1/foo.json\n• etc.\n• etc.\nImpact Browsers may behave unexpectedly when presented with an incorrectContent-Type. Since\nAcmeOrders is returning JSON content with aContent-Type of text/html, the application\nis vulnerable to cross-site scripting attacks.\nDescription Web browsers rely on the HTTPContent-Type header to determine how to handle responses\nfrom web applications, whether that content is HTML, JavaScript, an image, or something\nelse. If an application returns an invalid or incorrectContent-Type, browsers will still at-\ntempt to parse the response, but often behave unexpectedly or insecurely. The AcmeOrders\napplication returns JSON responses containing user-controller information, but with an HTML\nContent-Type:\nHTTP/1.1 200 OK\nServer: TornadoServer/6.0.3\nContent-Type: text/html\n{\"draw\":4,\"recordsTotal\":94050,\"recordsFiltered\":1,\"data\":[[\"ncc-group-\ntest@[examplecorptest].com\",\"A test group\",\"Member\"]]}\nUpon receiving this response, a web browser will skip past all preliminary characters and\nbegin parsing once it reaches an HTML tag. A malicious user could change their group\ndescription in order to cause cross-site scripting:\nHTTP/1.1 200 OK\nServer: TornadoServer/6.0.3\nContent-Type: text/html\n{\"draw\":4,\"recordsTotal\":94050,\"recordsFiltered\":1,\"data\":[[\"ncc-group-\ntest@[examplecorptest].com\",\"A test group<script>alert(1)</script>\",\"Member\"\n]]}\nApplications must always set the correctContent-Type for responses. Any invalid or incor-\nrect Content-Type could potentially be exploited.\nRecommendation For every response containing a message body, the web application should include a single\nContent-Type header that correctly and unambiguously states theMIME typeof the content\nin the response body. AcmeOrders should ensure that all JSON responses have aContent-\n19 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\nType of application/json. Tornado’sRequestHandler.write() will do this automatically\nif the supplied argument is a dictionary (dict); however, AcmeOrders instead passeswrite()\na string (str) by callingjson.dumps().\nApplications that serve uploaded files should additionally set the following headers to prevent\nContent-Type confusion on user-uploaded content:\n• X-Content-Type-Options: nosniff: instructs browsers not to guess at theContent-\nType\n• Content-Disposition: attachment: instructs the browser to download the file rather\nthan render it\n20 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\n",
  "NCC-SampleWAPT-013": "Finding S3 Buckets Misconfigured\nRisk High Impact: High, Exploitability: High\nIdentifier NCC-SampleWAPT-013\nStatus New\nCategory Access Controls\nComponent AWS\nLocation NOTE: this finding results from an optional service focused on cloud security review;\nwhile not typically a part of a standard web application security assessment, we com-\nmonly identify cloud-related issues like this for applications hosted on platforms such\nas AWS, Azure, and Google Cloud Platform.\nThe following S3 buckets in ExampleCorp’s AWS environment.\n• examplecorp-sitemaps\n• examplecorp-demo\n• examplecorp-orders\n• examplecorp-invoices\n• examplecorp-test\n• examplecorp-chipper\n• examplecorp-builds\nImpact For components of AcmeOrders that utilize S3 buckets for storage, an attacker may do the\nfollowing:\n• Enumerate the contents of the buckets whose ACLs grant read (list) permission to the\n“authenticated users” group or anonymous users.\n• Upload new files and use ExampleCorp’s bucket to host and distribute malware.\n• Gain information about the access controls in place for the target buckets and mount\nfurther attacks using this information.\n• Access objects in buckets that are not granted the read (list) permission for anonymous\nusers.\nDescription NCC Group identified the following misconfigurations in ExampleCorp’s S3 buckets.\n• The examplecorp-sitemaps bucket is world-readable (listable) for anonymous users.\n• The examplecorp-demo bucket is world-writable for anonymous users.\nAdditionally, it was discovered that the following buckets have a policy to allow any AWS\nprinciple to perform get actions on the objects that reside within the buckets. This effectively\nmakes all objects in the bucket readable.\n• examplecorp-orders\n• examplecorp-invoices\n• examplecorp-test\n• examplecorp-chipper\n• examplecorp-builds\n{\n\"Action\": [\n\"s3:GetObject\"\n],\n\"Effect\": \"Allow\",\n\"Principal\": \"*\",\n\"Resource\": \"arn:aws:s3:::[bucket-name]/*\",\n21 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\n\"Sid\": \"AddPerm\"\n}\nAlthough NCC Group was not able to examine each exposed object, due to the time restricted\nnature of the engagement, several buckets seem to contain sensitive information. For exam-\nple, objects in theexamplecorp-invoices bucket include ERB (Embedded RuBy) templates,\nPDFs, and images. Objects in theexamplecorp-builds bucket include client-side source\ncode used by the web application.\nIt should be noted that at the time of the engagement no malicious items were found in the\nexamplecorp-demo bucket.\nReproduction Steps 1. Examine the bucket ACLs for the target buckets. The only permission grants for the given\nbucket are for the userzack.\naws s3api get-bucket-acl --bucket examplecorp-orders\n{\n\"Owner\": {\n\"DisplayName\": \"zack\",\n\"ID\": \"820a4f[IDstring..................]64\"\n},\n\"Grants\": [\n{\n\"Grantee\": {\n\"DisplayName\": \"zack\",\n\"ID\": \"820a4f[IDstring..................]64\",\n\"Type\": \"CanonicalUser\"\n},\n\"Permission\": \"FULL_CONTROL\"\n}\n]\n}\n2. Navigate to:https://[examplecorp-ordersurl].s3.amazonaws.com/dir1/documents/dir2/di\nr3/order_template.html.erb\n3. Note that you have just accessed the ERB template used by the AcmeOrders web applica-\ntion.\nRecommendation Ensure that the IAM Policies, S3 Bucket Policies, and S3 Access Control Lists (ACLs) limit the\naccess of the S3 bucket to those who have a defined business need. If an S3 bucket is no\nlonger needed, it should be deleted.\n22 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\n",
  "NCC-SampleWAPT-006": "Finding Application Uses Weak Hash to Store Passwords\nRisk Medium Impact: Medium, Exploitability: Medium\nIdentifier NCC-SampleWAPT-006\nStatus Reported\nCategory Cryptography\nComponent Web Application\nLocation The authentication logic defined inexampleorder-git/v7/Example.Path.BusinessLogic/\nUsers/ExampleUser.cs:235-258.\nImpact An attacker who is able to compromise the application’s storage, such as through a database\nflaw or information disclosure, can more easily recover user passwords.\nDescription The application stores user passwords for accounts using two password hashing schemes,\nwith varying weaknesses. NCC Group traced the flow of authentication logic through the\napplication and found the following method:\nExampleBranch::AuthenticateUser() – logic to authenticate user against local database,\nand to choose between two password hashes\n• OldExampleEncryption::CheckPassword() – legacy password check, usesbcrypt with\na static salt\n• SecurityExampleLibrary::DiffExamplePasswords() – current password check, uses\nSHA512 (single round) with a unique salt\nbcrypt is a safe, widely-supported password hash. However, the underlying implementation\nuses a static salt (line 721 ofOldExampleEncryption.cs). A salt is a random per-password\nvalue that slows down cracking attempts by requiring attackers to perform a new brute-\nforce attack on each password. For example, with unique salts, two users with the password\n“123456” would have different password hashes. With a static salt, an attacker with access to\nhashed passwords would not need to attempt to crack each password individually. Instead,\na brute-force attack would enable them to attack all password hashes concurrently without\nany extra work.\nIn comparison, theDiffExamplePasswords does use a unique salt for each password. How-\never, SHA512 is not an effective hash for password hashing. Because this hash can be per-\nformed very quickly, hashed passwords are vulnerable to brute-force cracking. An attacker\nwith access to the hashed passwords is likely to be able to recover significant numbers of\nplaintext passwords using a tool such ashashcat. An ideal password hash forces an attack\nto use significant resources to crack dumped password hashes.\nAdditionally, the presence of two separate hashing schemes (one named “old”) suggests that\na migration was never finalized. When switching to a new hashing scheme, it is best to create\na defined process and a timeline for the complete switchover to be performed so that legacy\nlogic may be removed in an explicit timeframe. This way, vulnerabilities in outdated code do\nnot affect the application after the code is no longer in use.\nRecommendation NCC Group recommends usingbcrypt, a widely-supported hash that handles salting au-\ntomatically. This hashing algorithm is designed to resist brute-forcing attempts. The only\naspect of bcrypt that requires manual configuration is the “cost factor”, a value which deter-\n23 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\nmines how many iterations to perform4 (thus determining the amount of processing time\nnecessary to hash a single password). NCC Group recommends that most applications use\na cost factor of 12. On modern processors, this cost factor results in hashing taking approx-\nimately half a second for each password.5\nThe existing bcrypt implementation has a number of issues and should not be used going\nforward. Instead, use a library with a safe API such ashttps://github.com/BcryptNet/bcryp\nt.net. This library handles salting internally and a salt should not be supplied to the library\ncalls.\nTo upgrade to a modern password hash, there are a number of possible strategies:\n• Discard all existing hashes and force users to set new passwords. This strategy may work\nwell for applications with a small number of users who can be reached directly, such as\ninternal company applications.\n• Upgrade users at their next login by comparing the existing hash, saving the new hash,\nand finally discarding the existing hash. This strategy is effective for active users, but can\nhave issues with users who do not log in for long periods of time: their old, weak password\nhashes will remain in the database until they log in.\n• Immediately upgrading all hashes by using the new hashing algorithm on the existing\nhashed passwords. When users log in, first hash their password with the legacy algorithm,\nthen hash again with the modern algorithm. This strategy is safe in most cases (even\nfor weak algorithms like MD5), but requires the application to maintain the backwards-\ncompatibility logic indefinitely.\n4See https://security.stackexchange.com/a/3993 for a more in-depth explanation of work factors for password\nhashing.\n5See https://security.stackexchange.com/a/83382 for a benchmark of bcrypt on a recent Intel processor.\n24 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\n",
  "NCC-SampleWAPT-012": "Finding IAM PassRole Permission Allows Potential Authorization Bypass\nRisk Medium Impact: High, Exploitability: Low\nIdentifier NCC-SampleWAPT-012\nStatus New\nCategory Access Controls\nComponent AWS\nLocation NOTE: this finding results from an optional service focused on cloud security review;\nwhile not typically a part of a standard web application security assessment, we com-\nmonly identify cloud-related issues like this for applications hosted on platforms such\nas AWS, Azure, and Google Cloud Platform.\nThe following IAM policies in ExampleCorp’s AWS environment:\n• AWS-CodePipeline-Service\n• CloudFormationLambdaExecuteRoll\n• AWSLambdaFullAccess\n• AutoScalingServiceRolePolicy\n• AWSDataPipelineRole\n• TeamCityServer\n• AWSEC2SpotServiceRolePolicy\n• LambdaFunctionDeploy\nImpact An IAM user in the groups above may be able to achieve privilege escalation to access re-\nsources or services without authorization.\nDescription Some AcmeOrders application instances are hosted on AWS. When configuring or creating\nan instance of an AWS service, users generally pass on an IAM role to that service. When\nthe service needs to perform a privileged AWS task, it can then use the permissions asso-\nciated with its IAM role (and the automatically-provisioned AWS credentials) to perform the\naction. The AWS permissioniam:PassRole6 is what defines which roles an IAM user (or a\nservice itself) can pass on. The groups listed in the location section above have the following\npermissions statement (edited for brevity).\n\"Action\":\n[ ... \"iam:PassRole\", ... ],\n\"Effect\": \"Allow\",\n\"Resource\": [\n\"*\"\n]\nThis statement allows a user to passany role to a new service, even one the user does not\nhave. This ability is somewhat restricted; for example, the requested role may only be valid\nfor certain services (defined as the “trusted entities” via the “sts:AssumeRole” permission on\nthe role). Additionally, to pass a role to an EC2 instance, there must be an instance profile for\nthe given role.\nThe effect of this statement is that a user in the target groups may be able to pass a role\nthat has privileges the user themselves does not. For example, a user, such asmichael, who\n6https://docs.aws.amazon.com/IAM/latest/UserGuide/id_roles_use_passrole.html\n25 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\nwould normally have read-only access to S3 buckets but is also a member ofAmazonKinesisF\nirehoseFullAccess, AmazonRedshiftFullAccess, AmazonS3FullAccess, orAWSLambda-\nFullAccess policies could pass themselves a role that would allow them full access to all\nAWS resources. As a result, the expected permissions model may be violated, allowing users\nto access many services or resources outside of their expected abilities.\nRecommendation When granting theiam:PassRole permission, the “Resource” should always be limited to\nonly the intended role for the given user. Amazon’s AWS documentation provides a tutorial\nwith a number of examples athttps://aws.amazon.com/blogs/security/granting-permission-\nto-launch-ec2-instances-with-iam-roles-passrole-permission/ .\n26 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\n",
  "NCC-SampleWAPT-008": "Finding Verbose Error Messages Disclose Sensitive Information\nRisk Low Impact: Low, Exploitability: Medium\nIdentifier NCC-SampleWAPT-008\nStatus Reported\nCategory Data Exposure\nComponent Web Application\nLocation The customErrors setting defined inWeb.Config:116\nImpact The application discloses application stack traces when an unhandled error occurs. An at-\ntacker may be able to use this information to aid further attacks or as part of a social engi-\nneering attack.\nDescription When an error condition occurs in AcmeOrders, the response includes a full application stack\ntrace. A user can trigger an error condition by sending invalid input in a number of locations.\nSpecifically, the error page included:\n• Full file paths of source code files\n• Class names, method names and arguments, and line within source code file\nReproduction Steps Trigger a 500 error and observe that a detailed stack trace is included in the HTML body and\nalso within an HTML comment. For example, navigate tohttps://exampleorder.[examplec\norpurl].com/ExampleAlert/GetEmailAlertDetail?emailalertid=100 and observe the following\nstack trace:\n[HttpRequestException: Response status code does not indicate success: 500 (Inte\nrnal Server Error).]\n[AggregateException: One or more errors occurred.]\nSystem.Threading.Tasks.Task`1.GetResultCore(Boolean waitCompletionNotificatio\nn) +589907\nExamplePath.v2.Utilities.Api`1.GetRequest(String url, String token) in C:\\Cod\ne\\ExamplePath\\v2\\Utilities\\Api.cs:22\nExamplePath.v2.Utilities.Api`1.GetApiData(HttpContext currentContext, String\nurl, String recache) in C:\\Code\\ExamplePath\\Utilities\\Api.cs:123\nExamplePath.v2.Example.GetEmailAlertDetail(JsonDynamicWrapper json) in...\n[9 more similar references]\nRecommendation The application should trap all errors and present a generic error message to the user.\nError details should be logged in the back end to a location not accessible from the exter-\nnal network. In .NET MVC, thecustomErrors configuration attribute can bet set toOn to\ndisplay a generic error message when an unhandled exception occurs. Microsoft provides\ndocumentation athttps://msdn.microsoft.com/en-us/data/h0hfz6fc(v=vs.110).\n27 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\n",
  "NCC-SampleWAPT-010": "Finding Potential Backdoor User\nRisk Low Impact: Medium, Exploitability: Low\nIdentifier NCC-SampleWAPT-010\nStatus Reported\nCategory Authentication\nComponent Web Application\nLocation The authentication logic defined inAcmeOrders-git/v7/Example.Path.BusinessLogic/\nUsers/ExampleUser.cs:512-515.\nImpact An attacker with access to the application’s source code or other internal knowledge of the\nAcmeOrders application may be able to use theExampleAPIUser account to authenticate to\nthe application without proper credentials. Additionally, a malicious user may be able to use\nthis account to access the application after their application access has been removed.\nDescription The authentication application logic contains two conditional statements checking for aEx-\nampleAPIUser account using a hardcoded password. It appears that this conditional by-\npasses the normal application authentication flow. Backdoor users that circumvent application logic make it difficult to restrict access to the application after a user’s access is removed.\nAdditionally, if an attacker is able to recover the source code for the application without a valid\nset of credentials the attacker can potentially authenticate to the application using these\nbackdoor credentials.\nBelow is a portion of the conditional that checks for theExampleAPIUser:\n512\nif (userLogin.UserName == \"ExampleAPIUser\" && userLogin.Password == \"hardcoded_p\nassword_value\")\n513 {\n514 user = new User { Id = -1, DisplayName = \"ExampleAPIUser\" };\n515 }\nReproduction Steps Navigate tohttps://url.[examplecorpurl].com/Login/and provide ‘ExampleAPIUser’ and ‘hard\ncoded_password_value’ as credentials. Authentication succeeds and the user context is set\nas shown in the following screenshot:\n{example screenshot}\nRecommendation Remove this conditional statement from the application authentication logic. If AcmeOrders\nrequires service accounts for performing application functionality, ExampleCorp should create a limited service account role, register the accounts with the application, and store their\ncredentials in a secure secret storage mechanism such as AWS Secrets Manager,7 Hashicorp\nVault,8 or CyberArk.9\n7https://aws.amazon.com/secrets-manager/\n8https://www.vaultproject.io\n9https://www.cyberark.com/products/privileged-account-security-solution/enterprise-password-vault/\n28 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\n",
  "NCC-SampleWAPT-009": "Finding Multiple Complex Authentication Methods\nRisk Informational Impact: Undetermined, Exploitability: Undetermined\nIdentifier NCC-SampleWAPT-009\nStatus Reported\nCategory Authentication\nComponent Web Application\nImpact The risk for authentication vulnerabilities is greatly increased due to the complexity intro-\nduced by the varied authentication sources, authentication tokens, and credential storage.\nDescription The AcmeOrders application uses a combination of Active Directory, application credentials, .NET session management, and JWT-based OAuth tokens for authentication. Additionally, user credentials are currently stored in two locations: the AcmeORders database ExampleUsers table and the Exampleblob database ExampleUsers table. This varied collection\nof authentication sources, representation, and storage has caused the AcmeOrders authentication logic to be spread across various parts of the code base.\nIn most locations where authentication logic is implemented, the logic is complex and includes a substantial amount of control flow. In particular, the main AcmeOrders authentication entry point,ExampleUser.AuthenticateExampleUser, contains about 220 lines of code including a series of deeply nested control flow statements. This complexity and\ndecentralization of the authentication logic contributed to the many authentication related vulnerabilities identified by NCC Group during testing.\nRecommendation Transition from the combination of Active Directory and application-based authentication sources to a single standardized authentication solution for both ExampleCorp employees and AcmeOrders application users. Additionally, ExampleCorp should standardize the authentication token between all ExampleCorp services. ExampleCorp should centralize all authentication logic into a single portion of the codebase, ideally in the internal APIs to allow\neasy reuse of the authentication logic. Optimally, ExampleCorp should migrate all authentication to an external single-sign on (SSO) provider to limit the necessity of managing user credentials. Migrating to an SSO provider would allow ExampleCorp to simplify the AcmeOrders authentication logic, improve customer\ncredential management, easily implement security measures like multi-factor authentication,\nand reduce the difficulty of integrating with a customer’s sign on solution if requested.\n29 | Sample Web App/Service Pen Test Report - © NCC Group 2019 NCC Group Confidential\nSAMPLE\n"
}