{
  "SR-102-001": "SR-102-001 Reflected Cross-Site Scripting (XSS)\nRisk Rating Medium Status Open\nDescription:\nThe website was vulnerable to reflected, or non-persistent, cross-site scripting (XSS) attacks. This type of vulnerability\noccurs when data provided by a web client is used immediately by server-side scripts to generate a page of results for\nthe user. If unvalidated user-supplied data is included in the resulting page without full and proper HTML escaping,\nclient-side executable code may be injected into the dynamic page.\nIn the case of a GET request, this means that a URL which appears to be associated with the site (and therefore\ntrustworthy to regular users) could contain malicious code that would be executed by the user’s browser within the\ncontext of the website when the link is visited. In the case of a POST request, a victim user would have to first be\ncoerced to an otherwise unrelated site which then launches attack using a form.\nIn this case it was established that the email_address parameter in the following two URLs were vulnerable.\nEvidence of URLs requests, payloads and responses redacted\nOther vulnerable locations are noted inSupplemental Data - Reflected Cross-Site Scripting on page 28.\nReflected cross-site scripting vulnerabilities are extremely common in web applications but can have a serious impact.\nThey are typically used to launch site impersonation or phishing attacks, in which unsuspecting users are lured to\nmalicious sites via links that appear legitimate. The attacker is then free to present the user with what appears to\nbe genuine content, in an attempt, for example, to capture authentication credentials. Another common method of\nexploitation is to capture the session token of the victim user, allowing their session to be hijacked by the attacker.\nRecommendation:\nReliable avoidance of cross-site scripting vulnerabilities should consist of two stages - input validation and output\nencoding.\nInput validation involves the application rejecting any characters which are invalid for the field in question, preferably\nby whitelisting a limited set of characters (in a telephone number field, for example, the whitelisted characters could\nbe 0-9, parentheses, and hyphens). This strategy can also help in mitigating other flaws which stem from a failure to\nsanitise input, such as SQL or HTTP header injection attacks.\nOutput encoding requires the encoding of all special characters (such as those used in HTML and JavaScript) in\npotentially malicious data. This is generally done directly before display by web applications (or client-side script), and\nmany programming languages have built-in functions or libraries which provide this encoding (also called quoting or\nescaping in this context). Note that the correct encoding of the output depends on the location that the data is to\nbe used within the response. In the case of it being within the main body of the document, HTML entities must be\nencoded. If the input is to be used within a script inside of a string, the quotes used for that string must be escaped.\nIn general, it is important to ensure that it is not possible for the data to include whatever sequence is used to demark the end of that data and the beginning of something else.\nThe application should be reviewed and, if necessary, modified, to handle malicious data properly. The specific in-\nstances identified in this finding should be addressed, and the application code base should also be examined for any\nsimilar issues which may exist.\nVersion 3.0- Page 9 of 32 Client Confidential\nAffects:\nIP Address DNS Name Page Parameter(s)\n10.x.x.x www.nccgroup-client.co.uk vulnerablepage.html\nvulnerablepage2.html\nemail_address\nemail_address\nVersion 3.0- Page 10 of 32 Client Confidential\n",
  "SR-102-002": "SR-102-002 Uploaded File Types Were Not Restricted\nRisk Rating Medium Status Open\nDescription:\nThe web application allowed any type of file to be uploaded, although anti-virus scanning was in place and would detect\nany attempt to upload malware. The lack of restrictions could allow an attacker to upload an otherwise legitimate file\ncontaining malicious code. For example, an attacker might be able target the server itself, by uploading a web shell\nthat would provide the attacker with the capability to run commands on the server and access the file system with the\nfull privileges of the web server process.\nAs a proof of concept, a .php file was uploaded containing malicious code. If triggered, this would have given the\nattacker command line execution.\nFigure 1: Uploaded PHP file\nAlthough it was possible to upload a file containing malicious code, access to the directory used to store the uploaded\nfiles required an Active Directory account. Accordingly, the risk associated with this issue has been lowered to Medium.\nRecommendation:\nThe file types allowed to be uploaded should be restricted to only those that are necessary for business functionality.\nu The application should perform filtering and content checking on any files which are uploaded to the server. Files\nshould be thoroughly scanned and validated before being made available to other users. If in doubt, the file should\nbe discarded.\nNote that the effectiveness of content-checking controls should not be wholly relied upon, and that they will only\nprovide benefit if the anti-virus and malware signatures are regularly updated.\nIt is also recommended that some consideration should be given to storing uploaded files in a database, rather than\non the file system. This would significantly reduce the risk associated with the file upload facility, but it is recognised\nthat this might require extensive changes to the current application design\nAffects:\nIP Address DNS Name\n192.1.1.111 www.nccgroup-client.co.uk\nVersion 3.0- Page 11 of 32 Client Confidential\n",
  "SR-102-003": "SR-102-003 HTTP Header Discloses Internal IP Address\nRisk Rating Low Status Open\nDescription:\nIt was possible to determine an internal IP address by sending a crafted request to the application. An attacker could\nuse this information to gain a greater understanding of the internal network and tailor further attacks.\nThe HTTP request and response shown below illustrate this issue.\nFigure 2: Figure 2‒HTTP response\nRecommendation:\nOn IIS version 7 and above, this issue can be addressed by setting the IIS alternateHostname property (as described\nat the www.iis.net link below). This allows the specified hostname to be used in place of the internal IP address\nin redirection responses. Testing should be performed to ensure that this does not adversely affect any legitimate\nredirection functionality in the application.1, 2\nAffects:\nIP Address DNS Name\n192.1.1.111 www.nccgroup-client.co.uk\n1CWE-200: Information Exposure: https://cwe.mitre.org/data/definitions/200.html\n2Microsoft Support - FIX: http://support.microsoft.com/kb/834141\nVersion 3.0- Page 12 of 32 Client Confidential\n",
  "SR-102-004": "SR-102-004 Username Enumeration via Login Function\nRisk Rating Low Status Open\nDescription:\nIt was possible to enumerate users of the website through the login mechanism. This provided different responses\nto failed login attempts depending on whether or not the supplied username was valid. An attacker could potentially\nuse this difference in behaviour to compile a list of valid usernames which could then be used as the basis for further\nattacks against the application.\nWhen an authentication attempt was made with a valid username but an incorrect password, the application returned\n‘Invalid password‒please try again’. When the username was not in use, the application returned ‘Your user name has\nnot been recognised‒please re-enter it’.\nFigure 3: Different responses returned by login functionality\nRecommendation:\nThe login mechanism should be modified to return the same error message for a failed login attempt regardless of\nwhether or not the supplied username is valid.3, 4\nAffects:\nIP Address DNS Name\n192.1.1.111 www.nccgroup-client.co.uk\n3Username Enumeration Vulnerabilitieshttps://www.gnucitizen.org/blog/username-enumeration-vulnerabilities/\n4Preventing username enumerationhttps://blog.portswigger.net/2007/04/preventing-username-enumeration.html\nVersion 3.0- Page 13 of 32 Client Confidential\n",
  "SR-102-005": "SR-102-005 Verbose Error Messages\nRisk Rating Low Status Open\nDescription:\nThe web application was configured to display detailed error messages when an application exception was generated.\nPrinting debugging information in the form of a stack trace associated with an error can leak information about\nthe internal structure of the application which could potentially lead to the discovery or classification of additional\nvulnerabilities.\nFigure 4: Example of verbose error message\nRecommendation:\nApplication errors should be handled gracefully, and unnecessary technical information should not be presented to\nusers. Applications should return suitably generic but user friendly error messages that do not disclose sensitive\ninformation.\nAffects:\nIP Address DNS Name\n192.1.1.111 www.nccgroup-client.co.uk\nVersion 3.0- Page 14 of 32 Client Confidential\n4.2 Phase 2 ‒Internal Infrastructure Assessment\n",
  "SR-102-006": "SR-102-006 Unsupported Operating System\nRisk Rating High Status Open\nDescription:\nWindows Server 2008 was found to be installed on the affected host. This software reached its end of life date in January\n2020 and is no longer supported by Microsoft. It may contain security vulnerabilities that will never be addressed by\nMicrosoft.\nFigure 5: Windows Server 2008 login page\nIn addition, the length of time this issue has remained unaddressed may indicate a gap in the software patching\nprocess.\nRecommendation:\nThis software should be upgraded to the latest stable, secure and supported version of the software.5\nInvestigate the software patching policy and procedures and ensure that updates are applied to all software installations, including third party applications, on a regular basis.\n5Microsoft Product Support Statushttps://docs.microsoft.com/en-us/lifecycle/products/windows-server-2003-\nVersion 3.0- Page 15 of 32 Client Confidential\nIn particular, it should be ensured that the patching procedures are sufficient to identify software which is about to\nreach end of life sufficiently early for extended support to be purchased or alternative software purchasedbefore end\nof life is reached. These procedures should acknowledge that software upgrades sometime also require hardware\nupgrades and factor this into the relevant timescales.\nAffects:\nIP Address DNS Name\n192.1.1.111 www.nccgroup-client.co.uk\nVersion 3.0- Page 16 of 32 Client Confidential\n",
  "SR-102-007": "SR-102-007 Certificate Signed With MD5 Hash\nRisk Rating Low Status Open\nDescription:\nThe SSL/TLS service on the Affected Hosts listed below presented an SSL certificate whose digital signature relied on\nthe MD5 hashing algorithm. MD5 is cryptographically weak and is vulnerable to collision attacks (in which input can\nbe crafted that will result in a hash identical to some other input). This principle can be used to generate spoofed SSL\ncertificates which will be accepted as valid by browsers.\nThis would allow an attacker to create their own certificate with the same signature as the genuine one. They could\nthen use this to masquerade as the affected service as the spoofed certificate would be indistinguishable from the\ngenuine one.\nWhilst this attack has been shown to be possible, it requires a significant amount of computing effort to produce the\nfalse certificate. Nevertheless, major browser vendors have already implemented updates which treat MD5 based\ncertificates as insecure and issue warnings to users (see References below).\nFigure 6: Screenshot with signed with MD5 hash\nRecommendation:\nRequest that the certificate authority reissue the certificate using a stronger hashing algorithm such as SHA-256.6, 7, 8, 9\nAffects:\nIP Address DNS Name\n192.1.1.111 www.nccgroup-client.co.uk\n6SSL Certificate Attack Using MD5 Collisionhttps://www.win.tue.nl/hashclash/rogue-ca/\n7Apple https://support.apple.com/kb/HT4999\n8Microsoft https://support.microsoft.com/kb/2862973\n9Chromium https://code.google.com/p/chromium/issues/detail?id=101123\nVersion 3.0- Page 17 of 32 Client Confidential\n",
  "SR-102-008": "SR-102-008 Closed UDP Ports Discovered\nRisk Rating Informational Status Open\nDescription:\nPort scans revealed the presence of closed UDP ports, which can be useful in fingerprinting systems and greatly speed\nup an attacker’s network scans.\nOpen UDP ports do not have to send an acknowledgement in response to a request, and closed ports are not even\nrequired to send an error packet. However, some devices do send an ICMP port unreachable packet when a packet is\nsent to a closed UDP port. Thus it may be possible to determine if a port is not open.\nClosed UDP ports can be useful for fingerprinting remote systems, and increase the accuracy of scan results. Unused\nports allowed through the firewall also provide an attacker with the ability to bind new services to them if a compromise\nhas occurred. This can enable an attacker to gain extended access or to bounce packets to deeper layers within the\narchitecture.\nFurthermore, closed ports can reveal the administrative habits and history of the device, potentially enabling identification of services that have been active in the past and that could be accessible in the future.\nRecommendation:\nAll attempts to access unused UDP ports should be silently dropped by filtering devices. This can be achieved through\nblocking the relevant port on the firewall device.\nAffects:\nIP Address DNS Name\n192.1.1.111 www.nccgroup-client.co.uk\nVersion 3.0- Page 18 of 32 Client Confidential\n4.3 Phase 3 ‒Mobile Application and Web Service Assessment\n",
  "SR-102-009": "SR-102-009 Hard-Coded Credentials\nRisk Rating Medium Status Open\nDescription:\nDuring testing, it was discovered that the application communicated with the web service using HTTP Basic authentication. When HTTP Basic authentication is used, the credentials are sent to the server in a base64 encoded format. No\ncookie or session is upheld, as the authentication header (the base64 string) is sent with each request to authenticate\nthe application’s request to the server.\nThe authentication token was the same for every request sent to the web service, suggesting that authentication was\non an application level, and users were only authenticated locally. The base64 encoded authentication token was\ndecoded, as per below:\nAuthentication Token: abcdefghiJKlmnopQrstuvwFtJTRATVhxWV5aSDRV\nDecoded from Base64: SVC-SITESBCert:R!m123456qY^ZH4U\nThe consultant then inspected the application binary, and discovered that these credentials were hard-coded into the\napplication.\nIf an attacker is able to gain access to the application binary, they would be able to recover the clear-text credentials\nused to communicate with the web service. Additionally, any attacker performing a successful man in the middle attack\ncould sniff the credentials from the HTTP session. Once the attacker has successfully obtained the credentials, they\nwould then be able to communicate directly with the web service, and carry out transactions with the same permissions\nas the application.\nRecommendation:\nCredentials should not be hard-coded into the application as these can easily be recovered by an attacker with access\nto the binary. If HTTP Basic authentication is used, it should be used in conjunction with properly configured TLS/SSL. In\naddition to authentication, each user of the application should be identified to the web service using an authorisation\ntoken, which should be checked to ensure the user is authorised to carry out the requested action. This ensures that\neven if an attacker gains access to the web service authentication credentials, they would not be authorised to carry\nout any transactions without an authorisation token.\nAffects:\n“ABC 123.ipa”\nVersion 3.0- Page 19 of 32 Client Confidential\n",
  "SR-102-010": "SR-102-010 SSL Certificate Checking Disabled\nRisk Rating Medium Status Open\nDescription:\nThe application was found to ignore the in-built iOS SSL certificate checking functionality. This meant that it was\npossible for an attacker to perform a man-in-the-middle attack by presenting their own SSL certificate, and thus nullifies\nthe use of SSL.\nIn iOS, when connecting to an HTTPS website, if the Common Name field in the SSL certificate presented by the server\ndoes not match the host and domain component of the URL, the warning message “Cannot Verify Server Identity” is\nautomatically displayed. The application should handle this case gracefully with NSURLConnection’s “connection: d\nidFailWithError” method.\nIt was discovered that the application disabled the default certificate checking, by using the NSURLConnectionconti\nnueWithoutCredentialForAuthenticationChallenge method. This may have been set by the developer to aid in\ndebugging, or for use when the SSL certificate is self-signed or unknown. Certificate checking should never be disabled\nin a production environment, and the server should always present a valid certificate from a trusted CA.\nRecommendation:\nIn a production environment, SSL certificate checking should be enforced to ensure the confidentiality and integrity\nof users’ information. The application should handle certificate mismatch errors, using the NSURLConnection “conn\nection:didFailWithError” method, and deny connections where there is a certificate mismatch. For a defence in\ndepth strategy, consider the use of certificate pinning to allow only connections using a specific certificate or signed\nby a specific CA.\nAffects:\n“ABC 123.ipa”\nVersion 3.0- Page 20 of 32 Client Confidential\n",
  "SR-102-011": "SR-102-011 No Jailbreak Detection\nRisk Rating Medium Status Open\nDescription:\nAllowing the application to be installed or run on a jailbroken device exposes the application to trivial and sophisticated\nattacks, and to reverse engineering.\niOS jailbreaking refers to the process of removing the limitations imposed by Apple on devices (such as the iPhone,\niPod touch and iPad) through the use of exploit tools. Jailbreaking enables users to gain complete control of the iOS\noperating system, allowing them to download additional applications which are not available via the Apple store, and\nto use the device freely with any carrier. Jailbreaking an iOS device can be a trivial process which takes around five or\nten minutes; this process can be undone by reinstalling iOS (in around thirty minutes).\nHowever, jailbreaking an iOS device in this way has security implications, because untrusted code can be installed,\nsecurity protections can be removed, and installed applications and data can be tampered with (as well as an increased\npotential for malware on the device). In short, all iOS protection mechanisms can be bypassed if a device has been\njailbroken, and as such there can be no inherent guarantee of a secure platform, and any data at rest can potentially\nbe decrypted.\nAdditionally, jailbreaking can be used on a stolen device in order to help retrieve data from it and access installed\napplications and services. If the device has no passcode, or a weak passcode set, then the device could be jailbroken\nto break the security protections included by default.\nRecommendation:\nIt is considered a good security practice to:10\nu Detect the presence of a jailbreak\nu Refuse to install or run on a system which has been jailbroken\nBelow is a very simple example of a test for jailbroken devices (obviously to be successful, more sophisticated checks\nare required):\nBOOL isJailbroken()\n{\n#if TARGET_IPHONE_SIMULATOR\nreturn NO;\n#else\nFILE *f = fopen(\"/bin/bash\", \"r\");\nif (errno == ENOENT)\n{\n// device is NOT jailbroken\nfclose(f);\nreturn NO;\n}\nelse {\n// device IS jailbroken\nfclose(f);\nreturn YES;\n}\n#endif\n}\nAffects:\n“ABC 123.ipa”\n10OWASP Jailbreak Cheatsheethttps://www.owasp.org/index.php/Mobile_Jailbreaking_Cheat_Sheet\nVersion 3.0- Page 21 of 32 Client Confidential\n",
  "SR-102-012": "SR-102-012 SSL/TLS Renegotiation DoS\nRisk Rating Medium Status Open\nDescription:\nThe remote service encrypts traffic using TLS/SSL but allows a client to renegotiate the connection after the initial\nhandshake.\nAn attacker could use this vulnerability to trigger renegotiation of existing SSL connections to cause a denial of service\ndue to resource exhaustion on the server. Publicly available DoS tools could take advantage of the renegotiation to\nautomate an attack against the server.\nRecommendation:\nDisable renegotiation on the server-side completely.\nAffects:\nIP Address DNS Name Port\n192.1.1.121 nccgroup-client.co.uk 7083\nVersion 3.0- Page 22 of 32 Client Confidential\n",
  "SR-102-014": "SR-102-014 Backgrounding Screenshots Enabled\nRisk Rating Low Status Open\nDescription:\nBy default, when an iOS application is sent to the background (e.g. by pressing the Home button), the operating system\nwill take a screenshot of the current UI and store it for future use. The mobile application did not disable this feature,\nand hence screenshots containing information on an on-going credit card transaction could be written to the device\nfile system.\nA user can put an application into a background or suspended state by either single-clicking or double-clicking the\nhome button on the iOS device. Double-clicking the home button will show the current list of backgrounded applications available for switching to the foreground. To help users identify each application, iOS by default will capture\na screenshot of the application as it is closed and display that to the user. Two images will be saved in the following\nlocations:\n<App>/Library/Caches/Snapshots/<app identifier>/Main/<image.png>\n<App>/Library/Caches/Snapshots/<app identifier>/Main-downscaled/<image.png>\nFigure 7: Backgrounding screenshot [example]\nVersion 3.0- Page 23 of 32 Client Confidential\nIn order to exploit this issue, an attacker would have to gain access to the device file system (e.g. by stealing a device,\nobtaining the user’s PIN, and jailbreaking it).\nRecommendation:\nThe application should prevent iOS from taking a snapshot of sensitive data when the background or suspended state\nis entered.11, 12, 13\nThe application can programmatically hide or eliminate sensitive data from the screen before the snapshot is taken.\nThis can be accomplished by setting window.hidden to YES in the applicationDidEnterBackground delegate and win-\ndow.hidden to NO in the applicationWillEnterForeground delegate. This will have the effect of blanking out the UI\nbefore the screenshot is taken and redraws is when the application is relaunched.\nThe exact method used to hide the sensitive data will depend on the application, but some common techniques\ninclude blanking of sensitive data fields, covering the entire UI with a default image, or distorting the UI using the\nUIImageEffects class which is available from iOS 7 onwards.\nAffects:\n“ABC 123.ipa”\n11iOS Developer Documentation for UIImageEffects: https://developer.apple.com/library/prerelease/ios/samplecode/UIImageEffects/Introduction/\nIntro.html#//apple_ref/doc/uid/DTS40013396-Intro-DontLinkElementID_2\n12iOS Background Screen Caching: https://www.virtuesecurity.com/blog/ios-background-screen-caching/\n13iOS Developer Documentation IgnoreSnapshot: https://developer.apple.com/library/ios/documentation/UIKit/Reference/UIApplication_Class/#//\napple_ref/occ/instm/UIApplication/ignoreSnapshotOnNextApplicationLaunch\nVersion 3.0- Page 24 of 32 Client Confidential\n",
  "SR-102-015": "SR-102-015 Manual Screenshots Not Disabled\nRisk Rating Low Status Open\nDescription:\nIt was possible for the user to take screen captures of the mobile application, using iOS’s screenshot key combination.\nThis could lead to images containing sensitive information (such as recently accessed client information) being stored\nin unencrypted form on the device file system. Although it is perhaps unlikely that the user would deliberately take\nscreenshots of their online banking data, it is relatively easy to press the relevant key combination by accident, and\nthis could lead to the inadvertent leakage of sensitive data.\nThe image below is a manual screenshot taken on an iOS device (using thePower+Home key combination):\nFigure 8: Mobile application screenshot [example]\nRecommendation:\nThere is no documented method to prevent manual screenshots being taken on iOS at the time of writing, and hence\nthis risk has to be accepted by ClientName.14\nAffects:\n“ABC 123.ipa”\n14How to take a screenshot on your iPhone, iPad, and iPod touchhttps://support.apple.com/en-gb/HT200289\nVersion 3.0- Page 25 of 32 Client Confidential\n",
  "SR-102-016": "SR-102-016 No Support for TLS Versions Above 1.0\nRisk Rating Low Status Open\nDescription:\nThe affected server did not support TLS above version 1.0. Since 2008, TLS has been at version 1.2, with version 1.3\nbeing defined in August 2018. Versions 1.2 and 1.3 of TLS are more resistant to known attacks, and TLSv1.2 supports\nmore modern cipher suites that are widely acknowledged to offer the best cryptography available for securing Internet\nconnections. TLSv1.3 further improves on security by removing unsafe or unused features, eliminating unnecessary\nhandshake steps and forcing the use of newer encryption methods. It should be noted that use of TLS 1.0 and 1.1 is\nnow flagged as insecure (such as by browser warnings) by the major browsers, and in January 2021 the NSA issued\nguidance urging system administrators to only provide support for TLS versions 1.2 or 1.3.15\nTLS 1.0 was the highest protocol version supported, as shown inSupplemental Data - SSLScan Output on page 30.\nRecent versions of all web browsers support 1.2 and 1.3, and therefore supporting these protocols server-side offers\nbetter security for those clients using modern browsers. TLSv1.2 also supports a class of cipher suites that offer\nAuthenticated Encryption with Associated Data (AEAD). These cipher suites include an authenticated integrity check\nwithin the encryption operation, and are resistant to more attacks than their older counterparts. Google’s Chrome\nbrowser states that the security of connections to websites that do not use AEAD ciphers is “obsolete”. Currently, this\nis not presented as an error to the user, merely as information for anyone viewing the page’s security report (in the\nbrowser’s developer console). However, as Google continues to push for the rapid adoption of more robust Internet\ncryptography, this message may become more prominent.\nTLSv1.3 was approved for use in August 2018 and goes to further enhance security. The security benefits of TLSv1.3\ninclude the removal of unsafe or unused features, elimination of unnecessary handshake steps and the forced use of\nnewer encryption methods. As well as preventing encryption downgrade attacks, the streamlined approach to session\ninitiation will offer performance gains over previous TLS implementations.\nIt should be noted that major browser vendors have stated that support for TLSv1.0 and 1.1 will be dropped in the\nnear future.\nSupporting TLS 1.0 as a security control is non-compliant with the Payment Card Industry (PCI) Data Security Standard\n(DSS). While these regulations may not be directly relevant, it should be expected that this directive will become security\nbest practice and may also be reflected in more obvious ways, such as web browser warnings.\nRecommendation:\nAdd support for TLS v1.2 and v1.3.16, 17, 18, 19, 20, 21, 22\nSupport for TLS version 1.0 should be disabled unless there is a specific business requirement to allow users of older,\nless secure browsers to continue to connect. Consider also disabling support for version 1.1, which will become\nunsupported by major browsers in the near future.\nAll affected hosts should be configured to prefer the latest cipher suites that they offer, such as AES-GCM (TLS 1.2 and\n1.3 only).\nThe reference from Mozilla below provides recommendations on cipher suite ordering based on the profile of con-\n15Eliminating Obsolete Transport Layer Security (TLS) Protocol Configurations -https://media.defense.gov/2021/Jan/05/2002560140/-1/-1/0/ELIMI\nNATING_OBSOLETE_TLS_UOO197443-20.PDF\n16Mozilla Server Side TLS:https://wiki.mozilla.org/Security/Server_Side_TLS#Recommended_configurations\n17Obsolete Cipher Suites:https://www.chromium.org/Home/chromium-security/education/tls#TOC-Obsolete-Cipher-Suites\n18OWASP Transport Layer Protection Cheat Sheet:https://cheatsheetseries.owasp.org/cheatsheets/Transport_Layer_Protection_Cheat_Sheet.html\n19NCC Group Whitepaper on the Configuration of SSL/TLS Services:www.nccgroup.com\n20PCI Security Standards Council:https://www.pcisecuritystandards.org/documents/Migrating-from-SSL-Early-TLS-Info-Supp-v1_1.pdf\n21Saying Goodbye to SSL/Early TLS:blog.pcisecuritystandards.org\n22Overview of TLS v1.3:https://owasp.org/www-pdf-archive/OWASPLondon20180125_TLSv1.3_Andy_Brodie.pdf\nVersion 3.0- Page 26 of 32 Client Confidential\nnecting clients.\nAffects:\nIP Address DNS Name Port\n192.1.1.121 nccgroup-client.co.uk 7083\nVersion 3.0- Page 27 of 32 Client Confidential\n"
}